{"custom_id": "N54735", "method": "POST", "url": "/v1/embeddings", "body": {"input": "This former N.J. high school football star has been this season's best NFL trade acquisition | Here's why When the Steelers traded a first round draft pick to the Miami Dolphins for second-year free safety Minkah Fitzpatrick, a common reaction was that Pittsburgh got fleeced out of a likely top 10 selection. Two months later, it's clear that it was the Steelers that got away with highway robbery. The Old Bridge native has been playing out of his mind since moving back north. Through seven games in ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39049", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cubs By The Numbers: At last, a mystery about an unknown uniform number is solved The single missing Cubs uniform number has been found... and it's got a fascinating story behind it.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44697", "method": "POST", "url": "/v1/embeddings", "body": {"input": "With Warriors crumbling, there's officially a new most hated team in the NBA Sportsinsider.com's extensive Twitter analysis revealed that California-based teams are hated above all other NBA franchises.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22374", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chiefs vs Vikings: Five stats to know Five numbers to know ahead of the Chiefs taking on the Packers on Sunday Night Football", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53235", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Texas grasping for answers after all-phases meltdown vs. TCU The concrete walls encircling the field at Amon G. Carter Stadium weren't going to be enough to stop the flood.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9625", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Saturday Dawg Chow: Browns news (10/19/19) More of the latest Browns news and notes from around the web in today's dose of the Saturday Dawg Chow.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7620", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Why Damian Lillard and C.J. McCollum have stayed loyal to Portland Trail Blazers The Trail Blazers' Damian Lillard and C.J. McCollum represent the rare NBA stars who have resisted forging new alliances in different uniforms.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43670", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Draymond criticizes official for ejection: 'Don't tell me not to talk' Golden State Warriors forward Draymond Green made Chase Center history during Monday's loss to the Utah Jazz, becoming the first player ejected from a game in the new venue after arguing with an official. The three-time All-Star was given a second technical foul for continuing to plead his case after disagreeing with a blocking call, but it seems Green's spat with the official went beyond just that foul. \"I disagreed with that call,\" Green told...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18737", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Keselowski after Kansas cut: 'I don't like it, but it's over now' Brad Keselowski was eliminated from the NASCAR Playoff after the race at Kansas Speedway, finishing one spot below the cutline with his 19th-place run.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56871", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Korn Ferry national qualifier field set at Orange County National The Korn Ferry Tour National Qualifying Tournament field has been set with 114 players coming out of five second-stage qualifiers last week and this week. They advanced to Orange County National's Cat Crooked Cat and Panthers Lake Courses in Winter Garden Dec. 12-15 to determine eligibility onto the 2020 Korn Ferry Tour. Here's how the finish at OCN will decide the pecking order:   The ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13544", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Open thread: Is Matt Patricia on the hot seat? The Lions are all but eliminated from postseason contention.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18913", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Babe Ruth's bat used for 500th homer, owned by Rockland family, hits auction block In the mid-1940s, Ruth gave the bat to his friend Jim Rice, who was mayor of Suffern.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38381", "method": "POST", "url": "/v1/embeddings", "body": {"input": "2020 College Soccer Signing Tracker National Signing Day kicked off the 2020 college soccer signing season on November 13", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50470", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Patriots Practice Notes: Perfect Attendance At Rainy Halloween Session FOXBORO Mass. -- Every New England Patriots players was present and accounted for Thursday at the team's penultimate practice of Week . The Patriots had perfect attendance at the rainy", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25797", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Thunder: Both spurned by Paul George, Thunder and Pacers face off with strong replacements On Tuesday, Paul George's two exes meet: Oklahoma City and Indiana. Both teams have been dumped by the six-time All-Star in the last three years. He's now with the one that got away, Los Angeles (although that metaphor works better for the city than the Clippers specifically). By the time Paul left OKC, he and his agent had figured out how to help facilitate a clean break. The split ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50858", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kirk Cousins is playing at an MVP level. Here's why it won't last. The Vikings are getting the good version of Good Kirk Cousins right now, but Bad Kirk Cousins could make a return very soon.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54237", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tom Brady Admits He's Still Not Over Super Bowl Loss to Eagles The last time the Patriots faced the Eagles was Super Bowl LII when Tom Brady threw for 505 yards, but still lost the game, 41-33. With the two teams meeting again this week, the game will be a topic over the course of the week and Brady was asked Monday morning on The Greg Hill Show how long it took for him to get over the loss? \"You assume I'm over it? Come on now,\" Brady said. \"That's a lot of mental scar tissue from that year. That was a...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38836", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Sharks score first four goals, then hold off Wild Thursday was the kind of game a lot of the Sharks needed. As did the team itself. San Jose scored four goals in the first period then held on for dear life to beat Minnesota 6-5 at SAP Center. The Sharks have strung consecutive victories together for the first time since winning three straight Oct. 10-16. And their latest victory included flashes of dominance ... before the team surrendered three late goals to make life hard on itself. \"There's...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18939", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Charles Barkley: 'At this point, Kawhi's a better player than LeBron' TNT Analyst Charles Barkley said Kawhi Leonard is a better player than LeBron James.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N60740", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Denver Stiffs Show - The Nuggets aren't good when they're hungry On Halloween, the problems the Nuggets are facing can be quite frightening", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64130", "method": "POST", "url": "/v1/embeddings", "body": {"input": "ON THE GUN: Browning X-Bolt Max Long Range Browning's new X-Bolt Max Long Range checks all the boxes for an affordable, long-range hunting rig: it's super accurate, runs flawlessly, it's heavy but still handy, and it costs just a little more than $1,000.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55018", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL Odds: Here's Why Expert Picks Eagles In Week 11 Game Vs. Patriots https://www.dailymotion.com/embed/video/x o f Dave Weaver seems certain the Philadelphia Eagles won't let the New England Patriots fly beyond their reach. The sports-betting expert predicts the Eagles will cover the spread", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47847", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jets GM defends CEO's 'hopefully the team will actually show up' crack to fans Frankly, he deserves better than 1-6, general manager Joe Douglas said Tuesday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11625", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The reinventing of Captain America is underway Patrick Reed went from Captain America to persona non grata. With his Presidents Cup nod, he's working his way back into the former role.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1890", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ngannou Laughs At UFC's 'Funny' Games Former UFC heavyweight title contender, Francis Ngannou, took to social media to take a slight jab at UFC after the promotion gave the Alexander Volkov fight to Greg Hardy instead of him.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6054", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Could a 'bombshell candidate' shake up Mets' managerial search? The timing of this report suggests more of a PR move for the Mets to drum up interest in the job, but don't dismiss the possibility of a legitimate surprise candidate emerging.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61818", "method": "POST", "url": "/v1/embeddings", "body": {"input": "High School Volleyball: Clemens continues to lead rankings. Rankings Team W-L Dist. Prev. 1. Clemens 38-4 26-6A 1 2. Clark 38-7 28-6A 2 3. Churchill 34-7 27-6A 3 4. Reagan 37-8 27-6A 4 5. O'Connor 37-11 28-6A 5 6. Brandeis 34-11 28-6A 6 7. NB Canyon 32-15 26-6A 7 8. Harlan 34-8 28-5A 8 9. La Vernia 41-5 30-4A 9 10. Antonian 30-17 TAPPS 10 Records are through Saturday's games. Player of the week Malia Viernes, Steele: senior, outside hitter   Had 28 kills, 27 digs, two aces and two blocks as the Knights...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27653", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Four-star Horn Lake lineman Josaih Hayes decommits from Ole Miss The Horn Lake standout has reopened his recruitment.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24878", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Football Top 20 profile: St. Joseph (Hamm.) playing the waiting game 15-St. Joseph (Hamm.) (8-1) Last week: No. 15 Here's why: St. Joseph (Hamm.) had a bye in the first round of the Non-Public 2 tournament last week and has an unwanted second week off since six teams that could have been part of the field opted out of the Non-Public 2 tournament, leaving just seven teams. St. Joseph (Hamm.) is looking for a Thanksgiving week game to fill the void and prevent ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49780", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eagles cut Zach Brown after he acts like Zach Clown See ya.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64953", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Roman Torres says his status is up to Sounders Torres apparently has an offer from Millonarios, but Sounders still hold a club option.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N60163", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chiefs Thursday injury report vs. Titans: Patrick Mahomes tracking to play on Sunday The Chiefs quarterback was a \"full\" participant for the second day in a row on Thursday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34917", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Great Takes Less Filling: WOOOOOOOOOOOOOOO! That happened. That really happened and it's amazing!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21233", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Predators: Living on the edge not safest neighborhood Predators know they can't live life from behind.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28082", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL home-field advantage has completely disappeared in 2019 Home teams have won 56 percent of the games played in modern NFL history, an era which dates back to the 1970 AFL-NFL merger. Home teams have covered the spread 49.9 percent of the time, while road teams have covered in 50.1 percent of games. Meanwhile, home teams that are favorites in Las Vegas have Read more... The post NFL home-field advantage has completely disappeared in 2019 appeared first on The Comeback.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N19129", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Yankees 2019 Roster Report Card: Aaron Hicks Hicks' 2019 was marred by injuries after signing his extension.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8609", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Iowa State Football: Charlie Kolar providing a big option in the pass game Charlie Kolar is on pace to have one of the most prolific seasons for a tight end in Iowa State football history. The scary thing is how unsatisfied he is so far. Tthe redshirt sophomore recognizes the strides he's made within the offense, not just because he has more tangible numbers in terms of catches and yards, but he can see it and feel it when he engages in a block. Still, Kolar wants ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N31980", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Deion Sanders hasn't talked to Florida State about job he's a rumored candidate for Seems kind of important, dont you think?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29311", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Yankees, Astros Game 1 ALCS lineups | Aaron Boone does some tinkering HOUSTON - The New York Yankees and Houston Astros were powerhouses in the regular season and fittingly will be meeting up in the American League Championship Series with the winner advancing to the World Series. Game 1 will be played Saturday night at Minute Maid Park. First pitch is scheduled for 8:08 p.m., EST. The pitching matchup has two veteran righties starting, Masahiro Tanaka for the ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5836", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What it's like when your dream of playing professional golf finally works out in your 40s Fast Eddie Fernandes washed out in his attempt to play on the PGA Tour, but found a second life in pro golf when he joined the World Long Drive Tour", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2161", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Free agent target: Alex Gordon The longtime Royal has parted ways with the division rival.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40310", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eagles-Vikings: Five reasons for the Birds' loss | Paul Domowitch This wasn't the way the Eagles wanted to start their string of three straight away games, getting clobbered, 38-20, by the Vikings on Sunday. Here are five reasons that happened. Coverage problems Cornerbacks Rasul Douglas and Sidney Jones both had bad-awful days as Kirk Cousins completed 22 of 29 passes for 333 yards and four touchdowns. Jones got beaten by Adam Thielen on a double move for a ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44635", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cowboys vs. Vikings: Three predictions for Week 10 Check out our three predictions for Week 10 against Minnesota.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2844", "method": "POST", "url": "/v1/embeddings", "body": {"input": "LeBron James: 'Everyone had doubt' whether an NBA team would sign Carmelo Anthony LeBron James had doubts Carmelo Anthony would get another chance to play in the NBA, had hoped Los Angeles Lakers would sign him last season.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20179", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Veronica Macedo steps in to fight Ariane Lipski at UFC Sao Paulo Veronica Macedo will replace Priscila Cachoeira as Ariane Lipski's opponent for Nov. 16.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43036", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tom Brady Excited By Patriots' Acquisition Of Receiver Mohamed Sanu The New England Patriots got Tom Brady some help Tuesday when they sent a second-round pick to the Atlanta Falcons for veteran wide receiver Mohamed Sanu. Brady is happy with the new addition", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62384", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Blues captain Alex Pietrangelo faces uncertain future with free agency looming In terms of what it might take for the Blues to retain Pietrangelo, an easy comparison can be made to the Predators' eight-year, $72.5M extension for Roman Josi.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11943", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Vista Ridge rally tops Round Rock, clinches playoff berth for Rangers In the tight District 13-6A standings, Vista Ridge and Round Rock faced off with a playoff spot on the line Thursday night. Of all the playoff permutations, the only scenario which would leave the Rangers without a postseason appearance would have been a Dragons victory by nine points or more. And at halftime, Round Rock had built a 31-21 lead. But the Rangers pulled out their third straight ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57388", "method": "POST", "url": "/v1/embeddings", "body": {"input": "So far the World Series is one big reminder that you can't predict October baseball You only needed to stand by the exit of Minute Maid Park for a few minutes in the eighth inning of World Series Game 2 to know what Astros fans thought of the mauling that was still taking place.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N31563", "method": "POST", "url": "/v1/embeddings", "body": {"input": "UCLA Basketball Player Position Preview Part 1: Bigs UCLA Looks \"Starless\" But Deep at the Four and Five Positions", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28652", "method": "POST", "url": "/v1/embeddings", "body": {"input": "A detailed breakdown on how the Steelers stalled the Rams offense on 3rd downs NFL Network's Brian Baldinger diagrams just how the Steelers stymied the Rams' offense in Week 10.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29997", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Starting Grid: Ryan Blaney or Kyle Larson for clutch Phoenix win? NASCAR.com's Chase Wilhelm previews the Monster Energy NASCAR Cup Series Playoffs Round of 8 elimination race at ISM Raceway.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N19808", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bill O'Brien says cornerback Johanthan Joseph is 'day to day' for Texans Houston Texans coach Bill O'Brien says that cornerback Johnathan Joseph is day to day as they prepare for the Indianapolis Colts in Week 7.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17857", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Flyers Weekly Takeaways: Matt Niskanen Making Difference; Patience Key With Nolan Patrick Situation Matt Niskanen is making a major difference for the Flyers' top pair in his first season in Philadelphia.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36041", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Greenhill School Comes Through For Rival St. Mark's After Tornado: 'It's Really A Rallying Point' St. Mark's School of Texas sustained major damage, but rather than cancel homecoming, they accepted an invitation by rival Greenhill School to change the venue.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43067", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Browns winners and losers from Week 9 vs. the Broncos CLEVELAND, Ohio   The Browns lost to the Broncos on Sunday, 24-19. But that's just what the scoreboard said. Here are the real winners and losers: WINNER: The red zone The Browns have been dominated by the red zone this season. They were ranked 22nd in points per red zone appearance through eight weeks (4.22), according to Football Outsiders. On Sunday, the Browns reached the red zone five ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1458", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Asheville High football coach David Burdette resigns After four seasons as head football coach at Asheville High, David Burdette has resigned.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11603", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Astros notebook: Yordan Álvarez 'mad for the right reasons' NEW YORK   After Yordan Álvarez smashed and snapped his bat in a bout of frustration following a strikeout in Game 2 of the American League Championship Series, manager A.J. Hinch had only one question.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62710", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL: Redskins? Dolphins? Bengals? Which team is the most hopeless? There are four winless teams left in the NFL, and optimism could be in short supply for each of the franchises. But which one is the most hopeless?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53517", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Memphis Zoo's oldest Giraffe, Marilyn, dies at 26 MEMPHIS, Tenn. (AP)   Memphis Zoo officials have announced that its oldest giraffe has died at 26. The zoo said in a Facebook post Wednesday that it was grateful to have cared for Marilyn the giraffe for almost two decades and called her a \"favorite\" among feeders. The Commercial Appeal reports Marilyn came to the zoo in 2002 and gave birth to six calves throughout her time there. Those calves also later had babies of their own. Zoo officials...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35967", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Strong's clock management in question at end of South Florida loss to Temple Charlie Strong showed a real lack of urgency with his team down 10 with two minutes remaining in the game.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40231", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Trent Brown allegations test Raiders owner's stand against domestic abuse A 6-foot-8, 360-pound NFL player is accused of slapping, punching and choking his live-in partner, the mother of his child. Multiple times. Police were reportedly called. Now a civil lawsuit has been filed. Mark Davis, what's your move? The allegations that broke Wednesday morning that Raiders offensive tackle Trent Brown was the aggressor in multiple incidents of domestic abuse are the latest disruption for a Raiders team that has seen its...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56614", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dion Waiters to miss next two games Waiters' served a one-game suspension Wednesday night.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18488", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: QB Russell Wilson wanted Seahawks to sign Antonio Brown ESPN reported that Seattle showed interest in Brown before claiming veteran Josh Gordon off waivers on Friday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N60979", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Carlos Correa took clever swipe at Yankees after ALCS victory Carlos Correa can afford to talk a bit of smack now.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33712", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dolphins expect reinforcements from PUP list and injured reserve, but which players? The Miami Dolphins have reinforcements coming in the next few weeks. Four players are eligible to come off injured reserve or the team's physically unable to perform list this month if the Dolphins decide to activate them, adding a few veterans to the 53-man roster. Cornerback Cordrea Tankersley, who started 11 games the past two seasons, is working his way back from a torn anterior cruciate ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61523", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ravens' Brandon Williams Compares Tom Brady, Patriots To Snakes Ahead Of Week 9 The New England Patriots have been called a number of things over the years but a snake isn't one that's used too often. Enter: Brandon Williams. New England is set", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13479", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Earthquake Swarm Rattles Ventura/LA Region Nine noteworthy earthquakes struck Ventura Friday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15548", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Stenhouse on 2020 plans: 'It's not a quick process' Ricky Stenhouse Jr. talks about his chances to win at Talladega Superspeedway and offers an update on his job search for the 2020 season.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42913", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bill Belichick offers an update on N'Keal Harry He's a lot better than he was earlier in the year, even two weeks ago.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N65075", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Miami's Williams throws 6th TD pass against Louisville Redshirt freshman quarterback Jarren Williams broke a Miami Hurricanes passing record by throwing his sixth touchdown of the game against Louisville in this ACC Must See Moment!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28151", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Reid says Mahomes out for Sunday against Green Bay, Watkins will play KANSAS CITY, MO (KCTV)   Kansas City Chiefs head coach Andy Reid said Friday that quarterback Patrick Mahomes would not play Sunday night against Green Bay but that that receiver Sammy Watkins would be back in the lineup. In addition to Mahomes, Reid said that Chris Jones, Frank Clark, Kendall Fuller, Eric Fisher and Andrew Wylie will be out for the game with the Packers. The coach said that while the MVP wanted to get back on the field, \"he...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8806", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Detroit Lions coach Matt Patricia insists Bears QB Mitchell Trubisky 'a great player' Mitchell Trubisky has struggled at QB since the Chicago Bears took him in the 2017 draft, but the Detroit Lions are still wary of his abilities", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24390", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Open Thread: Phoenix Suns (6-3) vs. Los Angeles Lakers (7-2) Will the Suns continue to make waves nationally with another big win?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18120", "method": "POST", "url": "/v1/embeddings", "body": {"input": "First-half grades for first-year coaches in college football At the halfway point of their first seasons at new schools, it's time to hand out letter grades for college football coaches making debuts.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52629", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dion Waiters' mother calls 'gummies' overdose report 'fake news' Dion Waiters' mother posted on Instagram Saturday morning to dismiss a report about her son's health.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20370", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Seven Grand Rapids volleyball teams headed to regionals Byron Center became the seventh Grand Rapids area volleyball team to earn a district championship. The Bulldogs defeated East Kentwood 3-0 in Saturday's Division 1 district finals at East Grand Rapids. Byron Center will take on Lowell in Tuesday's regional final at Holland West Ottawa. Check out where all regional qualifiers are headed below: DIVISION 1 At West Ottawa Tuesday: Byron Center vs. ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61114", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nationals fans, welcome to the World Series. Here's hoping you make it to the end. Game 1 was a heart attack of a win in Washington's first Fall Classic appearance in 86 years. Are you ready for more?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38454", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What Detroit Lions' Bevell says about NFL officiating and pass-interference calls Detroit Lions coach Matt Patricia didn't challenge two potential pass interference penalties because odds are against the calls being overturned.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28418", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Watch: Kemba Walker emotional in introductions during return to Charlotte Kemba Walker made an emotional return to Charlotte, where he spent the first eight seasons of his career, as his Celtics came down to face his old Hornets squad.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1434", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Arizona fires defensive coordinator Marcel Yates Kevin Sumlin made two changes to his staff on Sunday night.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48411", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Urban Meyer calls for uniform scheduling to fix 'failed' College Football Playoff Urban Meyer doesn't think the College Football Playoff working in its current incarnation, and he has a reason why.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20481", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bow on top of a car as Spurs honor Tony Parker The first sign this was going to be a different sort of night at the AT&T Center was literally a sign welcoming fans to the arena. The two words on it, also repeated on T-shirts provided to all fans attending Monday's Spurs-Memphis game, provided a theme for the evening: \"Merci Tony.\" In a ceremony after the Spurs' 113-109 loss to the Grizzlies, the Spurs made No. 9 the 10th jersey retired in club history. Spurs Nation: Get the latest Spurs...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59570", "method": "POST", "url": "/v1/embeddings", "body": {"input": "WATCH: Highlight video from Cardinals' 34-33 win over Falcons Watch the highlights of the Week 6 matchup between the Atlanta Falcons and the Arizona Cardinals.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64574", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Grading the Browns safeties: Hybrids play a key role for the defense CLEVELAND, Ohio -- The Browns came into this season looking to find a second safety to play next to Damarious Randall, and they have thrown a few different resources at the position. They signed Morgan Burnett, drafted Sheldrick Redwine and gave Jermaine Whitehead, a waiver claim last season, a shot. The safety position on this team in general is a hybrid. Randall has manned free safety most ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5747", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dale Jarrett's advice to Bubba Wallace on spin: 'Keep your mouth shut' Dale Jarrett said Bubba Wallace could likely have avoided the fine and points penalty if he would just have kept quiet.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54419", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Trent Williams fails physical, experiencing discomfort with helmet Washington Redskins tackle Trent Williams' health situation has managed to get stranger after he reported to the team.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39254", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Philadelphia Eagles injury updates on DeSean Jackson, Alshon Jeffery, Jason Peters and more PHILADELPHIA -- Alshon Jeffery left the final drive of the Philadelphia Eagles' Week 9 win over the Chicago Bears with an ankle injury and did not return, but coach Doug Pederson said the team's week off for its bye was beneficial for the veteran wide receiver. \"It helped him,\" Pederson said Wednesday morning. \"He's still sore. Obviously, a lot of guys are still sore, but it helped him, and ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52531", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Holani's 4 TDs lead No. 21 Boise St. past San Jose St. 52-42 SAN JOSE, Calif. (AP)   George Holani ran for 126 yards and four touchdowns and No. 21 Boise State bounced back from its first loss of the season by beating San Jose State 52-42 on Saturday night. The Broncos (7-1, 4-0 Mountain West) lost 28-25 at BYU two weeks ago with starting quarterback Hank Bachmeier sidelined but responded following a week off despite falling into an early 14-0 hole. Boise State had six rushing touchdowns and 253 yards on...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4810", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Giants face PR mess: If Gabe Kapler is innocent, is Farhan Zaidi guilty? Farhan Zaidi took a huge chance hiring Gabe Kapler as the Giants' next manager. Now, he has to wear it. The PR campaign to convince the world he made the right decision began Wednesday morning, with Zaidi appearing on sports talk radio to play defense. KNBR's Brian Murphy asked Zaidi, why would he hire a man with so much baggage? Why would he want to create such a firestorm? Zaidi calmly explained that he believes in Kapler and his character....", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N19884", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Wounded Stars Fly into Winnipeg A morning puck drop after an extended break may not be ideal. Dallas hits western Canada as the injury turnstile keeps turning.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6661", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'Armed and dangerous' man wanted in Polk County double homicide The search is on for a man wanted for murder in Tennessee and for a double homicide in Polk County. Stanley Eric Mossburg, 35, who also goes by the nickname \"Woo Woo,\" last was seen driving a stolen 2013 black Hyundai Tuscon with Florida tag D5BPK, according to the Polk County Sheriff's Office. The car last was seen in the area of 17th Street NE and Dundee Road. Mossburg is considered armed and dangerous. Anyone who sees him is asked to call...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44705", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tigers use 3 TD run to break away from Stony Brook 31-14 STONY BROOK, N.Y. (AP)   Tom Flacco passed for two touchdowns and Towson used a run of unanswered points to defeat Stony Brook 31-14 Saturday. The Tigers (6-4, 3-3 Colonial Athletic Association) trailed Stony Brook 7-3 in the second quarter before scoring 14 points to close out the first half and seven more to open the second half. The 21-0 run put the game away. Shane Leatherbury scored on a 12-yard run with 4:43 left in the second quarter and,...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27297", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Sheriff investigating incident at Belle Chasse vs. Landry-Walker football game Deputies are investigating the chaotic aftermath of a high school football game that left the benches cleared and led to a man being detained on the field Friday night. The incident happened at the end of the Belle Chasse vs. Landry-Walker game in Plaquemines Parish Friday that kicked off 7 p.m. Friday. Viewer videos capture the moments following the final whistle, when the two teams met at the center of the field in a scuffle that involved both...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56330", "method": "POST", "url": "/v1/embeddings", "body": {"input": "4-star CB Ethan Pouncey decommits from Texas The Horns are now short on cornerback commits after losing two pledges recently.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25500", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Panthers pick Alabama WR in first round of new 2020 NFL mock draft In a new mock draft by Chris Trapasso at CBS Sports, the Panthers use the No. 20 overall pick on Alabama wide receiver Henry Ruggs III.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30352", "method": "POST", "url": "/v1/embeddings", "body": {"input": "John McClain's 2019 NFL power rankings: Week 7 The Texans keep moving up, and the Cowboys keep going the other direction in John McClain's weekly NFL power rankings: 1. New England (6-0) | Last week: 1 The AFC's only undefeated team has played one team with a winning record. Their easy schedule continues at the Jets. 2. New Orleans (5-1) | Last week: 2 The Saints have won four in a row since Teddy Bridgewater replaced the injured Drew Brees. Their defense is playing great. 3. Seattle (5-1) |...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58634", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NBA report states Joel Embiid was actually fouled by Nokila Jokic with .9 of a second left Joel Embiid was right. The 76ers center did not commit the game-deciding offensive foul on Denver Nuggets center Nokila Jokic with .9 of a second remaining in Saturday's 100-97 Nuggets victory at the Pepsi Center. According to the NBA Officiating Last Two Minute Report, Jokic placed his hand on the opposite side of Embiid's hip. The Nugget then affected Embiid's freedom of movement by grasping ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29608", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Stewart Friesen wins at Phoenix as Gander Trucks Championship 4 set Stewart Friesen recovered from a Lap 1 penalty to win Friday night's Lucas Oil 150 at ISM Raceway near Phoenix, earning a Championship 4 bid in the NASCAR Gander Outdoors Truck Series Round of 6 finale. Friesen joins defending Gander Trucks champion Brett Moffitt, Ross Chastain and Matt Crafton in the Championship 4 for the […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26957", "method": "POST", "url": "/v1/embeddings", "body": {"input": "European Tour, LET announce Scandinavian Mixed, joint tournament with men and women competing for same title, prize money For the first time at the elite professional level, male and female golfers will compete in the same tournament, for the same prize", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27850", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cam Neely Believes David Pastrnak Has 'Great Shot' At Scoring 50 Goals https://www.dailymotion.com/embed/video/x nm ty No member of the Bruins has scored goals in a season since Cam Neely accomplished the feat during the - season just games in. But David Pastrnak", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14836", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: Bengals cut LB Preston Brown Bengals release LB Preston Brown The Bengals released LB Preston Brown on Tuesday Brown started eight games for Cincinnati this season, making 52 tackles and forcing one tackle He signed a three-year contract worth up to $21 million to stay with the Bengals in March 1 Copyright 2019 USA TODAY A day removed from Cincinnati Bengals head coach Zac Taylor challenging his linebackers to step up and be leaders, the team has cut veteran Preston Brown....", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62304", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chiefs vs Chargers Monday Night Football Open Thread This is your place to talk about the week 11 action in the National Football League...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44770", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Quotes of the week: Mickelson channels inner-Terminator Phil Mickelson's vow that he'll be back after falling from the world's top 50 highlights this week's top quotes.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18024", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cowboys' Byron Jones nominated for 2019 Art Rooney Sportsmanship Award The nominees for this year's Art Rooney Sportsmanship Award were announced this week, with Byron Jones getting the nod from the Dallas Cowboys. Each team nominates one player from their roster that demonstrates a high degree of integrity on game days, something that can be lacking in such a violent sport. The honor, established in 2014, was named for the late great Pittsburgh Steelers owner Art Rooney. Previous nominees by Dallas have been Jason...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28384", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Arizona high school football playoff schedule, picks, Nov. 8-9 A complete list of Arizona High School football games for the weekend of Nov. 8-9.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59326", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Urban Meyer: Michigan 'fixed' early-season problems The former Buckeyes head coach insists the Wolverines early-season problems have been solved.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6482", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Antonio Brown says Brady over Ben, rips XFL in latest Tweetstorm Antonio Brown has been relatively silent over the past two weeks, which is very much outside the norm for him. Recognizing that, Brown signed into Twitter on Friday morning and held what amounted to an impromptu Q&A session.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22932", "method": "POST", "url": "/v1/embeddings", "body": {"input": "N&N: Rosenthal: Astros cheated on way to 2017 championship Morning N&N for November 13, 2019", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44623", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Stephen A. Smith will reportedly be paid more than 300 NBA players This year, Stephen A. Smith will earn the same amount as Lou Williams ($8,000,000) and more than Luka Doncic, Derrick Rose and Jayson Tatum!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15503", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL Week 7 Power Rankings: Subtle differences between playoff teams and also-rans NFL Week 7 Power Rankings: Subtle differences between playoff teams and also-rans", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7154", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Game time set for Texas at TCU The Horns will play an afternoon game in Fort Worth.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15869", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Lamar Jackson watch: Where do Ravens star's rushing stats rank among best ever for a QB? Through nine games, Ravens star Lamar Jackson is on pace to set the NFL single-season rushing mark for a quarterback. After Sunday's win over the Cincinnati Bengals, the 22-year-old has 106 carries for 702 yards on 6.6 yards per carry. Here's how Jackson's season ranks among the all-time best for a rushing QB. Ravens' Lamar Jackson, 2019 Age: 22 Carries: 106 Rushing yards: 702 Yards per carry: ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55408", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: Cam Newton out several more weeks, may go on injured reserve Panthers quarterback Cam Newton appears to be a long way from returning. Newton's latest evaluation with a foot specialist revealed that he needs rest, not surgery, Ian Rapoport of NFL Network reports. That sounds like good news, but the rest will take several weeks, and Newton may go on injured reserve. Realistically, even if the [more]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63212", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tarasenko has goal, 2 assists as Blues beat Avalanche 3-1 Vladimir Tarasenko doesn't like talking about himself. Alex Pietrangelo, however, doesn't mind talking about his teammate.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5420", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Penn State drops, stays in Top 10 of College Football Playoff rankings The Nittany Lions dropped five spots after a 31-26 loss to undefeated Minnesota on the road.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44318", "method": "POST", "url": "/v1/embeddings", "body": {"input": "LeBron James on opening night in the NBA: 'For me, it's like the first day of school' LeBron James discusses his anticipation for opening night in the NBA: \"For me, it's like the first day of school.\"", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24956", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Baltimore's Lamar Jackson producing an MVP spin Ravens quarterback Lamar Jackson turned in another stellar performance, including a spin move that rivals something you would see on a Madden game. In propelling Baltimore (7-2) to a 49-13 victory against the Bengals (0-8), Jackson completed 15 of 17   a club-record completion percentage   for 223 yards and a perfect passer rating of 158.3, his second of the season. Only one other quarterback ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53683", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Palm Beach County high school sports schedule, Nov. 11-16 To report scores and statistics from high school games, call 561-820-4440 or email pbsports@pbpost.com FOOTBALL Regional Semifinals 11/15 8A Deerfield Beach at Palm Beach Central, 7:30 p.m. 7A Venice at Palm Beach Lakes, 7 p.m. Atlantic at Hollywood-MacArthur, 7:30 p.m. 4A Tampa Catholic at American Heritage, 7:30 p.m. 3A Benjamin at Fort Myers-Bishop Verot, 7:30 p.m. 1A Hawthorne at Pahokee, ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47598", "method": "POST", "url": "/v1/embeddings", "body": {"input": "No. 6 UNC takes on Gardner-Webb Gardner-Webb (0-2) vs. No. 6 North Carolina (2-0) Dean E. Smith Center, Chapel Hill, North Carolina; Friday, 9 p.m. EST BOTTOM LINE: No. 6 North Carolina hosts Gardner-Webb in an early season matchup. Gardner-Webb came up short in a 71-59 game at Western Carolina on Saturday. North Carolina is coming off a 78-62 win over UNC Wilmington on Friday. TEAM LEADERS: North Carolina's Cole Anthony has averaged 27 points, 10.5 rebounds and four assists...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35249", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Can James Wiseman and Memphis topple the NCAA as we know it? | Giannotto Memphis, through its support of James Wiseman and Penny Hardaway, is electing to be the first university to rebel in the growing war against the NCAA.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45206", "method": "POST", "url": "/v1/embeddings", "body": {"input": "6 overreactions to the first week of the NBA season The Suns are... elite? Karl-Anthony Towns is MVP?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15695", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The 5 NFL teams that are most desperate for a win in Week 7 The Chiefs and Cowboys need some wins. But they aren't alone.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44395", "method": "POST", "url": "/v1/embeddings", "body": {"input": "UPDATED: Adam Thielen injured on touchdown catch against Detroit Lions He landed hard on the tying score", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33529", "method": "POST", "url": "/v1/embeddings", "body": {"input": "AFC North Roundup: Week 8 It's lonely at the top . . .", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22203", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jamel Dean's bounce-back performance gives the Bucs' young secondary a glimmer of hope The rookie showed that he is capable of competing in the NFL on Sunday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47813", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Live Mascots of College Football The Live Mascots of College Football", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14992", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Southern California targeting Cincinnati's Mike Bohn as next athletic director USC appears to have found its new athletic director to replace Lynn Swann. Mike Bohn of Cincinnati, who previously at Colorado, is expected to be hired.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34020", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Malcolm Butler leaves Titans-Panthers game with wrist injury A disastrous first half for the Titans got worse when cornerback Malcolm Butler left the game late in the second quarter with an injury.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38379", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Why Ja Morant and Brandon Clarke missed Memphis Grizzlies loss to Mavericks The Grizzlies' decision to sit Ja Morant and Brandon Clarke for a weekend home game did not sit well with some fans. Here's why they did it.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12134", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL Rumors: Patriots Cutting Kicker Mike Nugent After Recent Misses The New England Patriots reportedly need another new kicker. The Patriots are releasing kicker Mike Nugent sources told The MMQB's Albert Breer on Tuesday. nesn embed the score team= patriots Nugent", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24158", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tom Brady Clarifies Context Of Netflix Series Acting Cameo Outside Spa FOXBORO Mass. -- New England Patriots quarterback Tom Brady was not happy with the reaction to his cameo acting appearance that surfaced Friday night on Netflix's Living With Yourself. In the clip", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53290", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Pasco County attorney accused of trying to sell a Porsche she didn't own Pasco County Sheriff's deputies arrested a Pasco County lawyer, accusing her of selling a car and trailer that did not belong to her. Investigators say 38-year-old attorney, Stephanie Carver purchased the business, \"All Store Self-Store\" at 10125 Land O' Lakes Blvd in August of 2018. One of the customers was storing a 1987 Porsche 944 and car trailer, valued at $20-thousand dollars inside one of the units, the arrest report says. Detectives say...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64080", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Van Rooyen faces a crucial stretch at end of European season Erik Van Rooyen's travels in golf have taken him places he wasn't expecting without ever losing sight of the big picture.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N31465", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bucs record watch: Week 9 Some franchise history was made last week. Could some more be on its way this Sunday against the Seahawks?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8866", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Wednesday Morning Fly By: It's big test time Today's open discussion thread, complete with your daily dose of Flyers news and notes…", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33556", "method": "POST", "url": "/v1/embeddings", "body": {"input": "2019 CJ Cup picks: The five stats that point to a Justin Thomas win this week With a stacked field at the 2019 CJ Cup, can our expert panel (which has correctly picked four of the five winners) keep up their hot streak?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2485", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Falcons vs. Saints: Hat Tips & Head-Scratchers What a day in New Orleans.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41031", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kyle McCord and Marvin Harrison Jr. connect for 4 touchdowns to headline Ohio State football commits in the playoffs: Buckeyes recruiting COLUMBUS, Ohio -- Kyle McCord and Marvin Harrison Jr. helped St. Joseph's Prep (Pa.) High School to a 52-7 win over La Salle in the Catholic League Class 6A championship on Saturday. McCord completed 13-of-21 passes for 321 yards and five touchdowns. Six of those passes went to Harrison for 222 yards and four touchdowns. Here's a look at all six times the Ohio State commits connected: McCord ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7502", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What happened to the Patriots-Ravens rivalry? This rivalry used to be one of the nastiest   and not coincidentally, one of the best   in the NFL.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54941", "method": "POST", "url": "/v1/embeddings", "body": {"input": "20 games that will help decide CFP championship As we head into the second half of the season, it looks as if we know the 10 or so teams that have any real shot at getting one of those coveted four College Football Playoff slots...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55270", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rutgers' latest loss comes with this jarring attendance number Rutgers' latest loss came before the smallest crowd in more than a decade, according to the attendance figure announced by the school during the 42-7 Big Ten setback Saturday evening to Minnesota. Rutgers announced a crowd of 26,429 fans. That marks the lowest announced attendance figure for a Rutgers home game since the school announced 21,717 for a rain-soaked 27-14 loss to West Virginia on ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33851", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Geno Auriemma goes off on Lady Vols, Phillip Fulmer as NCAA rejects Evina Westbrook waiver | Estes The NCAA denied an appeal for Westbrook, a former Tennessee player, to be eligible immediately at UConn. What were the reasons she should have been?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8345", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jeff Wilson being evaluated for a head injury That did not look at all good", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N46497", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Patrick Mahomes injury: When will he be back? Is he at risk for further damage? Less than a week after the jarring image of a doctor popping his kneecap back into place, Chiefs quarterback Patrick Mahomes is throwing footballs on the practice field and participating in a collection of drills. After teammates slammed their helmets on the grass, glancing at what \"didn't look like a knee,\" optimism has publicly flooded the Chiefs' facility. But what lies ahead? When ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12127", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Longhorn Republic is hopeful about Iowa State Texas took a step forward defensively, but faces one of the best passers in the country Saturday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8964", "method": "POST", "url": "/v1/embeddings", "body": {"input": "USC assistant Keary Colbert's biggest play last week was getting home for birth of son Keary Colbert's long, sleepless and ultimately unforgettable Saturday began with an early flight out of Los Angeles International Airport. It ended with bowl eligibility and a new baby boy. When the Trojans receivers coach arrived at LAX Saturday morning, the rest of USC's coaching staff was already in Tempe, Ariz., preparing for a game at Arizona State. Colbert had stayed home the night ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1995", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Michigan football opens as double-digit favorite vs. MSU If the oddsmakers in Las Vegas are correct, this year's Michigan-Michigan State game may not be a close one. The 14th-ranked Wolverines opened as 12-point favorites over the Spartans for Saturday's game in Ann Arbor (noon, FOX) at Circa Sports, the sports book at Las Vegas properties The D and Golden Gate. VegasInsider.com published the line Sunday afternoon. No other sports books in Nevada ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29321", "method": "POST", "url": "/v1/embeddings", "body": {"input": "USC president Robert Caslen: 'Muschamp is my coach ... through the end of the season' University of South Carolina president Robert Caslen is sticking by embattled football coach Will Muschamp, at least through the final two games", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N19723", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'I'd boo, too': Kings' Buddy Hield feels fan frustration but has Luke Walton's back In times like these, you look for signs of life, leadership and accountability, something -- anything -- to suggest there are better days ahead for the Sacramento Kings. You could see some of that in Buddy Hield's eyes as he finished dressing and turned to face the media in a somber locker room late Wednesday night. The Kings had just been booed off their home floor after falling to ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61867", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ex-Broncos LB Wesley Woodyard excited to face his former team in Week 6 Titans linebacker Wesley Woodyard will return to Denver on Sunday for the first time since the Broncos opted not to re-sign him in 2014.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51802", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ex-NFL WR Cracks Joke About Mohamed Sanu's Patriots Jersey Number Mohamed Sanu will debut a new look Sunday afternoon. Sanu who was acquired by the Patriots via trade earlier this week is set to play in his first game with", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23538", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ravens News 10/14: Week 6 refocused, grades and more NFL Week 6 ReFocused: Baltimore Ravens 23, Cincinnati Bengals 17 - PFF While Canady struggled, Marlon Humphrey was solid all day long. The Bengals tried targeting him, and he was allowing none of it. His best play of the day came in the fourth quarter when he was targeted on a back-shoulder throw and punched the ball out at the last second This was a day for the legs of Lamar Jackson more than his arm. He routinely glided into open space, using...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22015", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eagles' loss to Vikings is indefensible, and now they enter crisis mode | Bob Ford MINNEAPOLIS   The Eagles went into full crisis mode on Sunday in U.S. Bank Field as their defense was picked completely apart by the Vikings in the first of a three-game road stretch that could decide their season. With the 38-20 loss, the Eagles dropped to 3-3 on the season and while that's not good itself, the way they lost the game was even more disturbing. The defense has been patched ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4298", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: Man arrested in theft of Brady jersey was caught wearing it A 33-year-old Providence man was arrested Thursday for allegedly stealing a jersey that New England Patriots star Tom Brady had worn.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10289", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Patriots Expected to Waive Josh Gordon Within the Next Couple Weeks The New England Patriots made a shocking roster decision this week, as they placed wide receiver Josh Gordon on injured reserve because of some lingering knee issues.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22626", "method": "POST", "url": "/v1/embeddings", "body": {"input": "ESPN: Falcons undecided on activating Chris Lindstrom from IR The team is reportedly split if they want to keep him out for the rest of the season.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43994", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jags remain at No. 20 spot of USA TODAY power rankings after Week 10's games After their bye week and a crazy Week 10 chain of events for the rest of the league, the Jacksonville Jaguars remained at the No. 20 spot of USA TODAY's power rankings. However, they have the opportunity to begin trending upwards Week 11 as Nick ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27705", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chiefs announce QB Patrick Mahomes will not play Sunday against Packers Kansas City Chiefs quarterback Patrick Mahomes will not play Sunday night against the Green Bay Packers, coach Andy Reid announced Friday. \"He just wasn't ready right now,\" Reid said. \"That was our decision, not his. He wanted to play right after it happened. He needs a little time here.\" Reid also said starting defensive tackle Chris Jones, outside linebacker Frank Clark, defensive back Kendall Fuller and offensive tackle Eric Fisher would also...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45395", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Simone Biles ties world gymnastics championships medal record, leads U.S. one-two Simone Biles tied a 1990s star for the world gymnastics championships medal record.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40835", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jags promote CB Brandon Watson from practice squad after retirement of Josh Robinson The Jacksonville Jaguars started their day down one player from their 53-man roster as veteran cornerback Josh Robinson decided to retire. Head coach Doug Marrone broke the news to the media Wednesday morning after meeting with the veteran one on ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14211", "method": "POST", "url": "/v1/embeddings", "body": {"input": "It was a different kind of MLS Cup parade This was a more muted celebration, but Brian Schmetzer made sure to provide some memorable moments.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29676", "method": "POST", "url": "/v1/embeddings", "body": {"input": "No. 1 Alabama survives Tua injury, beats Tennessee 35-13 TUSCALOOSA, Ala. (AP)   With Tua Tagovailoa hurt, No. 1 Alabama turned to the defense and Najee Harris to pull out a 35-13 victory over Tennessee on Saturday night. The Crimson Tide (7-0, 4-0 Southeastern Conference) faced its first test of the season without last season's Heisman Trophy runner-up against the five-touchdown underdogs. Both starting quarterbacks left the game before halftime, and the Volunteers (2-5, 1-3) put up a fight much of...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32388", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Is Jets' relationship with Jamal Adams irreparably broken? Here's how Joe Douglas can fix it   if he really wants to keep him long-term The Jets didn't make any deals Tuesday, in advance of the NFL's trade deadline. But they still made plenty of noise -- as usual. The latest fireworks in Florham Park -- safety Jamal Adams tweeting that he felt betrayed by general manager Joe Douglas apparently shopping him in trades, even though he told Douglas he didn't want to be traded. So is the Jets' relationship with Adams irreparably ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56576", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Yankees almost finished after terrible loss to Astros in ALCS Game 4 NEW YORK -- For more than a week, the Yankees talked about revenge for the disappointment of 2017, when they fell just a game short of the World Series to the eventual-champion Astros. They were about to get their payback. They were about to swap the bad taste in their mouths for the sweetness of victory. Now, it's looking like they won't even get that far. The Yankees came up small in yet ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2770", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Clutch in the playoffs: Drivers who won in critical situations Since NASCAR instituted the elimination-style playoff format in 2014, we've seen several drivers elevate their abilities with everything on the line.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21786", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Panthers 5, Bruins 4 (SO): Boston surrenders 4 goals in 3rd period, falls in shootout BOSTON -- Again? Really? A little more than a week after surrendering a 3-0 lead at home and forcing themselves to rally for a 6-4 win over the Penguins, the Bruins gave up four third-period goals to the Panthers on Tuesday night at TD Garden, wasting the four-goal burst of their own in the second period that had woken up a sleepy game. Ultimately, the B's dropped a 5-4 shootout decision, ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4210", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Denny Hamlin wins at ISM Raceway, advances to NASCAR championship Denny Hamlin's win Sunday at ISM Raceway pushed him into NASCAR's title-deciding race. His victory eliminated defending champion Joey Logano.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7482", "method": "POST", "url": "/v1/embeddings", "body": {"input": "St. Dominic soccer player tries to kick cancer to the curb Sometimes, what happens on the sidelines can be even more important than what happens on the field. That was the case recently for the improving St. Dominic boys soccer team. \"We're led by some great seniors and they're learning a lot,\" said head soccer coach Greg Koeller. Since 2000, the Crusaders have won five state titles. And if that wasn't enough motivation, they have players who provide inspiration. Like No. 2, Clay North. \"Clay is just an...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9363", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Watch: Buccaneers RB Dare Ogunbowale wiped out by his own teammate The Buccaneers don't really look like they know what they're doing right now on offense.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22326", "method": "POST", "url": "/v1/embeddings", "body": {"input": "How No. 2 Kentucky and No. 1 Michigan State match up   with a game prediction How the No. 2 Kentucky Wildcats (0-0) and No. 1 Michigan State Spartans (0-0) match up at each position for their meeting in the State Farm Champions Classic - with a game prediction:", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N19642", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: Chiefs may hold Mahomes out through Week 12 bye It looks like the Chiefs will play it safe when it comes to their star QB.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14488", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ravens' Jackson posts his 2nd perfect passer rating of season Lamar Jackson went 15 of 17 throwing for three touchdowns and 223 yards before stepping aside for Robert Griffin III to finish the game.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36350", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Mathis scores 30 points as No. 15 Oregon beats Boise State EUGENE, Ore. (AP)   Anthony Mathis was on target against Boise State, and so were most of his Oregon teammates. Mathis scored a career-high 30 points as the No. 15 Ducks beat Boise State 106-75 Saturday night. Mathis, in his second game with the Ducks after transferring from New Mexico for his final season, hit on 10 of 12 shots from the field overall, including 9 of 11 from 3-point range. The Ducks (2-0) shot 42 for 60 (70 from the field...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52735", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Who do you cut to make room for the roster changes? Jordan Matthews may be on the way out is my guess", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23462", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Five takeaways from the Thunder's 121-119 loss to the Bucks OKC rallied to tie the game with less than a minute left, but Milwaukee claimed a 121-119 win Sunday night at Chesapeake Energy Arena. Antetokounmpo can't be contained The Thunder played admirably against the league's reigning MVP. In the first half. But Giannis Antetokounmpo bullied the Thunder in the second half and busted out of his 24-minute slump. He had a highlight soaring slam ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62400", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tomlin on the Steelers' wide recievers: \"There's a fine line between being a Pro Bowler and a special teamer\" Head Coach Mike Tomlin is less concerened about the depth chart and more concerned about production", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48347", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Final: Seahawks win over Buccaneers in overtime Updates as the 6-2 Seattle Seahawks host the 2-5 Tampa Bay Buccaneers. To follow along with Ben Arthur, click here. OT   Seahawks win after touchdown catch in overtime. Score: 40-34, Seahawks. Russell Wilson made big throws to get the Seahawks up the field, until finally a second touchdown catch by Jacob Hollister brought home the win. Q4 0:03   Seahawks miss field goal, head into overtime. Score: 34-34. After a quick and dominant drive, the...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4226", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Best Dive Computers, Reviewed by ScubaLab ScubaLab's team of test divers put 14 dive computers to the test in the water and in a hyperbaric chamber ScubaLab tested 14 new wrist, console and head-up-display computers. Jon Whittle HOW WE TEST Our test evaluated two aspects of a computer's performance: How easy it is to operate and understand before, during and after a dive; and an objective measure of its decompression algorithm relative to other computers in the test. JUMP TO RESULTS HOW...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5036", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Federer faces early exit at ATP Finals after Thiem defeat Roger Federer faces an uphill task to qualify for the last four of the ATP Finals after a 7-5, 7-5 defeat to Dominic Thiem in his tournament opener on Sunday. The Swiss 20-time Grand Slam winner recovered quickly from being broken in the first game of the match but the Austrian fifth seed repeated the dose in the 11th game and took the opening set 7-5.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1482", "method": "POST", "url": "/v1/embeddings", "body": {"input": "If the Kings beat the Jazz 128-115 but nobody could watch it, did it even happen? The Kings win! The Kings win!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11432", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tony Romo, Jim Nantz call part of Packers-Chargers game from sidelines It doesn't take much to recognize why play-by-play broadcasters don't call games from the field level; you just can't see what you need to see from that vantage point. But for a few minutes, nobody would have been able to tell a difference.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51404", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Were Titans offsides on blocked field goal to secure win over Chiefs? If you're a Chiefs fan, you might be upset with the refs over the play, but you're probably are more upset with the unbelievable special teams meltdown.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N46179", "method": "POST", "url": "/v1/embeddings", "body": {"input": "OSU report card: No Young, lots of points (73) The Buckeyes went through some adversity off the field this week, but none on the field in Saturday's 73-14 win over Maryland", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22879", "method": "POST", "url": "/v1/embeddings", "body": {"input": "3-pointers: Takeaways from Rockets' win over Bulls CHICAGO - Takeaways from the Rockets' 117-94 win against the Chicago Bulls: Considering the week started with the Rockets mauled in Miami, and perhaps even if not considering that, collecting three wins with a pair of blowouts was a sign of progress. The competition does not measure up to what lies ahead. At a time the league is particularly deep with strong teams and contenders, no one will confuse the Memphis Grizzlies, Chicago Bulls and...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38392", "method": "POST", "url": "/v1/embeddings", "body": {"input": "In second stint with Lakers, Dwight Howard convincing people he's finally changed Howard has promised he has changed his ways many times before (with several teams), but the veteran center has made enough of an early splash in seven games as a Laker that many finally believe it's true.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29733", "method": "POST", "url": "/v1/embeddings", "body": {"input": "For Bruins, blocking shots a psychological pain game Typically, blocked shots don't cause such trauma, but they create pain and can psychologically mess with a player's head. Some of the worst pain comes from nicks that don't outwardly show much damage at all, while some serious injuries don't give the players much warning.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5404", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Anthony Davis to undergo MRI on Sunday, initial exams show no ligament damage It sounds like Anthony Davis suffered a mild thumb sprain against the Nets, but even that could be enough to keep him sidelined when the Lakers open their regular season.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59056", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Port St. Lucie's Alycia Parks reflects on post-match incident with Canadian Katherine Sebov at recent ITF tournament Erica Parks doesn't expect her daughter, 18-year-old tennis standout Alycia Parks, to receive favorable treatment on the court. But she does expect \"fair\" treatment, both from other players and tennis officials. Alycia, who lives in Port St. Lucie, made national headlines last week after a physical altercation erupted with her opponent, Canadian Katherine Sebov, following their ITF tournament ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1242", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kent State's Kalin Bennett Becomes First Autistic Player to Score in Division I Game Something groundbreaking went down in Kent, Ohio last night. Kalin Bennett powered to the rim for a jump hook, scoring his first two points of the season. Bennett became the first Division I player with autism to score in a game.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29754", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Why Ex-NBA Player Believes Brad Stevens' System Works Better In 2019-20 Than Before https://www.dailymotion.com/embed/video/x nyl g Did Brad Stevens devise a system in which the team is the star Former NBA player Channing Frye believes the Boston Celtics have started the - NBA", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58312", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kevin Cash would have pulled Zack Greinke in time There's a time and a place for a quick hook, even with the best pitchers.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10951", "method": "POST", "url": "/v1/embeddings", "body": {"input": "GAME THREAD: Dallas Mavericks at Memphis Grizzlies Ugh not another game.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21418", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Surprising Celtics face a test with Gordon Hayward sidelined Compared to one year ago, the Celtics began this season flying below the radar in the Eastern Conference. They went from being the team pegged as the consensus favorite to reach the NBA Finals to a team with question marks due to significant roster changes. Less than three weeks into the 2019-20 season, the Celtics are wearing the tag as the league's surprise team, thanks to an unexpected 7-1 ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17164", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Redskins reportedly will not pay Trent Williams remainder of 2019 salary The relationship between Trent Williams and the Washington Redskins appears to be getting worse by the day, and the team clearly is not planning to make an effort to earn back the trust of the All-Pro offensive lineman.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7615", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Fort Collins-area sports schedules for Monday, Nov. 11, and Saturday's scores Schedules of CSU, Fort Collins-area high schools and regional pro sports for Monday, Nov. 11, plus Saturday's scores", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18493", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: No tardiness or issues for Redskins since coaching change A culture change has produced results, reportedly.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49726", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Twice as nice: Massillon opens with another rout of Warren MASSILLON The concern going into Friday night's Division II Region 5 playoff opener for Massillon was two-fold. There was the concern about a potential letdown coming off of the previous week's emotional win over archrival McKinley. There was also a worry about potentially coming out lacking in focus due to the 42-point Week 3 regular-season win the Tigers had registered back over their ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34541", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Colorado commit Devin Grant invited to All-American Bowl Buffs future defender named among top HS players in the nation", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20885", "method": "POST", "url": "/v1/embeddings", "body": {"input": "As Warriors' Stephen Curry gets well, D'Angelo Russell steals the show Stephen Curry and D'Angelo Russell don't have a lot in common, but Warriors fans have a fervent interest in what they share: uncertainty about the immediate future, and the ability to completely take over a game. It apparently was news to Curry that his broken left hand will keep him out for the rest of the season; that was this week's information from Bleacher Report, and although we haven't heard from Curry, the Warriors have furiously denied...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62639", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Landon Collins named NFC Defensive Player of the Week The high profile free agent safety is making an impact", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9663", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Watch: Huskers' 340-pound NT Darrion Daniels rumbles 18 yards after awesome interception Nebraska Cornhuskers defensive tackle Darion Daniels made a tremendous play Saturday against Purdue.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36343", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Scott Fowler: Yes, the Panthers lost. But that was quarterback Kyle Allen's best performance yet GREEN BAY, Wisc. -- More from the series ------ Panthers at Packers Expanded coverage of Carolina's Week 10 loss at Green Bay Expand All ------ I know Kyle Allen played for the losing team Sunday. I know the Carolina Panthers quarterback turned the ball over twice. But I also know that Allen proved something big to everyone in the Panthers' 24-16 defeat at Green Bay. This was actually ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27162", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Here's What the March Madness Bracket Might Look Like After This Season Check out the projected bracket for this year's NCAA Tournament. The post Here's What the March Madness Bracket Might Look Like After This Season appeared first on Stadium.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33340", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rams' O-line woes worsen with injuries to Allen, Havenstein THOUSAND OAKS, Calif. (AP)   The Los Angeles Rams' offensive line is coming apart, and so is their season. The durable unit that was the bedrock of the Rams' offensive success over the past two years is an injured, inconsistent shadow of its once-dominant self. The Pittsburgh Steelers' defense proved it repeatedly Sunday night in the Rams' 17-12 loss, their fourth in six games overall. The news got even worse Monday. Center Brian Allen is out...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38165", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Patrick Mahomes and Aaron Rodgers? Young QBs looking like greats The NFL is in the middle of a youth movement at quarterback. Here are some of the young up-and-comers and the skills of greats they possess.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45759", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Barcelona Defender Gerard Pique Reveals Why He Sleeps 'Barely 4 or 5 Hours' a Night Barcelona centre back ​Gerard Pique has revealed that he sleeps just 'four or five' hours a night due to a number of non-footballing commitments on his plate. The former Spain international is a vital player for Barcelona, having taken over a key leadership role in the dressing room after the retirement of club legend Carles Puyol in 2014. The decorated defender is a living legend, having won eight La Liga titles, six Copas del Rey and three...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26896", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Flames' Brodie collapsed, started convulsing at practice A scary incident occurred at Calgary Flames practice on Thursday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42817", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Braves will give Sean Newcomb opportunity to compete for rotation spot Sean Newcomb established himself as a quality reliever in 2019 but he will go to Spring Training with an opportunity to rejoin the rotation.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50594", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Joe Espada is getting a second interview from the Cubs The Astros bench coach is a busy guy.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10579", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bartram Trail roars past Spruce Creek for 42-0 win in Region 1-8A quarterfinal ST. JOHNS -- Bartram Trail's dominance was immediate on Friday in the first round of the Class 8A playoffs, leading the Bears to a 42-0 victory over Spruce Creek. With highly touted Spruce Creek running back Marvin Scott III lined up as the lone back on the game's first offensive play, the handoff exchange between quarterback Nick Cristiano and Scott never happened. Bears senior defensive ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10072", "method": "POST", "url": "/v1/embeddings", "body": {"input": "49ers' Ronald Blair done for the year with an ACL tear The bad news just keeps coming for the 49ers. On the heels of their loss to the Seahawks comes confirmation that Ronald Blair's ACL tear will keep him out for the rest of the season.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17591", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cam Newton expected to return to practice after bye; foot has 'healed well' Returning to practice and being considered game-ready are two different things, so it's still possible that the Panthers could take things slowly with Newton.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1002", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eagles vs. Cowboys: Second quarter open thread After the first quarter, the Eagles trail the Cowboys by a score of 14 to 7.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43306", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Inactives: Darius Slay, A'Shawn Robinson will play vs. Raiders The Lions will get their star corner back this week.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N60845", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Red Sox: Boston releases knuckleballer Steven Wright Steven Wright was suspended for 95 games over the last three seasons. He appeared in just 31. More than his projected arbitration award per MLB Trade Rumors, the right-handed knuckleballer's frequent absences due to disciplinary issues and injury have ended his Red Sox career. Wright was released by Boston on Friday afternoon. He was due a likely $1.5 million for 2020 and was thought to be in ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23150", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Why Minkah Fitzpatrick was been the key to fixing the Steelers defense, Part Two Looking at the impact Minkah Fitzpatrick has made on the Steelers defense.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43461", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Running back Kenyan Drake ready to carry the load despite 'daunting task' The Cardinals traded for the fourth-year running back from Miami Monday, and now he's preparing to carry the load on Thursday against the 49ers.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8116", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Antonio Brown reflective on NFL career in new video Antonio Brown continues to spend the 2019 season in NFL purgatory after the New England Patriots cut him loose on Sept. 20.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54639", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Mets interviewing ESPN's Perez for managerial job Mets interviewing ESPN's Perez for managerial job", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21125", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hemric beats playoff drivers for NASCAR pole at Kansas KANSAS CITY, Kan. (AP) Daniel Hemric wasn't exactly fired. David Ragan isn't quite yet retired.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39297", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Northwestern survives a late flurry to upset Providence 72-63 If its first two games are any indication, Northwestern basketball is in for a wild ride. Five days after they face-planted in a season-opening loss to transitioning Division I newcomer Merrimack, the Wildcats rebounded with a 72-63 victory over Providence in a Gavitt Tipoff Games matchup. Wednesday's game at Welsh-Ryan Arena also had some wild swings. Northwestern led 55-35 with 12:37 to play ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30224", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Fleck won't compromise his unique style as he leads Minnesota to rare heights P.J. Fleck has Minnesota unbeaten and headed for a showdown with Penn State. How his quirky style has lifted the Golden Gopher, who embrace pressure.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29612", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hayward ties career high with 39 as Celtics top Cavs 119-113 CLEVELAND (AP)   Gordon Hayward tied a career high with 39 points, making all 16 of his 2-point attempts, and the Boston Celtics won their fifth straight game by holding off the Cleveland Cavaliers 119-113 on Tuesday night. Hayward put in Kemba Walker's miss with 22 seconds left to give Boston a 118-113 lead. Walker stole the inbounds pass and hit a free throw to put the game away. Hayward made 17 of 20 shots, including a 3-pointer. The 6-foot-7...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N31446", "method": "POST", "url": "/v1/embeddings", "body": {"input": "McBride back with Notre Dame in player development role NEW YORK (AP)   Kayla McBride was sitting and watching shootaround before Notre Dame's first game of the season against Fordham last week. She admitted she was nervous even though her playing days for Muffet McGraw and the Irish are over. The former Notre Dame great is back on campus this winter as a player development program manager   a new position created this season. \"I'm really excited to be working with the team,\" McBride said. \"It gives...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6879", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Race Rewind: Phoenix heats up and Denny delivers Relive Denny Hamlin's incredible day at ISM Raceway in this week's Monster Energy NASCAR Cup Series Race Rewind.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N19530", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Justin Thomas takes 2-stroke after 2 rounds at CJ Cup JEJU ISLAND, South Korea (AP)   Justin Thomas shot a 9-under 63 Friday to take a two-stroke lead at the CJ Cup, putting himself in position to win his second PGA Tour event in South Korea in three years. Thomas, who won the inaugural CJ Cup in 2017, had a two-round total of 13-under 131 at Nine Bridges. South Korean-born New Zealander Danny Lee (66) was in a tie for second place with first-round leader Byeong Hun An (69). Thomas birdied his...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22505", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cleveland Browns vs. New England Patriots: Week 8 TV Listings How can you watch the Browns vs. Patriots game on television this week?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40964", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Golden's Lindsey Horan aims to be the best soccer player in the world Having played an integral role with the U.S. women's national team in winning the World Cup this past summer in France, Golden's Lindsey Horan has processed what happened -- lots of joy, but with one huge disappointment -- recalibrated her goals and set her sights even higher.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1564", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Winderman's view: Heat 108, Cavaliers 97 Observations and other notes of interest from Thursday night's 108-97 victory over the Cleveland Cavaliers at AmericanAirlines Arena: -- Winning the ones they should be winning. -- How refreshing. -- And how simple. -- Kendrick Nunn: Real. -- Bam Adebayo: Very real. -- Jimmy Butler: Again doing what is needed. -- Meyers Leonard: Who knew? -- Goran Dragic pushed past the illness that had him ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49107", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kyle Busch makes early impression atop first Phoenix practice Kyle Busch showed signs of early speed by topping Friday's opening Monster Energy NASCAR Cup Series practice at ISM Raceway near Phoenix. Busch landed a best lap of 137.562 mph on the 1-mile Arizona track to put the Joe Gibbs Racing No. 18 Toyota on top of the board. He'll be aiming for his third […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63306", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jenkins' scorching response to Scandrick ripping Eagles Former Philadelphia Eagles cornerback Orlando Scandrick ripped into Malcolm Jenkins and his former teammates in general.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40686", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Another Penguins trade rumor update: \"Rutherford is still trying to move a defenseman\" Carrying nine defensemen, it only seems like a matter of \"when\" and not \"if\"", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30013", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hendrickson forces five turnovers, Demps rushes for 121 yards in win over McNeil ROUND ROCK -- The Hendrickson Hawks made the most out of what may be their last game in Class 6A before the next round of UIL realignment. Junior Jasiya Demps rushed for 121 yards and a touchdown on 17 carries while Hendrickson's defense forced five turnovers to help the Hawks rein in the McNeil Mavericks 35-14 at Dragon Stadium on Friday in the season finale for both teams. Hawk (4-6, 3-5 ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40079", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Blackhawks reportedly give forward Brendan Perlini permission to seek trade The relationship between the Blackhawks and Perlini has apparantly always been a tumultuous one.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7081", "method": "POST", "url": "/v1/embeddings", "body": {"input": "An early look at Cubs projected arbitration figures for 2020 MLB Trade Rumors posted their guesses last week.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54339", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Broncos RB Phillip Lindsay is moving out of his parents' home After rushing for 1,474 yards and scoring 15 touchdowns as a senior at the University of Colorado, running back Phillip Lindsay wasn't selected in last year's NFL draft. Lindsay then signed a three-year, $1.725 million contract with the Broncos and went on to earn a Pro Bowl nod as a rookie. Lindsay earned a base salary of $473,112 last season and he didn't have to spend any of it on housing because he lived with his parents in their Denver-area...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N31044", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Detroit Lions injury report: T.J. Hockenson, Darius Slay questionable Detroit Lions CB Darius Slay is expected to play against the Green Bay Packers after missing a game because of a hamstring injury.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28055", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Vote for Dallas-Fort Worth football players, team of the week from Week 7 Vote for Dallas-Fort Worth high school football offensive and defensive players of the week and team of the week from Week 7 of the season. Winners will be announced on Wednesday. Send nominations every Sunday to bgosset@star-telegram.com.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29799", "method": "POST", "url": "/v1/embeddings", "body": {"input": "College Football Playoff projection: LSU gets boost with Florida win LSU's standing as a legitimate College Football Playoff contender was bolstered Saturday night with the Tigers' big win over Florida.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48731", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eagles vs. Cowboys Final Injury Report: DeSean Jackson among six players ruled out, Ronald Darby questionable Last update.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28597", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Minkah Fitzpatrick's Impact on Steelers' Defense Proves Trade With Dolphins Was Absolutely Worth it Trading away your first round pick for the next season is exactly what not to do for a 1-2 team who just lost their franchise quarterback to injury, right? The Pittsburgh Steelers made the bold choice of doing just that and trading what looked like a surefire top pick in the 2020 NFL Draft for Minkah Fitzpatrick. And it has paid off brilliantly. Steelers defense without Minkah Fitzpatrick on the field vs. with him on the field: Completion %:...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14833", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Harbaugh keeps promise as Wolverines find their identity Jim Harbaugh kept saying Michigan football was close to a breakthrough. It felt like lip-service then. It feels like reality now.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30567", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Comment here on cleveland.com court and crime stories for Sunday, Oct. 27, 2019 CLEVELAND, Ohio - cleveland.com readers can comment below on crime & court stories appearing on the website on Sunday, Oct. 27, 2019. We believe in the importance of providing a safe place for members of our community to express their opinions. As in all communities, there are rules. We don't tolerate \"obscene, indecent, hateful, offensive, defamatory, abusive, harassing or profane material.\" ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55681", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL Power Rankings: Week 11 All the undefeated teams are gone.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37665", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Top seeds put to the test: Friday's OHSAA football playoff preview Mentor quarterback Ian Kipp, center, lunges for a first down on a keeper during the OHSAA Division I, Region 1 championship Friday, Nov. 16, 2018, against St. Edward. Both teams are the top two seeds in this year's Region 1 playoffs. (John Kuntz, cleveland.com) CLEVELAND, Ohio -- Thirty-nine area teams qualified for Week 11 of the high school football season. That includes 27 on Friday night. ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35158", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Joe Maddon has a three-year deal to manage the Angels This is really no surprise.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25240", "method": "POST", "url": "/v1/embeddings", "body": {"input": "James Harden, Rockets roll past Bulls There was a time, way back in the beginning of the week, the Rockets were not hitting as many 3s as their opponent. That was never going to last. James Harden underlined the turnaround, hitting more than twice as many 3s as the Bulls managed on Saturday on his way to 42 points. But the Rockets had to be more encouraged with the way they shut down the Bulls on the other end to finish a second-half romp with a 117-94 win and their first...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58886", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Iowa State Women's Basketball: Cyclones' late comeback falls short at Drake DES MOINES   Trailing by 17 points, on the road in a raucous environment is where the Iowa State women's basketball team found itself Sunday afternoon, but midway through the fourth quarter the Cyclones had whittled the deficit down to one. A 3-pointer by Drake guard Kierra Collier immediately followed. The Cyclones again pulled within a point with under three minutes to play, but a put-back ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25892", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Winners and losers from Game 1 of the World Series A clutch Juan Soto performance and a surprising set of starts for Max Scherzer and Gerrit Cole saw the Nationals come away with a big win in Game 1 of the 2019 World Series.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14812", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Stephen A. Smith Believes This Team, Not Patriots, Is Favorite In AFC https://www.dailymotion.com/embed/video/x nvtlb It only one was game but quite a bit of stock was put in the Week clash between the Patriots and Ravens. Baltimore handed New England its first", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26180", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Game Thread: Denver Nuggets at Sacramento Kings The first game of a back-to-back send the Nuggets to face off with the struggling Kings", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57481", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL earns lowest score for racial, gender hiring in 15 years The NFL received its lowest overall score in racial and gender hiring practices in 15 years, according a new diversity report.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27448", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL world reacts to officials handing Packers win over Lions It's a regular occurrence for NFL officiating to cause controversy, with the Packers seeming to benefit from a questionable call against Lions defensive end Trey Flowers.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34732", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Former Suns center Marcin Gortat latest to bash franchise as it looks to change culture Days the Suns were criticized for the lack of development of Marquese Chriss, Marcin Gortat called them the worst organization he's ever played for.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7885", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Man allegedly beaten by Gardens High football players has 'no clue' why he was targeted RIVIERA BEACH - The man allegedly beaten by at least four fellow high school students, including football standout Timothy Brown, then thrown from a moving SUV, says the one thing he can't figure out is why. \"I have no clue, sir. Honestly,\" the 18-year old said Tuesday. The Palm Beach Post is not naming him. Investigators have said the alleged victim originally had not cooperated, perhaps ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40519", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Creighton offers early-season test for Michigan basketball ANN ARBOR -- Michigan played its season opener against a team from the Sun Belt Conference that fired its coach after going 11-21 last year. The competition ramps up for game No. 2 on Tuesday night. The Wolverines welcome Creighton to Crisler Center (6:30 p.m. ET, FS1). The Blue Jays aren't ranked, but they're a Big East squad thought to be significantly better than Appalachian State. Michigan ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12847", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Paul Pierce says a weight has been lifted from Celtics Paul Pierce was chatting on the sideline at TD Garden this week when he was bear-hugged from behind. \"Aaaaah,\" said the Celtic legend in mock pain. \"Who is this, Danny? This feels like Danny.\" \"Because I'm so strong,\" said Ainge. There was much laughter between the two before the Celts went out and scored a […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27882", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ryan: Help thy enemy? Why it was the best strategy on Kansas restarts Here's the reason Chase Elliott was pushing Joey Logano to a Stage 1 win.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58829", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cincinnati Bengals release defensive end Anthony Zettel The Bengals cut defensive end Anthony Zettel after five days.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24222", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Zawada discusses must-win fight vs Khabib's cousin at UFC Moscow The German welterweight is still after his first UFC win and welcomes Abubakar Nurmagomedov to the octagon on Saturday night.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1884", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cleveland Cavaliers' Kevin Porter Jr. 'can be a star, will have amazing career,' Wizards' Isaiah Thomas says WASHINGTON, D.C. -- Shortly after the final buzzer Friday night, Kevin Porter Jr. and Isaiah Thomas met on the court for a jersey swap. Two Seattle hoopers reuniting. The region and a shared love of basketball first brought Porter and Thomas together years ago. That bond has continued to thicken ever since, extending far beyond the court. \"I've known him since a little bit before high school,\" ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26346", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dan Quinn cedes defensive coordinator duties to Jeff Ulbrich The linebackers coach may be preparing to be the team's interim defensive coordinator as Dan Quinn continues to shed duties.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42896", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Texans WR Will Fuller expected to miss 'several weeks' with hamstring injury This is a huge blow for the Texans, as Fuller is one of the most dangerous deep threats in the game and has tremendous chemistry with Deshaun Watson.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57052", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Patrick Mahomes expected to miss 3-6 weeks | FOX NFL Kickoff Peter Schrager on Patrick Mahomes' injury", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1953", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What bowl games are Memphis football projected to play in? Now that Memphis is bowl eligible, what bowl games are the Tigers' projected to play in? We take a look.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29041", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Shaquille O'Neal donates home to family of Atlanta boy paralyzed in shooting Shaquille O'Neal heard Isaiah Payton couldn't go home after he was paralyzed from the chest down. So Shaq donated an accessible house to his family.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6544", "method": "POST", "url": "/v1/embeddings", "body": {"input": "No. 9 Irish ride Jones' 176 yards to 30-27 victory over USC SOUTH BEND, Ind. (AP)   No. 9 Notre Dame survived upset-minded Southern California by staying grounded in chilly Notre Dame Stadium on Saturday night. Tony Jones Jr. rushed for a career-high 176 yards, Ian Book scored on an 8-yard run with 3:33 left and Jonathan Doerer kicked three long field goals as the Irish won 30-27 in the 91st meeting of the longtime rivals. \"An exciting football game,\" coach Brian Kelly said. \"Our guys prepared so well...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51041", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Browns waive Jermaine Whitehead following social media meltdown CLEVELAND, Ohio -- The Browns waived Jermaine Whitehead on Monday, according to a Browns spokesperson. The move comes less than 24 hours after the safety went on social media to tangle with critics following Sunday's loss to the Broncos. Whitehead's social media posts Sunday night caught the attention of the Browns, and a spokesperson called them \"highly unacceptable\" and \"inappropriate.\" The ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17306", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Can you tell the difference between Nats and Walgreens logo? We've received so much shade from Houston fans, non-Washingtonians, and haters about our curly \"W.\" And now that we're taking a second to think about it, the Walgreens logo and the Washington Nationals logo do (kinda) look alike. So we put some Nats fans to the test to see if they can spot the difference. Out of 15 fans we put to the logo test, to our surprise, they all recognized the \"real\" curly \"W\" without hesitation. So what's all that shade...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10299", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Minnesota Vikings News and Links: October 17th, 2019 Thorsday Open Thread", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14258", "method": "POST", "url": "/v1/embeddings", "body": {"input": "UConn women beat Vanderbilt 64-51 in Crystal Dangerfield's homecoming to Midstate Connecticut point guard Crystal Dangerfield got a win in her homecoming to the Midstate, but Vanderbilt didn't make it easy. UConn won 64-51.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53180", "method": "POST", "url": "/v1/embeddings", "body": {"input": "OPINION: Hoyas Can Make Statement Against PSU Can Hoya-fans expect a step-up in performance like last year's Gavitt Game?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27075", "method": "POST", "url": "/v1/embeddings", "body": {"input": "High School Roundup: Martin County girls soccer dominate again in win over Sebastian River Martin County girls soccer dominated Sebastian River in a 5-0 victory Wednesday night", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44372", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Astros Crawfish Boil: October 21st, 2019 Start your week with some of the best Astros links around", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9422", "method": "POST", "url": "/v1/embeddings", "body": {"input": "VIDEO: Trying to make sense of the Quandre Diggs trade We try to make sense of a hard-to-understand situation.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37214", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Knicks execs 'not happy' with poor start; David Fizdale reaches to spin results Yes, the Knicks are just two wins out of the eighth seed, but they're also looking up at every other team in the East.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62896", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Satellite High boys win 2A state cross country Satellite High won the boys team title and Scorps junior Gabe Montague the individual on Saturday at 2A cross country.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57676", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Stewart Friesen wins at Phoenix to advance to Truck championship race The Canadian driver earned his second career Truck Series win, coming back from an early penalty that sent him to the back of the field to advance to next Friday's championship race in Miami.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64041", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Watch: Beckham Jr. makes another jaw-dropping catch Odell Beckham Jr. made yet another circus catch during the Browns' game against the Seahawks.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58702", "method": "POST", "url": "/v1/embeddings", "body": {"input": "MLS Cup Talking Points: The perfect ending The Seattle Freaking Sounders did it.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48965", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Opinion: LSU backed Orgeron's confidence, prove Tigers are better than Tide LSU's win against Alabama wasn't a one-time thing. It was the start of a change in the SEC with Ed Orgeron rebuilding the Tiger program", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7973", "method": "POST", "url": "/v1/embeddings", "body": {"input": "XFL releases its debut schedule for 2020 season NEW YORK (AP) Jim Zorn will return to the sideline to coach the XFL's Seattle team against Washington's when the new league kicks off on Saturday, Feb. 8.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48976", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Five quick thoughts on the Dallas Cowboys trading for Michael Bennett The Cowboys made a move in acquiring Michael Bennett, let's discuss.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33353", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Gary McCord sounds off on CBS Sports axing: \"You shouldn't do it this way\" CBS Sports recently made the decision to part ways with two of their longest-tenured sports broadcasters   golf announcers Gary McCord and Peter Kostis. Between the pair of them, they had 60 combined years of experience working for CBS's golf coverage. Kostis served in a variety of roles as a hole announcer, analyst, and on-course Read more... The post Gary McCord sounds off on CBS Sports axing: \"You shouldn't do it this way\" appeared first on...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57767", "method": "POST", "url": "/v1/embeddings", "body": {"input": "5 takeaways from the 2019-20 NBA GM survey NBA general managers are backing the Clippers to win the 2020 NBA title.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62383", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Panthers Wire bye week awards: 2019 standouts through 6 games With that in mind, here's a few bye week awards for deserving players.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20748", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Browns release safety Jermaine Whitehead after disturbing social media rant CLEVELAND (AP)   Browns safety Jermaine Whitehead has been released following his disturbing social media rant after a loss in Denver. MEMES: Social media celebrates Texans' win, mock Baker Mayfield The Browns announced the move Monday, hours after rebuking Whitehead for \"totally unacceptable and highly inappropriate behavior\" following a 24-19 loss to the Broncos on Sunday. Whitehead made several threatening and expletive-laden posts on...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59944", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Patriots reportedly have a new kicker following release of Mike Nugent The Patriots made a number of roster moves Tuesday, and those included getting a new kicker. New England officially released kicker Mike Nugent and tight end Eric Tomlinson, and although the corresponding moves were not announced, according to multiple reports veteran kicker Nick Folk has been signed. Most recently, Folk held the AAF record for longest field goal at 55 yards. The 34-year-old has kicked for the Cowboys, Jets and Buccaneers over...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62127", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ravens say newly acquired Marcus Peters will play Sunday Baltimore is hoping that the impending free agent helps improve a pass defense that ranks in the bottom eight of the NFL this season.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52227", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Joel Embiid, Karl-Anthony Towns likely facing multi-game bans for roles in brawl Both teams don't play again until Saturday, so the league will have plenty of time to assess whether any players left the bench area, which could lead to additional suspensions.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4568", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cassius Winston plays for Michigan State less than a day after brother's death EAST LANSING -- Less than 24 hours after the death of his younger brother, Cassius Winston is in uniform and playing for Michigan State. Winston suited up and started for Michigan State for its 7 p.m. Sunday night game against Binghamton at the Breslin Center. He did so less than a day after Zachary Winston was struck and killed by a train in Albion. Police said that Zachary, a sophomore ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N3523", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Wednesday Night Hockey: Kuznetsov's season back on track after suspension Coverage of Flyers-Capitals begins at 6:30 p.m. ET on NBCSN and the NBC Sports app.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61521", "method": "POST", "url": "/v1/embeddings", "body": {"input": "2019 Atlanta Braves Season in Review: Touki Toussaint Touki Toussaint seemed to take a step in 2019, struggling with both the Atlanta Braves and Gwinnett Stripers.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5242", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Akron Zoo mourns passing of 18-year-old jaguar after battling breast cancer AKRON, Ohio (WJW)  The Akron Zoo is mourning the death of its female jaguar. The zoo said it made the decision to euthanize Naom because her health recently declined and she was dealing with complications from cancer. The jaguar was diagnosed with mammary cancer in August when her care team noticed a mass on her abdomen. According to the Akron Zoo, surgery was not in her best interest because ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25026", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Vlatko Andonovski is the most common sense hire possible for the USWNT Vlatko Andonovski will keep everything you loved about Jill Ellis, and add a dash of tactical sophistication.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17097", "method": "POST", "url": "/v1/embeddings", "body": {"input": "ACC Power Rankings: Week 8 COASTAL CHAOS", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1905", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nets withstand Ingram's big game, hold off Pelicans 135-125 NEW YORK (AP)   Kyrie Irving had 39 points and nine assists, and the Brooklyn Nets withstood Brandon Ingram's career-high 40 points to beat the New Orleans Pelicans 135-125 on Monday night. The Nets had 67 points at halftime and a 20-point lead in the third quarter, but could never get comfortable until the final minute as Ingram kept coming at them. He shot 17 for 24 from the field in his first 40-point game and the Pelicans scored a...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N60091", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Heat suspend Dion Waiters for season opener over conduct Shooting guard Dion Waiters has been suspended by the Miami Heat for their season opener against Memphis on Wednesday night for what was described as \"conduct detrimental to the team.\" \"There were a number of unacceptable incidents this week, culminating with his unprofessional conduct on the bench last night,\" Heat President Pat Riley said in a statement Saturday night. \"As a consequence, I feel we had to suspend him.\" Waiters got...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28054", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Marquee Sports Network has acquired carriage on AT&T systems It's the first step for viewers to be able to see Cubs games in 2020.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56152", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Alabama student arrested for allegedly making threat against LSU stadium A freshman at the University of Alabama decided to jump into the Tide's rivalry against LSU a little too aggressively, and he could be facing serious legal trouble as a result.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63099", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What looks like the Broncos' biggest 2020 needs after 10 weeks? Checking in after the bye. What is the biggest need for the Denver Broncos are ten weeks?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20318", "method": "POST", "url": "/v1/embeddings", "body": {"input": "A look at how the Arizona Cardinals have improved and where they still need help Taking a look at what's worked and what hasn't for the Cardinals this season.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17384", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Here's why the Cubs are likely choosing David Ross as their new manager All the signs point Ross' way.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51461", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Armada seeks to develop new stadium downtown The Jacksonville Armada is charting the next step in its long search for a permanent home. The soccer club is pursuing an agreement to purchase land from the city just north of the sports complex, to be used toward a future new stadium. The news was first reported by the Jacksonville Business Journal, based on materials from Tuesday's scheduled meeting of the Mayor's Budget Review Committee. ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N3197", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Phillip Dorsett Preaches Unselfishness After 'Surprise' Josh Gordon Decision FOXBORO Mass. -- Like many in New England Phillip Dorsett didn't see Josh Gordon's surprising move to injured reserve coming. The Patriots placed Gordon their No. receiver on IR on", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55248", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dallas-Fort Worth football teams undefeated through Week 8 of the 2019 season Here's a look at all the schools in DFW that are still undefeated through Week 8. If you don't see your school, please email us at bgosset@star-telegram.com. Allen Argyle Dallas Christian Decatur Denton Ryan DeSoto Duncanville Frisco Lone Star Gainesville Grandview Muenster Sacred Heart Nolan Catholic Pottsboro Southlake Carroll Sunnyvale", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51272", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Milwaukee vs. Oklahoma City: Bucks Survive in OKC It seemed like the Thunder made EVERY shot in the fourth.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24321", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dwayne Haskins excited about possibility he'll start on Sunday Washington quarterback Case Keenum is still in the concussion protocol, which means rookie Dwayne Haskins took the first-team reps in practice on Wednesday and may start on Sunday at Buffalo. He says he welcomes the opportunity. \"I get hyped every day I get to put a helmet on,\" Haskins said, via the Washington Post. \"Even [more]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32927", "method": "POST", "url": "/v1/embeddings", "body": {"input": "CC Sabathia leaves possible last appearance with injury CC Sabathia was taken out of the game in the eighth inning of ALCS Game 4 after suffering an apparent shoulder injury throwing to Aldemys Diaz. He relieved struggling setup man Adam Ottavino and recorded two outs before being checked on by the team's training staff. If the injury is serious and the Astros, who are up 2-1, win the series, it may be Sabathia's last pitch in pinstripes. The lefty, who won 251 games over the course of his career...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54776", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Patrick Mahomes converted key third downs in first game back Evaluating the reigning MVP's return performance against the Tennessee Titans.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29192", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cowboys Week 11 Player Power Rankings: Can Amari break Dak's hold on top spot? The Dallas Cowboys offense is a riddle, wrapped in a mystery, inside an enigma. Dak Prescott and the passing game sit near or at the top of almost every statistical measure used to judge performance beyond the typical box score. And yet, they sit at 5-4, in a league where offense is clearly king and the passing game is method of rule. On one hand, this bodes well for the club to be able to normalize themselves down the stretch and earn a closing...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25224", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Memphis' Mike Norvell focused on Houston, not coaching speculation Reports have mentioned Mike Norvell as a candidate for vacancies at Florida State and Arkansas.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37969", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Notre Dame loses defensive end Julian Okwara for the season with fractured fibula Fractured fibula against Duke knocks Notre Dame defensive end and team captain Julian Okwara out for the year", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5228", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Weddle, Miller, Pederson among sportsmanship nominees Veterans Julio Jones, Eric Weddle, Von Miller and Adrian Peterson are among the 32 nominees for the NFL's Art Rooney Sportsmanship Award.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21988", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Joe Girardi out, Scott Brosius in as U.S. manager for 2020 Olympics qualifying event Girardi accepted the job in August but has pulled out to focus on interviewing for MLB managerial openings.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49363", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: Brown's grievance against Raiders hindered by text messages Antonio Brown is hoping to recoup $30 million in guaranteed money from the Oakland Raiders via a grievance.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28168", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Matt Ryan returns to Falcons practice Ryan and the Falcons have vastly under-performed this season, going 1-6 over the first seven weeks of the season and having to face questions about potential coaching staff changes.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1367", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Trent Taylor not expected back in 2019, per Kyle Shanahan Suddenly, having seven wide receivers seems genius", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62668", "method": "POST", "url": "/v1/embeddings", "body": {"input": "On Paper: Lions at Packers preview and prediction A statistical breakdown and preview of the Monday night showdown between the Lions and Packers.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11182", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Will Smith leaves Giants for 3-year deal with Braves; is Madison Bumgarner next? SCOTTSDALE, Ariz.   Will Smith, a former Willie Mac Award winner and the Giants' only All-Star in 2019, signed a three-year, $40 million contract with the Braves on Thursday. Smith, 30, who had been tendered a qualifying offer from the Giants, has a $13 million club option for 2023 with a $1 million buyout. The Giants will receive a compensatory pick in the June draft for losing Smith because of the qualifying offer he was tendered   Madison...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26605", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Mighty Usman Unimpressed By 'Luck' Of Masvidal The feeling is mutual.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11899", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'Craziest game I've ever been a part of'': Analysis from Seahawks' thrilling OT win over 49ers The hype ahead of the Seahawks' showdown with the 49ers called for a rebirth of a rivalry. What we got was so much more that. It was a clash of great teams, trading colossal blows. It was a kicker claiming redemption. It was the league's frontrunner for MVP going at the No. 1 defense in the NFL. And it was the other defense, the one no one trusted, emerging as one worthy of a legitimate contender. The end result? A thriller. \"That was the...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N292", "method": "POST", "url": "/v1/embeddings", "body": {"input": "D'Angelo Russell: Minnesota weather played major role in turning down Wolves D'Angelo Russell seemed likely to join the Minnesota Timberwolves at one point this summer, but now he is revealing why he got cold feet … literally.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34957", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The iRacing #CasmUglySchemeContest has concluded, thank God, and here are the winners Greetings, denizens of the Internet an iRacing artists, We asked you to create ugly paint schemes, and like the Octo-Mom, you over-delivered. The #CasmUglySchemeContest, in which the winner receives an amazing VIP iRacing package courtesy of iRacing, was a roaring success. So many downright hideous paint schemes were submitted. Selecting a winner was difficult. As […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55994", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What Patriots coach Bill Belichick is saying about Eagles fans, Carson Wentz Not many things can get Bill Belichick talking, but his memories of coming to Philadelphia were the exceptions Tuesday. On a teleconference with reporters, Belichick, who was on the New York Giants coaching staff from 1979 to 1990, got nostalgic about the football he's watched and coached in the city. \"I always got a real nice and warm reception from the fans,\" Belichick said sarcastically. \"I ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59041", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Michigan basketball looked much better in win over Creighton than in opener Michigan basketball showed marked improvement in a 79-69 win against Creighton at Crisler Center in Ann Arbor.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45098", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Lion Links: 11/14/19 Quintero to Houston instead of Orlando, Camila heads to Australia, Behind the Crest with the USWNT, and more.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2684", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Texas G Andrew Jones has career-high game in return from leukemia Jones did a lot more than just show up.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58930", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Gopher Basketball Returner Roundup: Jarvis Omersa The athletic forward hopes to add some polish to his game and help on the boards in his sophomore season", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54230", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Mavericks are already good enough to make the playoffs The future is now for the Dallas Mavericks.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50521", "method": "POST", "url": "/v1/embeddings", "body": {"input": "LSU, Alabama loaded with playmaking wide receivers TUSCALOOSA, Ala. (AP) Forget the Heisman, maybe quarterbacks Joe Burrow and Tua Tagovailoa can settle the question of who has the better wide receivers.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59571", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jeff Sanders: Padres have been bad, but have they been bad enough? The Washington Nationals plucked Stephen Strasburg out of San Diego State with the No. 1 overall draft pick in 2009, had Bryce Harper fall into their lap in that same slot the following year and chose Anthony Rendon sixth overall in 2011. The next year they began a string of five playoff berths in eight years. The Houston Astros are looking for a second World Series title in three ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48666", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Yankees' Aroldis Chapman makes opt-out decision just before deadline | What happened; what it means The last memory that many Yankees fans have of Aroldis Chapman is his reaction to blowing the season on Oct. 19 at Minute Maid Park in Houston. His on-the-mound smirk was a bad look even though Chapman was just showing disbelief after Jose Altuve won the pennant for the Astros with a ninth-inning, walk-off homer in Game 6 of the American League Championship Series. Chapman provided a new ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27713", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Theo Epstein reacts to Joe Maddon's 'dream' of beating Cubs in World Series New Los Angeles Angels skipper Joe Maddon recently joked about a desire to beat the Chicago Cubs in the World Series, and his former boss, Theo Epstein, had some fun on Monday with the comment.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13098", "method": "POST", "url": "/v1/embeddings", "body": {"input": "World Series Champ Nationals Celebrate At White House President Trump applauded the Washington Nationals' first title in franchise history, calling it a \"comeback story for the ages.\"", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13631", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Reports: Results of Patrick Mahomes' MRI \"turned out to be a best-case scenario\" ESPN's Adam Schefter and NFL Network's Ian Rapoport both reported Friday afternoon that the results of Patrick Mahomes' MRI on his injured right knee were positive for a return this season. \"He'll return this season after a short time on the sidelines,\" Rapoport said. Schefter reported Mahomes' MRI was, in the words of a league source, \"good\" and it \"turned out to be a best-case scenario.\" Prior to the MRI, the Chiefs believed the best-case...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32838", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Twitter reactions to Evansville's stunning upset of No. 1 Kentucky Wildcats Walter McCarty's Purple Aces knocked off the team for which he starred in the 1990s.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32967", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chase Elliott's No. 9 tags wall early at Texas Motor Speedway Chase Elliott's playoffs hopes took another hit Sunday afternoon with a Lap 9 crunch of the Turn 2 wall at Texas Motor Speedway. RELATED: Race leaderboard Elliott's Hendrick Motorsports No. 9 Chevrolet slid out of the groove and made sizable contact with the outside retaining wall. He limped back to the pits for repairs. Elliott's […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25574", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Sunday's Dump & Chase: Eye of the Something Not sure if it's the eye of the tiger, though.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37693", "method": "POST", "url": "/v1/embeddings", "body": {"input": "After Oak Hill upset, former UNC star Jeff McInnis wants Combine Academy to stay focused Former UNC and NBA point guard Jeff McInnis said he had no trouble sleeping Friday night after leading his first-year team from Lincolnton -- a school called Combine Academy -- to an improbable 76-74 overtime win over Oak HIll Academy from Mouth of Wilson, Va. Oak Hill, ranked as high as No. 9 in the national polls, has won multiple mythical national championships. McInnis, who turned ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15004", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Texans' Tashaun Gipson expects to return vs. Ravens Texans veteran safety Tashaun Gipson expects to make his return Sunday against the Ravens after being sidelined the past two games. Gipson injured his back Oct. 20 against the Colts and missed the next two games against the Jaguars and Raiders. He practiced Monday. \"Yep, that's looking like the plan,\" Gipson said when asked about his status for Sunday's game in Baltimore. \"I can't make any promises, but that's how it goes.\" Gipson said he looks...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N758", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Atlanta Falcons: Midseason 2020 NFL Mock Draft 1.0 Sitting at 1-7, it's time for the Atlanta Falcons to focus on the 2020 Draft. Here is my midseason mock to get the Falcons back on track.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49764", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ryan Clark thinks the 49ers would be just as good with Mason Rudolph as their QB Um....", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44983", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kimble's 4 TDs pace Hutto in win over Rouse If the Hutto Hippos looked at Rouse's 1-8 record and decided the outcome of their upcoming game was a foregone conclusion, the events of the first half Friday at Hutto Memorial Stadium notified them otherwise. Hutto started strong, capping a sturdy opening drive with a 23-yard Mekhi Kimble touchdown run. The Hippos scored again on their drive with a 24-yard connection between Grayson Doggett ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47548", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Le'Veon Bell says Steelers tried to trade for him this season It seems the Steelers were so desperate for RB help that they were looking toward a familiar face.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59945", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kannapolis driver Matt Craig dominates Governor's Cup 200 at New Smyrna Speedway SAMSULA -- Meet Matt Craig because it's likely you will see that name in stock-car racing results for years to come. The 20-year-old from Kannapolis, North Carolina, needed a tune-up race before the Snowball Derby next month and owned the 54th running of the Governor's Cup 200 at New Smyrna Beach. A crowd estimated at 5,000 packed the stands Saturday night to watch Craig dominate the 14-car ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59505", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jerry Jones: Urban Meyer's comment on Cowboys job a 'compliment' Urban Meyer has been connected to USC and Florida State since his second retirement.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34934", "method": "POST", "url": "/v1/embeddings", "body": {"input": "20 years after Payne Stewart's tragic death, son Aaron carries his legacy Aaron Stewart spent his summers on the road as a PGA Tour kid. The behind-the-scenes visits at the Columbus Zoo during the Memorial Tournament stand out among his favorite memories as well as the \"music man\" under the big tree on Hilton Head Island.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1776", "method": "POST", "url": "/v1/embeddings", "body": {"input": "16 players who could take home the NBA MVP, ranked Heading into the 2019-20 season, the NBA MVP race looks crowded and could be had by several star players.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26117", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Just when you're certain you know Jameis Winston, he gives you more to consider TAMPA   Your mind is made up. That's perfectly understandable. Five years is a long time to wait for a quarterback to flourish, and it feels even longer when the bill for season tickets comes due. If you're ready to close the door on Jameis Winston's time in Tampa Bay it wouldn't be difficult to find a boatload of like-minded fans. But, tell me, does an agreeable scoreboard on a sun-kissed ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N46042", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chase Elliott wins pole for Cup playoff race at Talladega Chase Elliott led a Hendrick Motorsports sweep of the top four positions.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55135", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Raiders' offensive line depth continues to be tested In their past three games, the Raiders have started three different offensive line groupings. In those games, they have allowed zero sacks. It's one indication of how the Raiders have managed marked fluidity along their offensive front in the first half of this season, something that could prove relevant again this week depending on the status of center Rodney Hudson. Hudson, a Raiders captain and a two-time Pro Bowl selection, played just 10...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2524", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Pac-12 football power rankings: Oregon, Utah on top entering pivotal week of matchups With a sound victory over Colorado, Oregon remains atop the Pac-12 power poll after Week 7.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9925", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eagles-Bears: What we learned: Birds mediocre enough to make the playoffs The Eagles hung on to beat a offensively-deficient, defensively-sound Bears squad, 22-14, Sunday at Lincoln Financial Field. Win, lose, or draw, here's what we learned: 1. The Eagles are mediocre enough to make the playoffs. It hasn't been quite the journey most had expected after nine games, but the Eagles enter their bye week at 5-4, about one win less than many had predicted them to be with ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64889", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hines Column: Cyclones take care of business against NIU, but 3-point shooting remains a concern First off, Iowa State did what it absolutely needed to do Tuesday. The Cyclones, after an ugly first half, figured things out enough to run Northern Illinois back to DeKalb in a 70-52 victory at Hilton Coliseum. Rasir Bolton scored 17 points. Solomon Young had 15 points and seven rebounds. Michael Jacobson had nine points and 12 boards while George Conditt had nine points, four rebounds and ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59072", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Giants' Pat Shurmur, who hates having players mic'd up, defends Jets' Sam Darnold after he saw 'ghosts' in pounding vs. Patriots The Jets are angry that NFL Films (which is based in Mount Laurel, N.J.) cleared quarterback Sam Darnold's \"I'm seeing ghosts\" comment to air during ESPN's \"Monday Night Football\" broadcast. And the Jets and Darnold have a backer in Giants coach Pat Shurmur. He hates when players are mic'd up -- as Darnold was Monday against the Patriots, when he made that remark on the sideline. \"I'm not fond ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56282", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Chiefs defense must use a new strategy to stop the Packers The Nerd Squad breaks down the Packers offense   and a concept we might see Sunday night.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7400", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jaguars: Coach Doug Marrone says he's disappointed in himself because of team's 4-5 record At 4-5, the Jaguars still have a shot at making the playoffs with seven games remaining in the regular season. But Coach Doug Marrone is disappointed in himself because the Jaguars don't have more wins. '' I'm disappointed in myself that I haven't been able to do a better job for the fans and this team and having more wins because that's what our job is,'' Marrone said earlier this week. ''So, ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40692", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Orlando Scandrick rips Eagles: They have 'accountability issues' Orlando Scandrick found himself released on Monday, one day after surrendering the first touchdown of the Week 7 game against his former team, the Dallas Cowboys.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54342", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Pulev expected to enforce IBF title shot for his next fight Pulev's promoters intend to get him a shot at the IBF title in his next outing, currently on the line in Andy Ruiz vs Anthony Joshua II.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6387", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Return of Keke Coutee The little man should have a big role to play", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44582", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Khabib Denies McGregor's Visa Application: Russia Doesn't Want You While there's still no news on when Conor McGregor will fight again, you better believe there's more social media drama from the famous Irish sports star to report. McGregor continues to use Twitter as a primary method of keeping his name in the press ... although a seemingly constant stream of disturbing criminal reports tied to his name come in a close second. McGregor's latest online outburst came after UFC president Dana White told reporters...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35747", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rosaforte Report: Niemann psyched for Prez Cup, possible Tiger matchup Joaquin Niemann turned 21 on November 7 having already received the best present of his life, a pick for this year's International Presidents Cup team.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26590", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Sachse's field goal in OT leads No. 21 Broncos past Wyoming BOISE, Idaho (AP)   Chase Cord threw for 190 yards and a touchdown, Eric Sachse kicked a 28-yard field goal in overtime and No. 21 Boise State rallied to beat Wyoming 20-17 on Saturday night. Boise State (8-1, 4-0, No. 22 CFP) kept its New Year's Day bowl hopes alive as the Group of 5 representative despite playing without injured starting quarterback Hank Bachmeier. Bachmeier was expected to play, but remained on the sidelines due to an...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21040", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Crunching the Numbers: Focus in the red zone and facing teams coming off their bye week The Steelers red zone philosophy might be their biggest obstacle in the second half of the season", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54584", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Denver police teach women, girls self-defense tactics DENVER -- The Denver Police Department is educating community members about how to defend themselves with free monthly classes. Every DPD recruit goes through training in the art of self-defense, Krav Maga. On Saturday, FOX31's Nicole Fierro joined women and children as young as 12-years-old taking part in the practice. Watch what they learned in the video above.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59398", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Patriots no longer lock for AFC's top spot with loss to Ravens The Ravens showed the Patriots are beatable, and maybe they are catchable in the AFC, especially now with the schedule getting tougher for them.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49007", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Christian McCaffrey stopped inches short of goal line on final play of loss to Packers For the second time this season, a Panthers' loss has ended with McCaffrey just short of the end zone.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1445", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL bust Ryan Leaf explained why he's worried about Baker Mayfield Time to worry about Baker Mayfield?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22104", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dalvin Cook 2019 vs. Adrian Peterson 2012: It's a fair comparison There might not be anything to compare to Adrian Peterson's incredible 2012 season, when he won the NFL's MVP award after leading the Vikings to the playoffs and nearly establishing a single-season league rushing record. Here's a reminder of some of the particulars, in case time has dulled them: Peterson averaged 6.0 yards per carry that season, all while carrying the ball 348 times and facing ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28472", "method": "POST", "url": "/v1/embeddings", "body": {"input": "LeBron James, Anthony Davis, Draymond Green all out Monday The two stars for the Los Angeles Lakers will get a rest tonight, as well Golden State Warriors forward Draymond Green.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11472", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Louis Oosthuizen offered a rather honest assessment of his latest hole-in-one Louis Oosthuizen admits his latest hole-in-one at the WGC-HSBC Champions wasn't exactly a perfect strike.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13867", "method": "POST", "url": "/v1/embeddings", "body": {"input": "After wild second round finish, what awaits NASCAR drivers at Martinsville? David Scott of the Charlotte Observer looks at the NASCAR playoff field", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53868", "method": "POST", "url": "/v1/embeddings", "body": {"input": "With trade deadline approaching, has Minshew made Foles expendable? Beating the Jets isn't really a reason for huge celebration, but even so, it's worth noting just how well Jaguars quarterback Gardner Minshew played in Jacksonville's 29-15 victory. Minshew threw for 279 yards, three touchdowns and zero interceptions, keeping his head and his composure throughout. Jacksonville is now 4-4, and at the moment of the victory was just half a game behind the Texans for the sixth and final playoff spot.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30358", "method": "POST", "url": "/v1/embeddings", "body": {"input": "2019 Astros review: Alex Bregman Over the next few weeks on Texas Sports Nation, we will analyze the 2019 season of each major Astros contributor. Alex Bregman In 2018: .286/.394/.532, .926 OPS, 170 H, 83 XBH, 31 HR, 96 BB, 85 K, All-Star Game MVP, 6.9 bWAR, 7.6 fWAR In 2019: .296/.423/.592, 1.015 OPS, 164 H, 80 XBH, 41 HR, 119 BB, 83 K, 8.4 bWAR, 8.5 fWAR Analysis: If last season was Alex Bregman's breakout, this year cemented the Astros' third baseman as one of baseball's...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23228", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Fenwick volleyball edges Highland for Division II state title The Falcons rallied after dropping the first set en route to the program's second state volleyball title.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56639", "method": "POST", "url": "/v1/embeddings", "body": {"input": "LeBron James Needs Evolve, Get More Aggressive if Lakers Want to Make a Run Tuesday night the tandem of LeBron James and Anthony Davis debuted for the new-look Los Angeles Lakers against Kawhi Leonard and the new-look Los Angeles Clippers. Round 1 went to Kawhi and company as they knocked off the Lakers 112-102. In the process, James looked shaky and passive offensively. That must change if the Lakers are going to reach their lofty expectations this season. James finished the opener with 18 points, nine rebounds, eight...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48364", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Packers Wire staff predictions: Week 6 vs. Lions Predicting the outcome of the Packers' Week 6 visit from the Detroit Lions.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36409", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Michigan, Jim Harbaugh make late push for 2020 QB C.J. Stroud Michigan is going to try and land a quarterback for its 2020 recruiting class after all. Just days after commit J.D. Johnson, of Arizona, announced his plans to medically retire from football, Jim Harbaugh and his coaching staff extended a scholarship offer to C.J. Stroud. Stroud, a four-star quarterback from Rancho Cucamonga, Calif., has not yet settled on a school -- but he has plenty of ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49841", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tom Brady doesn't want you to blame Julian Edelman: 'He was trying to get yards' Brady's most-trusted receiver committed a costly fumble that led to a 70-yard return for a touchdown in Sunday night's 37-20 loss at Baltimore.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32045", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Stanley scores 19, leads No. 4 Duke past Colorado State, 89-55 No. 4 Duke rolled to a lopsided win against Colorado State", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N3547", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: Angels knew of Tyler Skaggs' drug use 'long before his death' A new report indicates the Los Angeles Angels were aware of Tyler Skaggs' opioid use but, the team's director of communications, Eric Kay, provided DEA agents with names of five other players he believed were using opioids.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61573", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Drummond: I'm 'definitely' the best rebounder in NBA history Andre Drummond, now in his eighth season, has been widely hailed as among the better rebounders in the NBA.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41710", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Osaka withdraws from WTA finals with shoulder injury Osaka withdraws from WTA finals with shoulder injury", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44216", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nahziah Carter sparks Huskies to 56-46 victory over Mount St. Mary's SEATTLE -- Nahziah Carter decided enough was enough. With 9:35 left in the game and Washington clinging to a four-point lead over Mount St. Mary's, Carter got out in transition. And then he saw the opening. Just after crossing the 3-point line, he took two steps and flew, launching himself toward the basket for a one-handed dunk that ignited Alaska Airlines Arena. The Huskies' bench ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47864", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Inspection issues bar SHR No. 4 from qualifying at Kansas; JGR No. 19 also docked NASCAR officials ejected the car chiefs for two Monster Energy Series teams and held the Stewart-Haas Racing No. 4 Ford for Kevin Harvick out of qualifying after multiple issues in Saturday's pre-qualifying inspection at Kansas Speedway. The infractions came before Busch Pole Qualifying to set the field for Sunday's Hollywood Casino 400 (2:30 p.m. ET, […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5757", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bucks to pick up team options for Donte DiVincenzo, D.J. Wilson The last two first-round draft picks selected by the Milwaukee Bucks will be under contract for another year. The Bucks will exercise their 2020-'21 team options for D.J. Wilson and Donte DiVincenzo.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36663", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jaylen Brown reportedly won't take Celtics' extension offer The Celtics made the right decision, but it looks like Jaylen Brown is going to bet on himself. Boston has offered Brown a contract extension, according to Chris Haynes of Yahoo Sports -- after there'd been speculation the C's wouldn't offer such a deal. The offer is good for four years to the tune of $80 million. If Brown were to take the offer, his average annual value ($20 million) would surpass Nets guard Caris LeVert ($17.5 million) but put...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30003", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ranking all 30 NBA head coaches Right now the NBA seems pretty stacked with good head coaches, if we're being honest. That makes ranking them quite difficult   not that we were stopped by this fact, of course. Here is our ranking of the 30 men manning the baseline in the NBA.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40778", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The GM search nears its ending Who's left to replace Neal Huntington?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52987", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Westbrook state representative passes away Maine state Rep. Ann E. Peoples has died. A Democrat, Peoples was a former Westbrook city councilor who represented the city and District 35 in the Legislature since 2006 and served on the Legislature's Labor and Housing Committee. Sign up for our Newsletters Gov. Janet Mills released the following statement Wednesday evening, mourning Peoples: \"It is with a heavy heart and with deep gratitude for her many contributions to our state that I mourn...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30970", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cincinnati Reds interested in outfielder Nicholas Castellanos, per report Nicholas Castellanos hit .276 with three home runs in 32 plate appearances against the Reds in 2019.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33118", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Penn State wary of Gophers' standout group of wide receivers When the Gophers take on Penn State on Saturday, it will be the toughest team they've faced this season. But that's also true in opposite, at least when it comes to Penn State's defensive backs against the Gophers' receivers. With how good the Nittany Lions are at stopping the run, second in the FBS in fact, the wideouts might have to pick up the slack. And stars like Tyler Johnson and Rashod ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59949", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Freddie Kitchens says Antonio Callaway's benching is a one-game thing; prepping for the Steelers' tough D: Quick hits CLEVELAND, Ohio -- CLEVELAND, Ohio -- Freddie Kitchens doesn't have much time to bask in the glory of Sunday's 19-16 victory over the Bills. The 5-4 Steelers are coming to town on Thursday night, and they've won four straight games. But the Browns breathed new life into their season by snapping their four-game losing streak, and they now have the easiest remaining schedule in the NFL, ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56476", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Five things we learned from the start of the college basketball season What we learned from college basketball's season start with major clashes involving Duke, Kentucky, Michigan State and Kansas plus early ACC matchups.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49336", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Habib: Forget tanking, forget Tua, and just enjoy Miami Dolphins' overachievers beating Adam Gase's underachievers MIAMI GARDENS -- Amid the hysteria, while flipping the game ball in his hands, Dolphins coach Brian Flores asked his players the only question that mattered. \"How's it feel?\" he said, which was the invitation these Dolphins needed to whoop it up some more, months of pent-up frustration making way for giddiness. They yelled. They danced. Cups of water went airborne. That's what it was like in ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14282", "method": "POST", "url": "/v1/embeddings", "body": {"input": "We're searching for the best golf-fitness trainers in America You, or someone you work with, could be on Golf Digest's list of the 50 Best Golf-Fitness Trainers in America. Here's how", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N3566", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL teams reportedly believe Browns could trade Odell Beckham if struggles continue The Browns are teetering on the verge of complete disaster, and that could lead to some major changes this offseason.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64133", "method": "POST", "url": "/v1/embeddings", "body": {"input": "After Zozo win, Tiger seems certain on picking self for Presidents Cup With Presidents Cup captain's picks looming, Tiger Woods made a statement right when he needed to, and now he seems to feel certain about picking himself for the U.S. team.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18207", "method": "POST", "url": "/v1/embeddings", "body": {"input": "How to watch, listen and stream Detroit Red Wings at Los Angeles Kings The Red Wings are on a three-game winning streak after beating Anaheim 4-3 in overtime on Tuesday night. Now, Detroit continues it's West Coast swing with a game against the Los Angeles Kings at the Staples Center. Los Angeles is coming off a win of its own and looks to carry that momentum forward. The Red Wings (7-12-1) and Kings (6-11-1) face-off at 10:30 p.m. on Thursday, Nov. 13. Related: ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61420", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dolphins vs. Steelers highlights | Week 8 Watch the game Miami Dolphins vs. Pittsburgh Steelers highlights from Week 8 in 2019.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40099", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tom Brady Has High Hopes For Mohamed Sanu Connection In Patriots' Stretch Run Mohamed Sanu enjoyed one of the most productive games of his eight-year NFL career Sunday night. Tom Brady believes even brighter days are ahead for the New England Patriots' newest", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33222", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Farmer: Jalen Ramsey's Rams debut shows what's around corner for their defense Everyone knew Rams cornerback Jalen Ramsey was fluid, but who knew he'd be so fluent? After two practices with his new team, he slipped right into the lineup on the third play Sunday, and   going against All-Pro receiver Julio Jones for the first time   needed no interpreter for the coded language that job entails. \"Honestly, I was impressed he understood what I was saying pre-snap,\" said ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63857", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Face Off! 'Devastator' Stares Down 'All American' In Boston Dominick Reyes vs. Chris Weidman staredown video from UFC on ESPN 6 weigh ins ahead of their ESPN2 headliner on Fri., Oct. 18, 2019 inside TD Garden in Boston, Massachusetts.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53442", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Patriots' Danny Shelton Posts Message About Adversity On Instagram Amid Breakout Season Let's be real: It was no sure thing Danny Shelton would be back with the New England Patriots this season. Acquired in a trade with the Cleveland Browns prior to", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47104", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Adam Schefter Thinks Tom Brady Playing With Patriots In 2020 Is 'Least Likely Option' Does Adam Schefter know something the rest of us don't about Tom Brady The obvious answer to that of course is yes. The ESPN reporter is one of the most", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32583", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Since losing '18 final, Golden Knights look more like Caps Almost 18 months since the Vegas Golden Knights' improbable inaugural season ended, they look much more like the team that vanquished them in the Stanley Cup Final.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39313", "method": "POST", "url": "/v1/embeddings", "body": {"input": "9 notes and observations from the Celtics' win over the Mavericks Celtics shooting guard Marcus Smart had a feeling this team might surprise people. \"We just stayed back, kept quiet, and kept working,\" Smart said after the group's latest victory, their eighth straight. \"We couldn't wait for this season to tip off so we could show everybody.\" Boston edged the Dallas Mavericks Monday night to improve […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27369", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Green Bay Packers head coach Matt LaFleur credits resilient receivers, Rodgers in comeback win Green Bay Packers head coach Matt LaFleur credits resilient receivers, Rodgers in comeback win.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52074", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bears stand pat at trade deadline, don't add quarterback The Bears have decided to lay low for the trade deadline this year.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59557", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Zimmerman saves no-hitter, then Martinez ends it Ryan Zimmerman laid out to save Anibal Sanchez's no-hit bid with a spectacular catch, but Jose Martinez came and ruined the fun just one plate appearance later.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N31583", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Elite goalie? Not so much. Fleck joins Gophers hockey practice during football bye week Bob Motzko gave his team the news near the end of Tuesday's practice. \"I told them, 'Guys, we've a new goalie trying out,\" ' Motzko said of his Gophers men's hockey team. \"And they went silent.\" Jack LaFontaine, a junior who has alternated starts with freshman Jared Moe, was puzzled. \"In the back of my head, I said, 'OK, it looks like we're having a fourth goalie, another guy coming on,' \" ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14814", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bucks 129, Cavaliers 112: Balanced effort helps Milwaukee overcome sluggish start The Bucks sputtered a bit off the jump, trailing by a point at the end of the first quarter, but their defense dug in from there during their 129-112 win over the Cavaliers.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38085", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cowboys vs. Eagles: Predicting who will take over the NFC East lead on Sunday The Cowboys vs. The Eagles on Sunday Night Football could determine the outcome of the division.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11051", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'That's a little crazy:' York County soccer team ranked among best teams in the country The Wildcats were the top-ranked team from Pennsylvania in USA Today's latest national rankings.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58348", "method": "POST", "url": "/v1/embeddings", "body": {"input": "I'm really, really shocked! Matthews soldier surprised by brand new car When Staff Sergeant Paul Larson of the US Army heard the doorbell ring early Monday morning he wondered why a door-to-door salesman would be out so early. Reluctantly he opened the door and quickly learned he won a brand new car as part of NBC Charlotte's Hometown Hero. \"Hi I'm NBC Charlotte's Sarah French,\" she said as she shook Paul Larson's hand. \"We've been taking nominations for Hometown Hero and you are our winner!\" Paul Larson has been in...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7736", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Game Notes: Bears fall to 3-3 with underwhelming loss to Saints The Bears failed once again to top 300 total offensive yards, and their defense had an uncharacteristically poor game.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11403", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Blast Motion's latest swing analyzer will improve timing and tempo The latest swing sensor system from Blast Motion records various metrics to help you improve your mechanics", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49743", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eagles 22, Bears 14: Jordan Howard leads Birds to an ugly Week 8 win over Chicago How do you gain the first dozen first downs of the game and still lose? Eagles fans are thankful they didn't quite have to find out, after their team dominated the Chicago Bears for nearly three quarters but ended up having to claw out a series of first downs and a field goal in the final minutes to hold on to a 22-14 victory. They clinched the win on a pooch kickoff lofted with 25 seconds ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N60414", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eintracht Frankfurt Captain Floors Freiburg Coach as Bundesliga Clash Descends Into Madness The Bundesliga has never shied away from a little bit of carnage, but Sunday's clash between SC Freiburg and Eintracht Frankfurt - yielding three red cards and some of the wildest post-match scenes you're ever likely to lay eyes on - has really taken the biscuit. With the two sides starting the day in seventh and ninth, you could have been forgiven for overlooking it in favour of the top-of-the-table action taking place in England at the same...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7598", "method": "POST", "url": "/v1/embeddings", "body": {"input": "College Football Playoff: Why Boise State won't be this year's UCF Even if Boise State finishes as an undefeated Group of Five team, it's probably not going to get mad about a playoff snub.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55252", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Fangio: Bryce Callahan returning to practice on Tuesday Great news for Callahan and for Denver's secondary.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4612", "method": "POST", "url": "/v1/embeddings", "body": {"input": "MLB needs to step up on cheating allegations against Astros: 'It's a serious matter' Veteran righty Mike Fiers said that the Astros were stealing signs using electronic means during the 2017 season, another blemish for the organization.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56223", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jerry Jones on Dak Prescott talks: 'We moved that needle in a positive direction this week' The bye week provided the best in-season opportunity to extend the contract of Cowboys quarterback Dak Prescott. It didn't happen. But that doesn't mean nothing happened. In his weekly Friday appearance on 105.3 The Fan in Dallas, Cowboys owner Jerry Jones suggested that progress was made since the team last played, 12 days ago.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9610", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What we learned about the Cavaliers this week: Nov. 4 - 10 John Beilein is steering the Cavs in the right direction as they finish the week with two solid road wins.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N3845", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Pirates to exercise SP Chris Archer's 2020 option Pittsburgh could have paid Archer a $1.75M buyout but will now have him locked in for the upcoming season.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51468", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dziagwa's 7 3s lead Cowboys to 73-54 win over Charleston CHARLESTON, S.C. (AP)   Thomas Dziagwa wasn't sure why it took Oklahoma State so long to get going. Once the Cowboys did, Dziagwa and the team put on a stellar performance they hope will pay dividends the rest of the season. Dziagwa had 21 points off a career-best tying seven 3-pointers as Oklahoma State defeated College of Charleston 73-54 on Wednesday night. The Cowboys trailed by nine points midway through the opening half, until Dziagwa...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54041", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Falcons-Seahawks: One reason to worry, one reason to feel confident If confidence is in short supply, we understand why.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38618", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cowboys vs. Eagles injury report: Amari Cooper, Tyron Smith lead a long list of Cowboys injuries The Cowboys 'did not practice' list is long on Wednesday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45537", "method": "POST", "url": "/v1/embeddings", "body": {"input": "No. 22 Baylor beats Texas Tech in double OT Texas Tech and Baylor exchanged blows during a well-fought regulation and the Bears pulled away in double overtime on a walk-off touchdown by JaMycal Hasty. Watch the highlights from the thrilling game here.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7060", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Smith: Time for Justin Verlander to earn his first World Series win It is simple, really. The Astros close it out inside a roaring Minute Maid Park and prevent Game 7 from even happening. Justin Verlander, 2019 American League Cy Young favorite and future Hall of Famer, records the first World Series victory of his 15-year career ... and the Astros win the World Series. \"He's prepared. He's ready for this moment,\" said Gerrit Cole, after pitching the Astros to a 3-2 series lead in Game 5. \"We've been...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38777", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Three takeaways from 49ers' road win over Cardinals San Francisco remains the only perfect team in the NFC and is just one of two teams in the NFL (New England) yet to lose a game.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51644", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Super Bowl committee picks Melreese for golf tourney as MLS stadium plan moves slowly The host committee for Super Bowl 54 has selected the site for a charity golf tournament and dinner that could host luminaries and NFL alums: Melreese golf course, the city of Miami's only golf course and proposed location for a massive commercial center and soccer stadium. Melreese golf course will host a tournament Jan. 16 to benefit The First Tee Miami, a youth golf program, and ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53132", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Big-time players have Ohio State looking like No. 1 team Ohio State has more big-time players than most programs. And when J.K. Dobbins and Chase Young dominate like they did vs. Wisconsin, the Buckeyes win.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34006", "method": "POST", "url": "/v1/embeddings", "body": {"input": "MLB Bullets sends everyone home Jose Altuve saw to it that the Astros will meet the Nationals in the World Series. The Yankees miss the World Series for the 10th-straight season.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29747", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: Packers optimistic Davante Adams will play Sunday against Chargers Adams could provide a huge boost to a Packers team that is already rolling.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45129", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The big takeaway: Broncos' D has turned a corner It took four weeks, but the last two have shown that the Broncos' defense is figuring things out.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24387", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Andrew Whitworth makes history at Bengals' expense It never would have happened if the Bengals held on to Whitworth.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33669", "method": "POST", "url": "/v1/embeddings", "body": {"input": "USWNT star Carli Lloyd: World Cup was 'worst time of my life' Even though she set records and won her second consecutive Women's World Cup, USWNT star Carli Lloyd said she was frustrated by a diminished role.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22672", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Suns are exceeding expectations as a team, but how many players actually are? Not many of the Phoenix Suns are actually blowing away expectations this season despite the hot start.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50804", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Victory Monday: Yet so many fans feel conflicted Can the Dolphins keep winning?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32510", "method": "POST", "url": "/v1/embeddings", "body": {"input": "4-star SDE Princely Umanmielen decommits from Texas The local product pledged to the Longhorns in August.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13230", "method": "POST", "url": "/v1/embeddings", "body": {"input": "City tears down woman's home after a tree fell on top of it It started with a tree falling on her roof and ended with the city demolishing her home the next day. Carrie Corbett of Tampa says the city gave her less than 24 hours before demolishing her home of 30 years. She says she was not given proper notice that her home would be gone. According to officials with code enforcement, the condition of the home required an emergency demolition due to a caving roof and bulging walls. The city said Corbett...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15477", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Did Tiger Woods just drop a major hint he plans to play on the senior tour? Tiger Woods gave some interesting and entertaining answers to an Australian radio program on Tuesday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12970", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Charlotte Christian coach Jason Estep just proved he's one of the best in N.C. history Charlotte Christian coach Jason Estep just turned in one of the best coaching jobs I've seen in some time. In August, the Knights whipped Sun Valley 35-13 in their season-opening game but suffered injuries to key players. The next week, Charlotte Christian hosted Colorado 5A state champion Valor Christian, coached by Christian McCaffrey's father, Ed. Sure enough, Valor Christian beat ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24511", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Rock: 'I can take UFC champion Stipe Miocic…to lunch' Former World Wrestling Entertainment Inc. champion turned Hollywood movie star Dwayne \"The Rock\" Johnson is confident he could take UFC heavyweight titleholder Stipe Miocic, but not in the way one might think. In an appearance on Ariel Helwani's MMA Show earlier this week, Johnson let his opinion be known on a potential super-fight with Miocic, a record-setting two-time UFC heavyweight champion. \"I know that everybody wants to know if I have...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36180", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Suns sign and waive Troy Williams to obtain player rights for Northern Arizona Phoenix makes a forward-thinking move to possibly add another wing to their organization.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9768", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Players: Bengals still fighting to achieve first victory of season The Bengals say they are going to fight each and every week until they get a win.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N46136", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Northern Kentucky, Cincinnati high schools battle in preseason basketball showcases Schedules are set for biggest preseason high school basketball showcases in Northern Kentucky, Ryle Battle of the Borders and Kesley Sorrell Memorial.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33721", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bucs promote CB Mazzi Wilkins to active roster Next man up, as the kids like to say.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1405", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Veterans Jordan Nwora, Dwayne Sutton lead Louisville basketball past Indiana State Louisville basketball picked up its third win in a row Wednesday night as the Cardinals cruised past Indiana State at the Yum Center.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8531", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Miami Hurricanes LB Michael Pinckney named ACC Linebacker of the Week A great performance on senior day earns a worthy honor for 56Nightmares.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47278", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Talking Points: Seattle Freakin' Sounders are back in MLS Cup Three goals on the road against the greatest regular-season team in history ... well done.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40495", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Maggert holes out to win Champions finale; McCarron takes Schwab Cup Jeff Maggert holed out from 123 yards for eagle on the third playoff hole Sunday to win the Charles Schwab Cup Championship and hand Scott McCarron the season points title on the PGA Tour Champions.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N60135", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rockets focused on basketball after fallout from GM's tweet The Rockets are back home in Houston, looking to leave behind the distractions from their trip to Asia.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9548", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kristaps Porzingis regrets how he ended with the Knicks Since the Kristaps Porzingis trade, the Knicks will make his first trip back to Madison Square Garden this week. Porzingis told reporters he grateful for those years that I spent in New York.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59919", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Darnold: Another year with Gase will be 'absolutely amazing' FLORHAM PARK, N.J. (AP)   The New York Jets' owner has Adam Gase's back. The franchise quarterback does, too. A day after team CEO and chairman Christopher Johnson announced the coach will remain in place for next season, Sam Darnold gave the news an enthusiastic thumbs-up. \"If everything works out like it's supposed to and Adam is here again, that would be absolutely amazing,\" Darnold said Thursday. \"Going into OTAs and knowing the whole...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62297", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The concern is real: David Johnson's performance and contract are weighing down the Cardinals David Johnson's performance in Tampa should have caused sirens to start going off in the biggest offices at Arizona Cardinals headquarters.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35257", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tennessee man gets life in prison for killing wife at office BLOUNTVILLE, Tenn. (AP)   A Tennessee man has pleaded guilty to shooting his wife to death at the dentist's office where she worked, months after she filed a restraining order against him. News outlets report 64-year-old Harry Clint Weaver was convicted of first-degree murder and sentenced to life in prison Tuesday. Under a plea deal he also pleaded guilty to three counts of aggravated assault, reckless endangerment and aggravated domestic...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12423", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Yoel Romero tells Israel Adesanya 'don't back out now': Call Dana White and tell him you want the fight Yoel Romero calls out UFC middleweight champ Israel Adesanya.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15071", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Memphis basketball doesn't have a 2020 commitment. It's not a problem right now. Coach Penny Hardaway appears content to wait until the spring signing period in April rolls around.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50010", "method": "POST", "url": "/v1/embeddings", "body": {"input": "One win from title, Astros enlist Olajuwon, Drexler for first pitch In 1995, Hakeem Olajuwon and Clyde Drexler were the cornerstones of the Houston Rockets' second NBA championship team.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33036", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What Louisville coaches, players are saying about Clemson What Louisville's coaches and players are saying about Clemson ahead of Saturday's game at Cardinals Stadium.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26578", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chennedy Carter keeps filling the net for No 6 Texas A&M in win over Duke COLLEGE STATION   After swiping a steal Sunday against Duke, Texas A&M guard Chennedy Carter tossed a casual smile at a helpless Blue Devils defender before tossing up a smooth layup. The game comes that easy and fun to the Aggies' star. \"She plays with a lot of confidence, and she brings her team a lot of confidence,\" Duke coach Joanne P. McCallie said of Carter, the SEC preseason player of the year. \"She pretty much has the green light...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58529", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Louisville flips local standout Jordan Watkins Boom.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N846", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL Week 7 Awards: Is this the best photo ever taken of a NFL player? The good, the bad, and the hilarious from Sunday's NFL action.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55304", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eagles officially announce Jordan Matthews signing Third time's a charm?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58896", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Freshman Holmes leads No. 24 Indiana women in rout 111-47 BLOOMINGTON, Ind. (AP)   Freshman Mackenzie Homes made all nine of her shots and scored 22 points and No. 24 Indiana coasted to a 111-47 win over Nicholls State on Sunday. Holmes had half her points in the first quarter when the Hoosiers scored the first 15 points of the game and raced to a 35-12 lead. Indian made 14 of 21 shots (67 to score the second-most points in a quarter in school history while the Colonels were just 4 of 15 (21%). Ali...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50190", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Suspended Arizona Wildcats guard Devonaire Doutrive could play against San Jose State Arizona guard Devonaire Doutrive has missed an exhibition game and two regular-season contests.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44854", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Game recap: Detroit Red Wings fall at Los Angeles Kings, 3-2 10:30 p.m.; ESPN+; 97.1 FM: The Detroit Red Wings head to Los Angeles to face the Kings at the STAPLES Center on Thursday, Nov. 14, 2019.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39488", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Should the Yankees extend Aroldis Chapman? The last memory of Aroldis Chapman's time with the Yankees could be an unfortunate one   the veteran closer smirking in shock as Jose Altuve and the Astros eliminated the Yankees for the third time in five years. However, Chapman appears wants to get the last laugh in pinstripes   he's interested in pursuing a contract extension with the Yankees, according to reports from Jon Heyman. However, if he doesn't agree to terms with the Yankees,...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29869", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Serena Williams through the years A look back at Serena Williams' career.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57143", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Weekly Lineman: The transition to a gap-style blocking scheme Joe Mixon and the Bengals have been running the ball more effectively of late. The implementation of newer blocking schemes can be credited for this.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37068", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Huskies WR Terrell Bynum finding consistency, confidence in season's final stretch SEATTLE -- Terrell Bynum was healthy during Washington's spring practices, which isn't something he takes for granted. Last year, the redshirt sophomore wide receiver out of St. John Bosco (California) was still recovering from a thumb surgery when the Huskies started workouts in the spring. While he rebuilt his hand strength, he focused mostly on running routes instead of catching ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N3578", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Driver arrested after Jeep crashes into water at Sarasota Bayfront A driver who drove their Jeep into the water near Sarasota's Bayfront has been arrested. It happened Tuesday evening on 10th Street, according to the Sarasota Police Department. The agency tweeted the driver got out of their vehicle and the Jeep has been removed from the water. Police say this is now a DUI investigation. An investigation is ongoing, and more information is expected later. What other people are reading right now: See the text of...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14026", "method": "POST", "url": "/v1/embeddings", "body": {"input": "USF QB Barnett (ankle) to undergo season-ending surgery Blake Barnett has been an important piece for the USF offense over the last season and a half.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44159", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Day in Sports: Monday, October 28, 2019 The Day in Sports: Monday, October 28, 2019", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37354", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nothing easy about Fangio's defense - but very rewarding when players 'get it' Talking with Broncos Country Tonight on KOA Radio, Will Parks keeps it real about the complexity of Fangio's defense but has only love for the head coach and his approach.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13445", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Animal welfare activists suspected of vandalizing western Wisconsin deer stands Animal welfare activists are suspected in western Wisconsin of vandalizing several deer stands in at least two counties. Barron County Sheriff Chris Fitzgerald said over the weekend that the destruction of a stand in the Prairie Farm area could be tied to similar incidents to the south in neighboring Dunn County, where the structures along with trail cameras were vandalized. \"There may be a ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29134", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Playoff drivers preview Kansas: 'It's the biggest wild card of all' Drivers in the Monster Energy NASCAR Cup Series Playoffs explain why Kansas Speedway may be the biggest playoff wild card.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N65148", "method": "POST", "url": "/v1/embeddings", "body": {"input": "3 Falcons players that didn't deserve to lose in Week 6 The Falcons fought hard in their Week 6 loss to the Cardinals, but they couldn't pull out the victory. An extra point that would have tied the game late in the fourth quarter went just wide and now this team is 1-5 on the year.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63249", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL Pro Bowl 2020: Vote for your favorite Ravens! It's time to put some respect on their names", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29504", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dolphins take page out of Browns' tanking playbook with Aqib Talib trade If the Dolphins are trying to be terrible, why did they trade for an outstanding cornerback?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34058", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What channel is NASCAR on today? Time, TV schedule for Talladega race Monday's postponed NASCAR race returns to NBCSN as the TV channel, and the Talladega race will resume at 2 p.m. ET. Here is how to watch today's NASCAR race at Talladega.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22474", "method": "POST", "url": "/v1/embeddings", "body": {"input": "A hungry beetle decimates Minnesota's tamaracks An unprecedented outbreak of destructive beetles has killed nearly half the tamarack trees in Minnesota, and foresters say thousands of acres that have succumbed may never recover, endangering the broader ecosystem in northern parts of the state. As a result, the Minnesota Department of Natural Resources (DNR) is trying to accelerate tamarack timber auctions in hopes that some of the remaining ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13476", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cal's win over Washington State prompts new hope for postseason berth Ashtyn Davis and Evan Weaver last week accepted invitations to play in the Senior Bowl, but after Saturday night's 33-20 victory over Washington State, Cal's defensive standouts can't start thinking about the all-star game just yet. By snapping their four-game skid, the Bears (5-4, 2-4 Pac-12) are one win from bowl eligibility with three regular-season games to play. Cal closes the season with a home game against USC on Saturday night and games...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N19878", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dion Waiters posts he has 'seen the writing on the wall'; James Johnson inactive The Miami Heat will start the season with $27 million in salary out of view. The Heat announced hours before Wednesday night's season opener that forward James Johnson will remain inactive, in the wake of failing to meet the team's conditioning goals. That comes in the wake of guard Dion Waiters being suspended for the opener against the Memphis Grizzlies at AmericanAirlines Arena due to what ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32215", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Pro Bowl CB Darius Slay retweets post suggesting Lions pay him or move him Slay was pretty outspoken in his disapproval after the Lions abruptly traded defensive back Quandre Diggs last week.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54331", "method": "POST", "url": "/v1/embeddings", "body": {"input": "A 25-point underdog, Evansville basketball stuns No. 1 Kentucky and the nation Evansville, coached by former UK player Walter McCarty, was playing a top-ranked for just the third time in program history.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58910", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chiefs players write Twitter messages to fans after loss to Titans Heading back to work on a Monday is never fun. But this one comes with snow, freezing temperatures and a day after a gut-wrenching Chiefs loss. So yeah, Chiefs fans can't be blamed for having a case of the Mondays. The Chiefs blew a fourth-quarter lead in a 35-32 loss to the Tennessee Titans on Sunday, and the players realize fans might not be feeling great about the game. A number of ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5614", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Gopher Volleyball Round: National Signing Day and Conference Race Minnesota nabbed two of the top three recruits in the class of 2020, including PrepVolleyball.com's number one recruit Taylor Landfair, another top 20 recruit and the last member of the four-person class fell just outside the top 100. Tonight's match with Wisconsin has major conference title implications.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36487", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bears vs. Lions: Everything you need to know about the Week 10 game before kickoff at noon Quarterback Mitch Trubisky and the Bears offense will try to find a spark when they host a Lions defense that ranks among the worst in the NFL on Sunday at Soldier Field. The Lions have allowed 424.1 yards and 27.1 points per game. That's good news for a Bears group that has struggled mightily during a four-game losing streak, including totaling just 9 yards in the first half of last week's ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22057", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Another game-winning field goal pushes Texas past No. 20 Kansas State, 27-24 After falling behind 14-0, the Horns scored 27 of the game's final 37 points.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44098", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The five biggest offseason questions for the Twins Every offseason is important in the arc of a franchise, but the one coming up for the Twins feels particularly so. After an extremely fun 101-win season in which many things fell into place but still ended with postseason disappointment, here are the five biggest questions facing the Twins heading into 2020: 1) Is there a path to a No. 1 starter? Phil Miller and I batted around this question a ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N46720", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hasahn French is a force to be reckoned with for SLU basketball Hasahn French just has the look of a guy who's going to embarrass you on the basketball court. He's big, strong and plays with an edge. In his junior season, French is proving he's ready to embarrass any and all opponents. SLU's big man has been making quick work of his team's non conference opponents so far in 2019. He's averaging 15.3 points and 6.7 rebounds a game. The Billikens' towering terror in the paint is the key to their entire season....", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1241", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Why Mike Florio Thinks A.J. Green Trade Would Be 'Ultimate Bill Belichick Move' Bill Belichick already swung for the fences this season by trying to provide Tom Brady with another top-tier target. The Antonio Brown experiment failed but does the Patriots coach have", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20978", "method": "POST", "url": "/v1/embeddings", "body": {"input": "WATCH: Amari Cooper toe-drags a touchdown, Cowboys up 21-20 Cowboys take the lead with a toe-drag TD by Amari Cooper.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27991", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Mind Games: UNF guard JT Escobar scores big victory by dealing with his mental health issues By Gene Frenette gfrenette@jacksonville.com JT Escobar knew about his insecurities and low self-esteem for a long time, likely as far back as first grade when he'd look at other kids on the playground and think to himself: \"Man, why can't I be like them? Why did I have to be me?\" And for the next 17 years, until this summer, just before Escobar began his senior basketball season at the ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29131", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Video: Gabriel Gonzaga knocks out 'Bigfoot' Silva at BKFC 8 Gabriel Gonzaga needed less than four minutes to hand fellow UFC vet Antonio Silva another KO loss at BKFC 8.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
