{"custom_id": "N41559", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Regional predictions: New Palestine-Cathedral, Warren Central-Center Grove headline matchups High school football on to regional showdowns this week", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13987", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Were Bengals right to cut Preston Brown now? The Cincinnati native will now be looking for a new team after less than two seasons with his childhood team.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35221", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bill Belichick Gives Initial Thoughts On Mohamed Sanu, Cracks Rutgers Joke FOXBORO Mass. -- Mohamed Sanu was bound to wind up with the New England Patriots at some point. He is a Rutgers alum after all. Not only did Sanu go to", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10579", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bartram Trail roars past Spruce Creek for 42-0 win in Region 1-8A quarterfinal ST. JOHNS -- Bartram Trail's dominance was immediate on Friday in the first round of the Class 8A playoffs, leading the Bears to a 42-0 victory over Spruce Creek. With highly touted Spruce Creek running back Marvin Scott III lined up as the lone back on the game's first offensive play, the handoff exchange between quarterback Nick Cristiano and Scott never happened. Bears senior defensive ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44859", "method": "POST", "url": "/v1/embeddings", "body": {"input": "An A to Z guide to attending Michigan vs. Michigan State at the Big House (Mike Mulholland | MLive.com) ANN ARBOR, MI - There will be no love lost in Ann Arbor this weekend when Michigan State comes to town looking to reclaim the Paul Bunyan Trophy from Michigan. While both teams had bigger aspirations of a conference title coming into the season, they'll look to secure in-state bragging rights for their annual rivalry match at noon Saturday inside Michigan Stadium. ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20150", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Monday's Mashup: Rob Gronkowski compares Bill Belichick to The Grinch Welcome to Monday's Morning Mashup. For the latest news, start at our WEEI.com home page or click here for the top stories from our news wire. MONDAY'S BROADCAST HIGHLIGHTS: NFL: Patriots at Jets, 8:15 p.m. (ESPN) AROUND THE WEB: -- Rob Gronkowski was back in his role as an NFL analyst on FOX NFL Sunday this week and he compared former coach Bill Belichick to The Grinch. Last week Gronkowski compared Julian Edelman to a squirrel, so this week...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56030", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What the committee got right, wrong in the second College Football Playoff ranking SportsPulse: Georgia at No. 4? Really? According to Dan Wolken the committee missed the mark with their second College Football Playoff ranking.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22761", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jalen Ramsey traded to the Rams, not the Eagles Howie Roseman didn't make it happen.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55436", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Falcons expected to add former Washington RB Craig Reynolds to practice squad The team is looking at depth with Devonta Freeman expected to miss multiple weeks.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39004", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Here's the bad news for Florida State after firing Willie Taggart The sing-song Florida State chant that provided the soundtrack for college football for the good part of a generation has been muted.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34447", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Miami, FSU to meet in matchup of teams badly needing a spark CORAL GABLES, Fla. (AP)   The year was 1975. Bobby Bowden was a year away from arriving at Florida State. Howard Schnellenberger was four years from taking over at Miami. Both programs were a long way from becoming perennial national championship contenders. It was a long time ago. It also was the last time   excluding season-openers   that Miami and Florida State played with neither team having a winning record. That is, until Saturday. When...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8756", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Texans must fix their pre-snap penalty woes quickly The Houston Texans offense is electric. When they step onto the field, superstars Deshaun Watson and DeAndre Hopkins are capable of scoring at will. The offense has a run game to sidekick the pass as well as an offensive line that can protect both aspects. However, the Texans' offense is not all peaches and cream. Houston leads the NFL in pre-snap penalties with 32. Left tackle Laremy Tunsil leads the NFL in false starts with eight, despite...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35435", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Swinney urges Clemson offense to flip script on 1st possession. It paid off Dabo Swinney walked into last Tuesday's coaches meeting with a new script for Saturday's home game against Florida State.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64052", "method": "POST", "url": "/v1/embeddings", "body": {"input": "49ers' Kyle Shanahan reacts differently to lapses by Kendrick Bourne, Dante Pettis Kendrick Bourne had three blatant drops during the preseason, but head coach Kyle Shanahan maintained the 49ers' wide receiver had reliable hands in August when asked about his latest dropped pass in the exhibition finale. \"I do consider Bourne to have some of the better hands on the team,\" Shanahan said. On Tuesday, a day after Bourne had two critical drops in a 27-24 overtime loss to the Seahawks, Shanahan's defense of Bourne reached another...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26821", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NFL power rankings: How do Colts compare to other 5-4 teams? An Indianapolis Colts loss to the Miami Dolphins isn't inspiring a lot of confidence in NFL power rankings lists", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25995", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Boomer Esiason: Bengals, LSU quarterback Joe Burrow could be on collision course Boomer Esiason: \"For the Bengals, this is about the future. And the way that Joe Burrow played ... I think he solidified his No. 1 overall ranking.\"", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37926", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Gophers-Penn State most watched ABC noon-hour game in three years Before ESPN schedulers dismiss the University of Minnesota again from getting an invite to \"College GameDay,\" they may want to glance at this past weekend's numbers. ABC's broadcast of the Penn State-Gophers football game drew the network's highest noontime audience in nearly three seasons with an average of more than 6.7 million people tuning in. The last time ABC attracted that many eyeballs ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56885", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Now Back With Patriots, Cody Kessler Is Exactly Where He Wants To Be https://www.dailymotion.com/embed/video/x nvtlb autoPlay= FOXBORO Mass. -- Bye week Not for Cody Kessler. While many New England", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8285", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: Potential new USC AD told he cannot pursue Urban Meyer, could back out USC supposedly has a deal in place with Cincinnati athletic director Mike Bohn to make him their next AD, but many expected an official announcement on Monday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54941", "method": "POST", "url": "/v1/embeddings", "body": {"input": "20 games that will help decide CFP championship As we head into the second half of the season, it looks as if we know the 10 or so teams that have any real shot at getting one of those coveted four College Football Playoff slots...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41693", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bucs-Titans AfterMath: Tampa Bay is imploding. Can Tim Tebow help? When Breshad Perriman collided with Dare Ogunbowale on a third-and-goal run play Sunday, that's when you knew. That's when you knew this season was over. That's when you knew the Buccaneers were going backward, literally and figuratively. It was their Mark Sanchez Butt Fumble moment. Football's a hard game. It's even harder when teammates tackle each other. Eight weeks into the season, the ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12517", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jets WR Quincy Enunwa blasts team over fine for missing neck rehab Enunwa missed all of the 2017 season due to a neck injury and is out for this season after re-injuring his neck.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51159", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jarren Williams Is Really, Really Good Can He Become Miami's Next Great QB?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21639", "method": "POST", "url": "/v1/embeddings", "body": {"input": "CBS reporter's criticism of Bengals for not trading A.J. Green turns sarcastic The Bengals had hoped that A.J. Green would be ready to play as they emerged from their bye week.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51413", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Leonard Fournette, Jags' locker-room share their thoughts towards Jalen Ramsey trade The Jags locker-room will miss Jalen Ramsey, but understand they have to move on.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11194", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Washington will look to get Terry McLaurin more active in the offense It sounds like you can expect to see much more of rookie wide receiver Terry McLaurin this weekend against the New York Jets. You can probably expect to see more of all Redskins receivers for that matter. When talking to the media on Thursday afternoon, Washington coach Bill Callahan talked about how the team went about trying to solve their offensive woes during the bye week, and one of the top solutions they came up with was getting the...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39277", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Patriots' biggest flaws are beginning to show Tom Brady and Julian Edelman aren't getting help.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53739", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'Around The NFL' crew chooses favorite storylines of Week 7 'Around The NFL' crew chooses its favorite storylines of Week 7.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43180", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Titans report card: Only B's and C's after grind-it-out win vs. Bucs Grading the Titans' 27-23 win over the Bucs on Sunday at Nissan Stadium.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18765", "method": "POST", "url": "/v1/embeddings", "body": {"input": "2020 Pro Bowl: Voting is now live for your favorite Jaguars Jags fans can now vote for their favorite players to make the Pro Bowl.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2228", "method": "POST", "url": "/v1/embeddings", "body": {"input": "2018 winner Tua Tagovailoa one of 20 Maxwell Award semifinalists Another five semifinalists from a year ago made the cut as well.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40804", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Patriots Injury Report: Josh Gordon Battling Multiple Ailments Ahead Of Jets Game It appears unlikely the New England Patriots will have Josh Gordon at their disposal when they visit the New York Jets on Monday night. Gordon sat out practice Thursday for", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34647", "method": "POST", "url": "/v1/embeddings", "body": {"input": "High school football: List of first-round games with 7 p.m. start times Here is a list of the first-round playoff games that will kick off at 7 p.m. instead of 7:30 p.m. This list will be updated as kickoff time changes are announced. Class 6A-I Tulsa Union at Broken Arrow Class 3A Kingfisher at Marlow Class A Rush Springs at Cashion Class B Empire at Alex", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47521", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Darius Slay stays, Detroit Lions stand pat at NFL's trade deadline The Detroit Lions didn't make any moves at the 2019 NFL trade deadline, which means Darius Slay remains with the franchise.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9852", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Gophers set for 2:30 p.m. kickoff against Maryland Minnesota will look to snap a two-game losing streak to the Terps", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47942", "method": "POST", "url": "/v1/embeddings", "body": {"input": "With Chad Morris firing, it's on Arkansas to answer Gus Malzahn question once and for all Arkansas fired Chad Morris on Sunday, and it's on the Razorbacks to reel in the best candidate for the job.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15487", "method": "POST", "url": "/v1/embeddings", "body": {"input": "No. 6 Notre Dame College holds on to beat Findlay and stay unbeaten SOUTH EUCLID, Ohio - The grey skies, wind and steady rain brought a smile to the face of Notre Dame College's DJ Greene. Greene, a Willoughby South grad, was right at home in conditions that many would deem unpleasant. \"I'm adapted to this,\" Greene said. \"It's not cold weather too me. I'm blessed to be out here, so anytime I'm out here I try to go hard.\" Greene's hard cut to his right and ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50557", "method": "POST", "url": "/v1/embeddings", "body": {"input": "After returning to Notre Dame College, All-American Sha'haun Williams leaves a legacy of domination CLEVELAND, Ohio - There are many examples of the havoc caused by Sha'haun Williams throughout his Notre Dame College career that propelled him into one of the nation's top Division II defensive lineman. Notre Dame coach Mike Jacobs recalls at least two games where Williams splattered the opposition. \"The playoff run last year, Slippery Rock in particular, he played out of his mind,\" Jacobs ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36893", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bengals vs. Ravens Madden Simulation: Finley has strong debut for Bengals We simulate the Bengals vs Ravens in Madden to try and predict the winner of the Week 10 game.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43736", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Matthew Stafford nominated for 2019 Art Rooney Sportsmanship Award The Lions franchise quarterback has earned some recognition for his sportsmanship.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22049", "method": "POST", "url": "/v1/embeddings", "body": {"input": "49ers' offense struggled in every aspect as perfection comes to an end The 49ers finally lost a game. You knew it was going to happen. In fact, you should have hoped it happened before the streak got out of hand, and the old Miami Dolphins started showing up with unopened bottles of Champagne, jabbering about undefeated seasons and one true perfect team. After all, adversity is a good thing. But the fact that the 49ers fell to arch-enemy Seattle in agonizing overtime fashion, 27-24, losing on a field goal at the...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37798", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Oh look, Oshkosh and Whitewater are clashing again in a WIAC battle (and it's on TV) Oshkosh and Whitewater are meeting with an NCAA berth on the line? You don't say. The two powerhouses meet again Saturday for a WIAC title.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7148", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cincinnati RB Thomas announces entry to transfer portal It turns out Cincinnati didn't just lose an athletics director on Thursday. R", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4626", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Michigan football remains 14th in new USA TODAY coaches poll; LSU new No. 1 LSU has taken the No. 1 spot in the Amway Coaches Poll after beating then-No. 1 Alabama. Minnesota moved in the top 10 after beating Penn State.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13103", "method": "POST", "url": "/v1/embeddings", "body": {"input": "UnitedHealth Group names new president The chief executive of UnitedHealth Group's Optum division for health care services is now president of the parent company as well. Andrew Witty will oversee enterprise business strategy formulation and development among other duties while continuing as CEO at Optum, according to an announcement this week from Minnetonka-based UnitedHealth Group. The last company executive to hold the title of ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11271", "method": "POST", "url": "/v1/embeddings", "body": {"input": "In Vikings' loss to Chiefs, Dalvin Cook had to run forward, backward and sideways for his yards Welcome to our morning-after Vikings blog, where we'll revisit every game by looking at three players who stood out, three concerns for the team, three trends to watch and one big question. Here we go: At the beginning of the third quarter on Sunday, Fox's Pam Oliver relayed a conversation she'd had with Mike Zimmer, during which the Vikings coach said the team's offense was trying to be \"too ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7971", "method": "POST", "url": "/v1/embeddings", "body": {"input": "49ers sign preseason pass-rush star Damontre Moore The 49ers re-signed preseason pass-rush star Damontre Moore and placed defensive end Ronald Blair on injured reserve. Moore was signed after edge rusher Ronald Blair tore his ACL on Monday against the Seahawks. Blair served as the team's first pass-rusher off the bench and had 21 tackles, three sacks and three quarterback hits in that role while playing 37 percent of the snaps in the season's first nine games. Shanahan has said defensive linemen...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45349", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eagles coordinators translated: Mike Groh lets Jeff Stoutland make his soup Welcome to another installment of Philadelphia Eagles coordinators, translated. In these fun and semi-regular diversions, we search for the true meaning behind the words of their offensive and defensive coordinators, who are always super careful not to undermine head coach Doug Pederson or be critical of any players, no matter how bad the circumstances may be. In this week's case, the ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13177", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Week 6: Takeaways from high school football in the South Sound When the dust settled on No. 8 Bethel's 35-30 win against No. 3 Lakes in Lakewood on Friday night in a battle of two top-10 teams from the 3A PCL, it felt like a long time coming for the Braves' program. While the talent pool has been there the past couple of years, it always felt like Bethel was one or two steps away. Could it all be coming together for the Braves? It certainly feels ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18907", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jets' Sam Darnold has ripped toenail removed, limited in practice After missing time because of mono, Darnold now is dealing with the effects of a ripped toenail.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63977", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Oklahoma State rolls past Kansas City 69-51 STILLWATER, Okla. (AP)   Yor Anei, Cameron McGriff and Isaac Likekele combined for 35 points and Oklahoma State dominated the boards as the Cowboys defeated Kansas City 69-51 in nonconference action Saturday afternoon. Anei finished with 13 points while McGriff added 12 and six rebounds and Likekele chipped in 10 points to lead the Cowboys, who had 10 players finish in the scoring column. Oklahoma State (2-0) held a 40-24 rebounding advantage...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17872", "method": "POST", "url": "/v1/embeddings", "body": {"input": "UW football chat with Jeff Potrykus at 7 p.m. Tuesday, Nov. 12 Badgers beat writer Jeff Potrykus chats weekly about UW football.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11296", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Mt. St. Mary's takes on Lamar Mount St. Mary's (1-2) vs. Lamar (2-1) Montagne Center, Beaumont, Texas; Friday, 8 p.m. EST BOTTOM LINE: Mount St. Mary's and Lamar look to bounce back from losses. Mount St. Mary's fell short in a 56-46 game at Washington in its last outing. Lamar lost 66-56 to Duquesne in its most recent game. LEADING THE WAY: Lamar's T.J. Atwood has averaged 19.3 points and 7.7 rebounds while Davion Buster has put up 15.3 points, 5.3 rebounds and five...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1899", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Andre Drummond, Bruce Brown lead ailing Pistons to upset of Nets, 113-109 Courageous effort from the shorthanded Detroit Pistons, rallying past the Brooklyn Nets behind a big game from Andre Drummond", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48263", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Winners and losers from NBA's opening night Some of hype for NBA's opening night doubleheader wore off when it was announced New Orleans Pelicans star rookie Zion Williamson was going to miss extensive time to injury.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10951", "method": "POST", "url": "/v1/embeddings", "body": {"input": "GAME THREAD: Dallas Mavericks at Memphis Grizzlies Ugh not another game.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48987", "method": "POST", "url": "/v1/embeddings", "body": {"input": "LA Clippers Unveil New City Edition Uniforms On Sports Illustrated Cover The Los Angeles Clippers have revealed their new City Edition uniforms.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5757", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bucks to pick up team options for Donte DiVincenzo, D.J. Wilson The last two first-round draft picks selected by the Milwaukee Bucks will be under contract for another year. The Bucks will exercise their 2020-'21 team options for D.J. Wilson and Donte DiVincenzo.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20184", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Goodwin leads Notre Dame past Robert Morris 92-57 SOUTH BEND, Ind. (AP) Mike Brey liked what he saw at both ends of the court, and particularly in light of how young this college basketball season is.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29972", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Mooney's 18 points help Notre Dame power past Howard, 79-50 SOUTH BEND, Ind. (AP)   John Mooney powered for game highs of 18 points, 16 rebounds and five assists as Notre Dame rolled to a 79-50 victory over Howard in the first-ever meeting between the schools Tuesday night. Juwan Durham and Dane Goodwin added 11 points apiece for the Fighting Irish (2-1), who jumped out to a 7-0 lead and were never threatened. Freshman Wayne Bristol Jr. was the only double-digit scorer for the Bison (0-3) with 14 points....", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50629", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Gordon Hayward Injury: Here's Celtics Star's Timetable For Return https://www.dailymotion.com/embed/video/x nvgw The Celtics won't have to make do without Gordon Hayward for terribly long. Hayward fractured his left hand Saturday night during Boston's road win over the San Antonio", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41586", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Texas A&M rallies past Louisiana-Monroe COLLEGE STATION   Texas A&M hosts No. 8 Gonzaga on Friday night. Perhaps then Buzz Williams will witness a decent crowd in Reed Arena as the Aggies' head coach. The Aggies overcame a double-digit deficit in the second half to dispatch Louisiana-Monroe 63-57 Monday night before a couple of thousand fans in the 13,000-seat stadium. That followed the few thousand who showed up for Williams' debut on Wednesday, a 77-63 victory over Northwestern...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12562", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Forgetful Curry says this Christmas gift from Ayesha 'saves my life' Stephen Curry has a lot on his mind: his wife, his three young kids, his high-profile job as one of the NBA's most famous faces.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57698", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Maine family hopes for answers nearly 30 years after father of 2 killed A Maine family is still hoping for answers nearly 30 years after a father of two was killed on a Portland street. For 29 years, the family of Scott Sampson have wondered who killed him and why. Sign up for our Newsletters \"A murder is not easy to accept, so there was a lot of trauma during that time,\" Sampson's sister, Sandra Hill, said. Sampson was found dead on Pine Street in Portland in November of 1990. The only witness was a police officer...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30123", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nets star LeVert undergoes surgery, to miss several weeks Prior to suffering the injury, LeVert was averaging career bests in points (16.8) rebounds (5.0) and assists (4.0) while shooting 36% from distance.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N913", "method": "POST", "url": "/v1/embeddings", "body": {"input": "ASK IRA: Would D'Angelo Russell make sense for Heat? Q: Ira, I know you don't do rumors. But do me a solid: Even if it's only a rumor (sorry) would you trade Justise Winslow and Dion Waiters for D'Angelo Russell? Why not get a second star now, with Golden State playing for the future? -- Zach. A: First of all, I can't fathom any deal involving Dion Waiters at the moment, but I appreciate the effort in attempting to match salaries. Also, keep in ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44623", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Stephen A. Smith will reportedly be paid more than 300 NBA players This year, Stephen A. Smith will earn the same amount as Lou Williams ($8,000,000) and more than Luka Doncic, Derrick Rose and Jayson Tatum!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4464", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Legal team representing Wiseman confident as he remains on court MEMPHIS, Tenn.   Memphis Tiger basketball star James Wiseman is now just one week away from his first day in court against the NCAA, but thanks to a temporary restraining order, he is still allowed on the court. Wiseman is a force on the court, but his legal team said Wiseman feels uncomfortable being thrust into the national spotlight due to his pending lawsuit with the NCAA. \"He doesn't want ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14573", "method": "POST", "url": "/v1/embeddings", "body": {"input": "New posts lead No. 18 ASU women to another blowout win Ja'Tavia Tapley had a career high 18 points and Jayde Van Hyfte her first double-double in No. 18 ASU women's basketball's 83-51 win over Army.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41489", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Buddy Hield calls Kings' extension offer 'insult': 'Name one big free agent that came to Sacramento' The Kings have reportedly offered $90 million over four years. Hield reportedly wants $110 million over four years.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48421", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Memphis, Wiseman have 1 more game, then it's back to court James Wiseman has one more game before heading back to court with his attorneys as they take on the NCAA in a high-stakes battle to keep the 7-foot-1 freshman playing in what could be his only year with the Memphis Tigers, one that could prove costly for the university. The nation's top-rated recruit has been ruled likely ineligible by the NCAA for receiving improper benefits from Penny Hardaway   before the former NBA All-Star was hired as...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32686", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Memphis judge rules in favor of TSSAA regarding James Wiseman, Ryan Boyce coaching link The TSSAA's coaching link rule was upheld by a Memphis judge regarding former East players James Wiseman and Ryan Boyce.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44108", "method": "POST", "url": "/v1/embeddings", "body": {"input": "How to watch Cincinnati basketball take on Drake Here is the information you need to know to follow UC basketball vs. Drake on television, radio or online as well as three storylines to watch.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44888", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Phoenix Suns tip off season with blowout win over Sacramento Kings The Phoenix Suns (0-1) open season with impressive win over Sacramento (0-1) after losing to the Kings by 17 points in the preseason.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53292", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kevin Durant: Draymond Green argument factored into departure from Warriors Kevin Durant said Thursday that his verbal altercation with Warriors forward Draymond Green last November played a role in his decision to leave Golden State for the Nets in free agency. \"I wish that wouldn't have happened,\" Durant said on ESPN's \"First Take.\" \"I feel like that was a situation that definitely could have been avoided. It really came out of nowhere.\" Durant's on-court argument with Green came during a loss to the Clippers early...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15044", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Woj: Ayton facing 25-game suspension Ayton was tested and found to have illegal diuretic in system", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9779", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Injured Curry won't fret about missing season for Minnesota MINNEAPOLIS (AP) An ordinary scrimmage for Minnesota last week took a discouraging turn as Eric Curry's right knee jerked, popped and buckled when the lanky junior tried to make a move on defense.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39989", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Arizona prep powerhouse Dream City Christian beats California's star-studded Sierra Canyon in exhibition Dream City Christian won 80-69, the 13th and final preseason game before its regular season begins Nov. 14.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N19735", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cassius Winston posts heartfelt message to late brother on Instagram Remarkably, Winston was able to play in Sunday's game just a day after his brother passed. The senior played 26 minutes and registered a double-double with 17 points and 11 assists.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11701", "method": "POST", "url": "/v1/embeddings", "body": {"input": "LeBron James addresses 'tough situation' after China backlash LeBron James made headlines with his remarks Monday about China, Hong Kong and a pro-Hong Kong tweet, some would say for all the wrong reasons.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20167", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Devin Booker wants wins, not scoring titles, and he wants them in Phoenix Arizona Booker wants to keep on winning games, says the rest will work itself out.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36784", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Coby White's team-record 7 4th-quarter 3-pointers leads the Bulls past the Knicks 120-102 The Bulls got more of the 3-pointers and free throws they've been wanting, but they squandered yet another lead in the third quarter against the Knicks on Tuesday night. Thank the stars for Coby White. The rookie drilled a team-record seven fourth-quarter 3-pointers to boost the Bulls to a 120-102 win at the United Center. Seconds after his sixth trey gave Chicago a 109-89 edge with just under ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9289", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Mark Jackson is name to watch in potential Knicks head coach search The New York Knicks may be headed for another head coaching search in the weeks and months to come, and there may already be a potential favorite to get the job when that search happens.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N388", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NBA conference imbalance could haunt the West this season Will young stars in the West miss out on the playoffs because of conference imbalance?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14927", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Colorado State football coach Mike Bobo's buyout not unusual in college football, Mountain West Colorado State football coach Mike Bobo is the second-highest paid coach in the Mountain West and his buyout is the fourth-largest.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7520", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Clippers resting Kawhi Leonard for nationally televised game at Jazz A couple years ago, NBA commissioner Adam Silver received power to fine teams for resting players in nationally televised games. Teams were also encouraged not to rest players on the road.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41200", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NBA Stars Show Love For Gordon Hayward After Celtics Star Fractures Hand https://www.dailymotion.com/embed/video/x ntycn Gordon Hayward is no stranger to receiving digital thoughts and prayers from fellow NBA players. The Boston Celtics star suffered a fractured left hand Saturday night against the San Antonio", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62754", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cleveland Cavaliers nearly pull off upset against Philadelphia 76ers, lose 98-97: Chris Fedor's instant analysis PHILADELPHIA -- The Cleveland Cavaliers had the Philadelphia 76ers on the ropes, with the restless crowd booing the home team for the second straight game. They were eyeing a chance to punctuate a triumphant three-game road trip with an improbable upset. It was in their grasp. Then, because of a cranked-up Philadelphia defense, a few mistakes by Cleveland at both ends, a couple missed free ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N60432", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rodman offers to be NBA's ambassador amid China controversy Dennis Rodman wants to help make peace between the NBA and China.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35249", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Can James Wiseman and Memphis topple the NCAA as we know it? | Giannotto Memphis, through its support of James Wiseman and Penny Hardaway, is electing to be the first university to rebel in the growing war against the NCAA.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62596", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Heat waive Martin, Mulder, with more moves to follow The Miami Heat have begun the process of finalizing their roster in advance of next Monday's NBA-mandated deadline, waiving guards Jeremiah Martin and Mychal Mulder. Tuesday's dual moves leave the Heat with 18 players, two below the NBA offseason maximum. While teams are limited to 15 players during the regular season, the Heat are expected to carry 14 due to their position against the hard ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63872", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Greg Paulus' unconventional road after Duke leads him to head coaching job at Niagara Greg Paulus' career playing point guard at Duke and quarterback at Syracuse was anything but conventional, and his path as a coach has been even more so.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55297", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Markelle Fultz shines in Magic regular season debut The third-year guard played his first regular season game for the Magic, and was arguably their brightest spot.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53504", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dwyane Wade on new-look Heat: 'I really love this team' Friday ended with a 15-point road loss to the Lakers, but it was what happened that afternoon that had the Heat smiling at the end of the night. Retired guard Dwyane Wade, who has relocated to the Los Angeles area with his family, spent time with Heat players and staff and even spoke to his former team hours before tip-off about the importance of upholding the team's culture he helped build ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53961", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Long Island High School Coach Suspended   For Scoring Too Many Points? Who appointed these people to run this kangaroo court, being the judge, jury, and executioners? Plainedge Public School Superintendent Edward Salina said in a statement.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39857", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Baltimore-area athletes signing National Letters of Intent Wednesday began the early period for high school athletes to sign National Letters of Intent to accept athletic scholarships from Division I and Division II college programs. This period includes basketball, lacrosse, baseball, softball, track and all other sports except football, which has later signing dates. Following is a list of local student-athletes who plan to sign during the early ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18653", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Lewis helps No. 15 Florida to tight 66-60 win over Towson Florida has resembled more of a pretender than a contender in the early going.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42505", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'I've never used those words in my life': Giannis says Harvard misquoted him Giannis Antetokounmpo says he was misquoted in Harvard study on his staying in Milwaukee", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7086", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Lin's 40-point debut with Beijing Ducks proves he still belongs in NBA The longtime NBA veteran and recent champion struggled to field offers from the league in free agency this summer", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18327", "method": "POST", "url": "/v1/embeddings", "body": {"input": "25 storylines to follow heading into the 2019-2020 season It doesn't matter if you are a blue blood or coming off playing in your first national championship game, every team begins with a fresh slate and the journey to earning a spot in the Big Dance begins now.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44968", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Braves free agent targets: Catchers The Braves will be in the market for a catcher, and there are four free agent catchers who could be a nice fit.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54321", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Braves make a splash, signing closer Will Smith to three-year, $39 million deal The two-time defending NL East champion Braves have had bullpen issues and addressed that immediately by signing the left-hander.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54232", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nationals GM Mike Rizzo on White House visit: 'We weren't trying to make a political statement' The team's visit to the White House was met with criticism, particularly catcher Kurt Suzuki's decision to wear a MAGA hat on stage.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17172", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'We'll be fine': Astros confident in World Series comeback against Nationals The Astros will try to become only the second team since 1985 to lose their first two games at home and still win the World Series vs. Nationals.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4470", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cub Tracks' mettle men Manager tracker, Ross the boss, everybody is a star, and other bullets", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37843", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Column: Cubs hope to shield players from offseason trade rumors. Will it work? Cubs veterans looking for clues about their future in Chicago can stop reading now. President Theo Epstein said Monday he's not interested in reacting to every rumor that pops up on Twitter, the internet or talk radio. The Cubs entered the offseason with speculation they're shopping catcher Willson Contreras and that former Most Valuable Player Kris Bryant may also be available for the right ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28626", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Daily Chop: Ronald Acuña, free agent notes and more There are many more great things to come for Ronald Acuña Jr.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6666", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Arizona Diamondbacks unveil new uniforms for 2020 MLB season The Diamondbacks are making more changes to their uniforms, moves that further walk back the radical designs they unveiled four years ago.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33436", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Video appears to show Astros stealing signs against Danny Farquhar A bombshell report that was published on Tuesday took the sign-stealing allegations against the Houston Astros to the next level, and there is video evidence that supports at least one of the claims in the story.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61500", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Yankees' CC Sabathia goes out in perfect style, leaving his body on the field CC Sabathia, still in severe pain a day later, his left arm in a sling, the Yankees acknowledged that his 19-year career is over.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25294", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: MLBPA investigating comment made by Alex Anthopoulos The MLBPA released a statement on Wednesday saying it is looking into suspicious comments made by Braves GM Alex Anthopoulos during a conference call earlier this week.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33749", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Monday Morning Minnesota: Sign Every Pitcher Edition Just a general request.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N46903", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Did James Paxton get pulled early because Astros saw him tipping pitches? James Paxton's short outing in Game 2 of the ALCS has led to speculation that he may have been tipping his pitches", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22803", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Christian Yelich slams Yu Darvish after pitcher discussed at-bat vs. slugger A pro-Chicago Cubs site insinuated that Christian Yelich was looking to the Brewers' bullpen in one instance to get some sort of signal while facing Cubs pitcher Yu Darvish.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35206", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Félix Hernández leads Mariners free agents as team declines Wade LeBlanc's option The (clerical) end of an era.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53103", "method": "POST", "url": "/v1/embeddings", "body": {"input": "2019 in Review: Danny Salazar A frustrating ending to what began as a promising partnership", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9722", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nationals rally to stun Astros in Game 7 to win World Series Zack Greinke tossed 6 1/3 solid innings in his first Game 7 start of the World Series, but the Washington Nationals rallied late, 6-2, to win their first Fall Classic in franchise history. After Houston grabbed a 2-0 lead, Washington rallied for three runs in the seventh on a pair of home runs by Anthony Rendon and Howie Kendrick. Juan Soto made it 4-2 on a single in the eighth before Adam Eaton added two insurance runs on a two-run single in...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62697", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: Royals' Pedro Grifol gets second interview with Giants for manager job The 49-year-old Grifol has worked in the Kansas City organization in a variety of roles dating back to 2013.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8686", "method": "POST", "url": "/v1/embeddings", "body": {"input": "CC Sabathia threw three pitches on separated shoulder in ALCS Game 4 Sabathia's three pitches on a ripped shoulder? How about 91, 80, and 88 miles per hour.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17507", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Why did Aaron Boone pull Masahiro Tanaka after 68 pitches? The Astros were the best team in baseball all year. Statistically, they pitch better and they hit better than the Yankees. According to Baseball Prospectus, they lead the majors in Park Adjusted Defensive Efficiency. (The Yankees rank 12th.) Oh, and they're home. Didn't matter. Zack Greinke went 8-1 with Houston, but already took his second loss of the playoffs on Saturday night. ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4823", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Scott Boras Details Why J.D. Martinez Opted Into Contract With Red Sox https://www.dailymotion.com/embed/video/x nyejh The Major League Baseball general managers' meetings officially are underway which means agent Scott Boras is out and about answering questions about his upcoming free agents and players", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50402", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Astros fans to Justin Verlander: You can do it! #TakeItBack The Houston Astros face the Washington Nationals at Minute Maid Park on Tuesday night for game 6 of the 2019 World Series. The Astros lead the series 3-2 and a back-to-back-to-back wins in Washington D.C. over the weekend. Justin Verlander will be on the mound for the Astros and like Gerrit Cole, fans are convinced J.V. will redeem himself. RELATED: Don't press your luck: Some Houston Astros are very superstitious RELATED: World Series Game 6:...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23280", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Seven Free Agent Starting Pitchers Red Sox Could Target This Offseason https://www.dailymotion.com/embed/video/x nq ej The Red Sox s roster could look very different come Opening Day. Or most of Boston s pieces might remain intact. It all depends on the vision", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36011", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Nationals won the World Series, and now there are only six MLB teams without one The Nationals won their franchise's first World Series on Wednesday, and now there are only six left. Here is a look at those yearning for a title.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26770", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Three lessons the Yankees can learn from the ALCS Most importantly, pitching needs to be addressed.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48666", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Yankees' Aroldis Chapman makes opt-out decision just before deadline | What happened; what it means The last memory that many Yankees fans have of Aroldis Chapman is his reaction to blowing the season on Oct. 19 at Minute Maid Park in Houston. His on-the-mound smirk was a bad look even though Chapman was just showing disbelief after Jose Altuve won the pennant for the Astros with a ninth-inning, walk-off homer in Game 6 of the American League Championship Series. Chapman provided a new ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7163", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Phillies owner John Middleton said to be leaning towards Joe Girardi Phillies owner John Middleton had the determining vote in the team's decision to fire manager Gabe Kapler, and he could wield his power again in finding a new skipper.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63594", "method": "POST", "url": "/v1/embeddings", "body": {"input": "That week off sure didn't hurt the Nationals Nats take a 2-0 lead back home to Washington D.C.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7060", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Smith: Time for Justin Verlander to earn his first World Series win It is simple, really. The Astros close it out inside a roaring Minute Maid Park and prevent Game 7 from even happening. Justin Verlander, 2019 American League Cy Young favorite and future Hall of Famer, records the first World Series victory of his 15-year career ... and the Astros win the World Series. \"He's prepared. He's ready for this moment,\" said Gerrit Cole, after pitching the Astros to a 3-2 series lead in Game 5. \"We've been...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49162", "method": "POST", "url": "/v1/embeddings", "body": {"input": "MLB rumors: Why dreams of a Yankees-Mets Noah Syndergaard trade are dead Sometimes the best trade is the one you don't make. New York Mets general manager Brodie Van Wagenen dangled right-hander Noah Syndergaard before the July 31 trade deadline, but ended up holding on to the 27-year-old flame-thrower. With hot stove season upon us, the rumor mill is cranking up, but this time around, it won't involve Syndergaard and the Mets. MLB.com's Anthony DiComo reports \"Van ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42684", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Marlins have a new Triple-A affiliate   Meet the Wichita Wind Surge Say goodbye to the New Orleans Baby Cakes. After an 11-year run in Louisiana, the Miami Marlins' Triple-A affiliate is relocating to Kansas and has finally decided on a new name. Meet the Wichita Wind Surge. After taking name suggestions over the past year, Wichita unveiled its new logo and jerseys on Wednesday night in front of a gathering of fans. The team officially announced the name to a ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32455", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'This is what you live for': Max Scherzer, 'rising from the dead,' ready to lead Nationals into Game 7 Max Scherzer is set to take the mound in the winner-take-all Game 7 on Wednesday, just three days after being scratched from Game 5 due to neck pain.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2012", "method": "POST", "url": "/v1/embeddings", "body": {"input": "LeMahieu, Hicks lift Yanks over Astros, close to 3-2 in ALCS NEW YORK (AP)   James Paxton was filled with nerves, and so were New York Yankees fans, worried the season was slipping away. Tension only surged when the top of the first featured a little grounder that got away, a passed ball and a run-scoring wild pitch. No worries. Boom! DJ LeMahieu drove Justin Verlander's second pitch over the wall to tie the score. Clang! Aaron Hicks hit a three-run homer off the foul pole later in the inning. Just like...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36841", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chicago Cubs hire David Ross to replace Maddon as manager The Chicago Cubs hired former catcher David Ross to replace Joe Maddon as their manager Thursday, hoping he can help them get back to the playoffs after missing out for the first since 2014.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56159", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cole Hamels could provide competence - and nostalgia - for the 2020 Phillies rotation As the Eagles have shown us, nothing can go wrong by bringing back a great player from the past", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4070", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tigers GM expects Miguel Cabrera to stick with nutrition plan to ease pressure on knee SCOTTSDALE, Ariz. -- Detroit Tigers general manager Al Avila expects to see a slim, motivated Miguel Cabrera arrive at spring training in three months. \"I've talked to Miggy. I've talked to his agent. He's committed to make sure that these last four years go as well as possible,\" Avila said Tuesday at the MLB General Manager Meetings. Four years is the magic number for Cabrera, 36, because it ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56683", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Yankees Fire Pitching Coach Larry Rothschild The Yankees have fired Larry Rothschild, their pitching coach since 2011. The team announced the move Monday morning. \"I want to personally thank Larry for his near decade of commitment to this organization,\" Yankees general manager Brian Cashman said in a news release. \"Larry cares deeply about his craft and the pitchers under his tutelage, and he played a significant role in our successes over the past nine seasons. There's a reason why Larry...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42309", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Twins trim roster to 37 with moves on LaMarre, Miller and Torreyes The Twins freed up three spots on their 40-man roster by outrighting outfielders Ian Miller and Ryan LaMarre, along with infielders Ronald Torreyes, on Monday. LaMarre and Torreyes, if they clears waivers, will be free agents. LaMarre was picked up in September after playing for Atlanta's Class AAA team and hit two home runs and .217 for the Twins. Torreyes signed in the offseason and played ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15930", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Washington Nationals at Houston Astros: World Series Game 2 GameThread... Washington and Houston play the second game of the 2019 World Series at 8:07 PM EDT with Stephen Strasburg on the mound for the Nationals against Astros' starter Justin Verlander. FOLLOW: FOX; 106.7 the FAN in D.C.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22995", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Marvin Miller gets another shot at MLB's Hall of Fame as a member of the Modern Era ballot Marvin Miller   the man responsible for strengthening the players' union   is once again up for induction into the National Baseball Hall of Fame and Museum. Miller is among the 10 baseball figures on 2020's Modern Baseball Era ballot.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35078", "method": "POST", "url": "/v1/embeddings", "body": {"input": "MLB trade rumors: The Yankees target that got away The Yankees \"tried hard\" to pry reliever Mychal Givens from the Orioles just before the trade deadline, according to a report from the New York Post's Joel Sherman. General manager Brian Cashman was believed to be in search of starting pitching at the time, but he repeatedly stressed that he would be open to upgrading the bullpen if starters weren't available. Ultimately, he didn't make any ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26158", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Braves re-sign Markakis, Flowers to new deals, decline option for Teheran The Braves made their first wave of offseason moves Monday, deciding several club options and tendering their best free agent a qualifying offer.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41774", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Five bold predictions for the 2020 Yankees Lindor to the Yankees? Where do Andujar and Frazier play next year? Does Cole end up in the Bronx?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51350", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Juan Soto got to enjoy his first beer as a 21-year-old after World Series win Perhaps you've heard   young Washington Nationals star Juan Soto just turned 21.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32739", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Winners and losers from Game 4 of the World Series Alex Bregman broke out of his slump in a big way making him a clear winner in Game 4. Who were the other winners and losers?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38889", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Donald Trump says he'll be at World Series, but Nationals say his foe will be tossing first pitch Of course, that's only if there is a Game 5.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35340", "method": "POST", "url": "/v1/embeddings", "body": {"input": "MLB GM wants Jeff Luhnow 'banned for life' if he knew of Astros' sign-stealing Another team executive said he wanted to see the league throw the book at the Astros.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1283", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Derek Dietrich among 4 Cincinnati Reds players removed from 40-man roster Derek Dietrich will likely become a free agent after he was removed from the Reds' 40-man roster Monday. He hit .187 with 17 homers this year.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N31030", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Astros vs. Nationals: How they match up in the World Series A position-by-position analysis of this year's World Series between the Astros and Nationals, which begins Tuesday night at Minute Maid Park. CATCHER Neither team has gotten much offensively from its catchers in the postseason. Robinson Chirinos is only 2-for-22 (.091) with an ALDS homer for the Astros, but Martin Maldonado, who is 4-for-13 and superior when it comes to combating the running game, might be the batterymate of everyone but Justin...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7052", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Erik Neander Named MLB's 2019 Executive of the Year at the GM Meetings Neander was the runner-up in last year's voting.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5609", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Brotherly Game Daily Links: MLS Cup is here! Tale of the tape, hold off on Zlatan to Milan for now and can Leicester City do it again?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25285", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Undetectable drugs might have role in horse racing deaths Horse racing has never experienced a year like this one. A spike of deaths at Santa Anita, Keeneland and tracks in New York, mixed with a controversial finish in the Kentucky Derby that prompted a lawsuit, have left the sport with a crisis-a-week feel. This week, there is plenty more anxiety as attention turns to the Breeders' Cup races, horse racing's version of the Super Bowl.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57758", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kings 113, Knicks 92: Two in a row Sacramento led by 30 at one point.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20719", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Franklin overcomes 20 years of losing, coach's cancer to find success one day at a time Franklin hadn't posted a winning season since 1996, won a conference title since 1989 or a section since 1984 when Chris Coll arrived", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4943", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Somerset Berkley corners Andover in field hockey semifinal Somerset Berkley scored three times off corners in the first half to build an insurmountable lead against Andover in a Division 1 state semifinal Thursday night in Braintree, keeping its perfect season intact with a 4-1 victory.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43679", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Wrestling: Cyclone Open features ISU-UNI battles, lineup answers and more What makes the Cyclone Open fun every year is the opportunities it presents for those who attend.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34251", "method": "POST", "url": "/v1/embeddings", "body": {"input": "AFC Playoff Picture: Where Patriots stand heading into bye week Although it is only Week 10, we figured with the Patriots heading into their bye week it was a good time to look at the AFC playoff picture. Even though the Patriots are coming off a loss, they are still the No. 1 seed in the AFC and still will be after play this coming weekend. The Patriots' schedule is very tough the next few weeks with their next four opponents all having above .500 records. Here's how things currently shake out. 1. Patriots...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21075", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Sterling Marlin to race against grandson at Fairgrounds Speedway Nashville in All American 400 Stirlin Marlin is following in the footsteps of his father Steadman, grandfather Sterling and great grandfather Coo Coo.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63894", "method": "POST", "url": "/v1/embeddings", "body": {"input": "DBB Podcast: Blake Griffin Returns! Ben and Laz discuss the week in Detroit basketball", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N855", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Parkland football's furious fourth-quarter rally lifts it over Freedom, into District 11 6A final Parkland coach Tim Moncman instructed his defenders to bat the football down on Freedom's last-second heave. The Trojans didn't, leading to a mad scramble with no time left on the clock. Freedom freshman Owen Johnson-McCormick won a jump-ball battle, catching Jared Jenkins' throw at the 4-yard line. Johnson-McCormick tried to pull Parkland defensive back Nick Johnston over the goal ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36702", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Forbes values LA Galaxy at $480 million Half a billion big ones", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29401", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Mikaela Shiffrin stunned by New Zealand 17-year-old in World Cup opener Alice Robinson beat Mikaela Shiffrin, becoming the youngest World Cup winner in nearly seven years.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52501", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Fan confidence in Maryland men's basketball on rise, while it sinks to another low for football Fan confidence is on the rise   but only for basketball. Football is a different story.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2676", "method": "POST", "url": "/v1/embeddings", "body": {"input": "1 killed, 4 wounded in shooting at Tennessee strip club MEMPHIS, Tenn. (AP)   Police in Tennessee say a woman was killed and four other people were injured in a shooting at a strip club in Memphis. The Memphis Police Department said on Twitter that officers responded to a shooting inside the club early Sunday. Police said a woman was found dead. Two male victims were in critical condition at a Memphis hospital while two other male victims had injuries that were not life threatening. Police did not...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24292", "method": "POST", "url": "/v1/embeddings", "body": {"input": "GAME THREAD: Dallas Mavericks at Boston Celtics Can Dallas get back on track against a top defense?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48797", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tennessee aiming to avoid repeat of last season's finish KNOXVILLE, Tenn. (AP)   Tennessee enters its final two games of the regular season in the same situation it faced last year. The Volunteers hope the similarities end there. Tennessee (5-5, 3-3 SEC) has won three straight games and needs one more victory to become bowl eligible for the first time since 2016. The Vols have this week off before traveling to Missouri (5-4, 2-3) and hosting Vanderbilt (2-7, 1-5). The Vols also split their first 10...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48238", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Behind the scenes with hometown Olympic Champ Caeleb Dressel In Rio --- his very first Olympics -- Caeleb Dressel won two gold medals. Then the Gator swimmer was the first man in American history to break 18 seconds in the 50 free at an NCAA meet. Then this year Dressel made headlines around the planet at the World Championships in South Korea. He broke Michael Phelp's 100 fly world record. He's often called the most talented or the hottest male swimmer right now in the world. But when he smashed that...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48665", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Opening Night: Magic vs. Cavs GameThread It's Opening Night in Orlando!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56184", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Washington Spirit to split 2020 NWSL season between 3 stadiums Audi Field, Segra Field, and the Maryland SoccerPlex will all host the Spirit next year", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36162", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Video: Clark Hunt's midseason 'State of the Chiefs' address The Chiefs owner spoke to media members on Wednesday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N31952", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Day in Sports: Monday, October 14, 2019 The Day in Sports: Monday, October 14, 2019", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8136", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Injury update: T.J. Hockenson did not suffer concussion vs Raiders The team isn't worried about a brain injury after the rookie tight end suffered a scary hit on Sunday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13307", "method": "POST", "url": "/v1/embeddings", "body": {"input": "John Cena reveals why he was bullied as a kid growing up in Mass. Turns out the WWE superstar wasn't always the big man on campus.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42887", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Day in Sports: Thursday, October 17, 2019 The Day in Sports: Thursday, October 17, 2019", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43427", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Mongolian Groom trainer 'very sorry' following horse's death at Breeders' Cup Mongolian Groom suffered a broken leg in the final stretch of the Breeders' Cup Classic, becoming the 37th fatality at Santa Anita since December.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51904", "method": "POST", "url": "/v1/embeddings", "body": {"input": "3 thoughts as Colorado State football team wipes out UNLV for third win in a row The Colorado State football team went up 21-0 in the first quarter on UNLV and cruised to a Mountain West win.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27255", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Quick Recap: Suns lead late, but lose to Lakers 123-115 Lakers made three big threes to take the commanding lead with just 1:39 left.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62807", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Memphis Zoo reviewing gun policy after 'accidental' shooting MEMPHIS, Tenn. (AP)   A man who authorities say accidentally shot himself at the Memphis Zoo in Tennessee has prompted zoo officials to review their weapons policy. News outlets report the man shot himself in the leg while he was entering the zoo Tuesday. Memphis Zoo Chief Marketing Officer Nick Harmeier says the man was reaching into his pocket for his ID but instead knocked into the gun which went off in his pocket. Harmeier says patrons are...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12147", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NBA roundup: Doncic's triple-double leads Mavs over Pels NBA roundup: Doncic's triple-double leads Mavs over Pels", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28321", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Man fatally shot at Tennessee's Austin Peay State University CLARKSVILLE, Tenn. (AP)   Police at Austin Peay State University in Tennessee say a man has been fatally shot at a campus housing complex. University police said in a news release that officers responded to a report of shots fired Sunday night and found a man with gunshot wounds at the Hand Village apartments. The man, who was not a student, was pronounced dead at a hospital. The victim's name was not immediately released. The statement says the...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27843", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Elite two-way 2020 prospect Jared Jones commits to Texas #40AcresFamily", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54173", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Louisville City FC secures last-minute comeback to make third straight USL championship For the third straight year, Louisville City FC is going to the championship following a 3-1 win at Indy Eleven on Saturday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29396", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tuesday's Arizin: New Look, Same Offense The Wildcats are bigger, longer, and more athletic this season, but they're still playing the same winning basketball.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11215", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Maryland men's basketball preseason mailbag Our readers sent in questions, and our editors answered some of the best.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5988", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Lipscomb plays Tennessee St. Lipscomb (1-1) vs. Tennessee State (1-1) Gentry Center, Nashville, Tennessee; Tuesday, 8 p.m. EST BOTTOM LINE: Lipscomb and Tennessee State look to bounce back from losses. Both teams are coming off of losses this past Saturday. Tennessee State lost 59-57 at Chattanooga, while Lipscomb fell 73-70 at home to Middle Tennessee. LEADING THE WAY: This game represents a Nashville homecoming for Bisons senior Andrew Fleming, who's recording 12.5...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2328", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Injury report: Detroit Lions shorthanded at running back The Lions may need to bring in some RB help... as if they didn't need some already.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62483", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Breaking down the Wizards' shootout loss to the Rockets last night The Wizards' offense was on fire for the most part, but late game rebounding cost them the game.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42178", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kentwood fighter Calvin Harbaugh to make MMA pro debut in December Calvin Harbaugh will be making his professional MMA debut on Dec. 14 at the DeltaPlex Arena, and the Kentwood fighter is aware that some are saying he's not ready. Harbaugh, 23, has a message for those naysayers: keep on talking. \"That's what fuels me because it makes you want to show people who you really are,\" said Harbaugh, who trains out of Blue's Gym in Grand Rapids and won multiple ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45383", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Top 50 sports stories of the 2010s Not all of them have been particularly happy, but they all tell the story of sports in the 2010s. Here are the top 50 sports stories of the last decade.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14124", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Fantasy football: Start 'em, Sit 'em Let Sosa help guide you through Week 8 of your fantasy football seasons.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2926", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Pittsburgh Steelers Sign Former Pitt Panthers Running Back Darrin Hall To Practice Squad The Steelers are turning to a former Pitt Panther for running back depth.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56307", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Motor racing: Chadwick feels F1 is further away the closer she gets Motor racing: Chadwick feels F1 is further away the closer she gets", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29916", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Milwaukee vs. Miami: Bucks Play With Their Food, Lose Death by Duncan Robinson and Kelly Olynyk.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N375", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Detroit Lions safety Tracy Walker fined for comments, not foul It wasn't a foul, but apparently you can't say that publicly.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44416", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rockets vs Nets game thread The Houston Rockets will look for their fourth straight win tonight against the Brooklyn Nets.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64753", "method": "POST", "url": "/v1/embeddings", "body": {"input": "After lengthy hiatus, Rogers High School Athletic Hall of Fame sees new life NEWPORT -- It's been three months since Steve Hyder underwent a successful kidney transplant. Instead of being run down all the time, the Rogers High School graduate is feeling \"like a new man.\" Hyder wanted to put some of this newfound energy to good use, so he inquired a few weeks back about his alma mater's athletic hall of fame, which went silent after inducting five classes from 2008 ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27075", "method": "POST", "url": "/v1/embeddings", "body": {"input": "High School Roundup: Martin County girls soccer dominate again in win over Sebastian River Martin County girls soccer dominated Sebastian River in a 5-0 victory Wednesday night", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41104", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Phoenix's history of hosting big events key to NASCAR moving championship to Valley in 2020 NASCAR President Steve Phelps says the Valley's history of hosting big events was a factor in bringing the championship to ISM Raceway in 2020.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55131", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Griffins Score Twice in Final Minute to Win at Monsters GRAND RAPIDS GRIFFINS 4 at Cleveland Monsters 2", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17837", "method": "POST", "url": "/v1/embeddings", "body": {"input": "St. Edward, Euclid, Benedictine, Holy Name & Mayfield earn playoff wins The opening night of the OHSAA football playoffs was full of great games and close calls. In Division I, Region 1, St. Edward used a strong second half to rout Medina 73-38, while Euclid held off Jackson 28-19. The Eagles and Panthers will meet at a neutral site next week. In Division II, Region 5, Mayfield handled Willoughby South 47-21. The Wildcats are tasked with knocking off four-time defending state champion Archbishop Hoban in the...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59913", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kyle Connor has goal and assist, Jets beat Canucks 4-1 WINNIPEG, Manitoba (AP) Kyle Connor had a goal and an assist and the Winnipeg Jets beat the Vancouver Canucks 4-1 on Friday night.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20494", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Stastny gets 2 power-play goals, Vegas beats Kings 5-2 LOS ANGELES (AP)   Paul Stastny scored twice on the power play, Max Pacioretty added a power-play goal and the Vegas Golden Knights beat the Los Angeles Kings 5-2 on Sunday night. Reilly Smith and Mark Stone also scored, and Marc-Andre Fleury made 36 saves as the Golden Knights swept their first set of back-to-back games. Vegas was 3 for 3 on the power play after starting the season 3 for 17 with the man-advantage. Jonathan Quick allowed five...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43666", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Phoenix Rising lose in unfashionable way, drop home streak in tow Monarchs' Kyle Coffee nicked the game winning goal off a corner kick with four minutes left in regulation play as Real Monarchs stunned Phoenix Rising 2-1.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37341", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Why Detroit Red Wings dashed Evgeny Svechnikov's dream and demoted him Detroit Red Wings forward Evgeny Svechnikov had hoped to celebrate his birthday with his mom and brother, then play against Andrei Friday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N16658", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Avalanche all-star Mikko Rantanen injury update coming Wednesday Avalanche all-star Mikko Rantanen was evaluated Tuesday and the team will discuss his lower-body injury Wednesday after practice if he does not participate.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38607", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What We've Learned About Each Player On Bruins Through Five Weeks https://www.dailymotion.com/embed/video/x nnj l The - NHL season is young indeed but enough time has passed to where educated opinions can be formed about the group the Boston Bruins are trotting", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1003", "method": "POST", "url": "/v1/embeddings", "body": {"input": "CCSU football player meets 2-year-old he helped with bone marrow donation NEW BRITAIN -- Michael Mushaw is in senior year at CCSU and is a linebacker on the school's Blue Devils football team. When he hit the field on Saturday afternoon, he wasn't only playing for Blue Devil fans, he was also playing for a special toddler in the stands. Eleanor is a two-year-old who Mushaw helped save with a selfless bone marrow donation. Mushaw said his former head coach inspired ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6585", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Next Bruins 50/50 Raffle To Benefit Fallen Worcester Firefighter's Family https://www.dailymotion.com/embed/video/x nygu Boston Bruins fans have the chance to help the family of a fallen hero. The Bruins Foundation will hold a / raffle on Saturday at TD Garden during", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44404", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Will the Kings trade Jonathan Quick after his poor start to the season? Through two starts, Quick is 0-2 and has allowed a shocking 14 goals on just 56 shots.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11956", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Recap: A mammoth comeback win for the Penguins over the Islanders! Luckily hockey games are 60 minutes and not 40. The Pens needed some time to find their legs in this one.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34818", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hart shines, but Flyers fall in shootout to Capitals So ends a promising winning streak, but thus continues a point getting streak!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7401", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Avalanche F Mikko Rantanen goes down with leg or ankle injury Colorado Avalanche Mikko Rantanen went down in the second period of the team's game against the St. Louis Blues with what appeared to be an ankle or knee injury.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6339", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bruce Cassidy Hopeful Connor Clifton Will Get Assertiveness 'Back In His Game' https://www.dailymotion.com/embed/video/x nm ty Zdeno Chara has played alongside Charlie McAvoy on the blueline for a while now. But that is going to change come Friday night when the Boston Bruins", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17525", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Gameday Thread: Stars at Jets Can Dallas win its fifth straight game? I just knocked on wood, did you? It's an early one, folks!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45147", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jaromir Jagr, who is almost 50 years old, is an absolute UNIT, should come back to the NHL as an enforcer The NHL legend posted a picture of himself shirtless, and he looks like he's in the best shape of his life at 47 years old.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N46792", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Connor Murphy had late nights out while the Blackhawks were on the road. But he wasn't eating chicken wings   he was rehabbing at the team's practice facility. When the Blackhawks went on a recent West Coast swing, Connor Murphy stayed in Chicago rehabbing an injured groin. Just like every fan in the Central time zone, Murphy had to decide where to watch games that would end around midnight. If you're thinking Murphy would head to a local establishment for some chicken wings or hole up in the comforts of his own home, guess again. \"I would go to the ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57596", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Staal Undergoes Surgical Procedure On Infected Ankle The veteran d-man will be off the ice for at least half a month", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43921", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Devils Complete Tailspin to Start the Season Despite Successful Offseason is Laughable Devils fans had a lot of hope during the summer of 2019, but their team has done a pretty good job of suffocating it. Since New Jersey took a 4-0 lead on a Stanley Cup contender in the Winnipeg Jets on opening night, pretty much everything has been downhill. Subban: \"Everybody can look at the coaching staff, they're doing their job. As players, we have to do a better job.\" pic.twitter.com/BFmUwcBeZE   New Jersey Devils (@NJDevils) October 14,...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N54784", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Anthony Mantha's goal late gives Detroit Red Wings a 3-2 win over Vegas, and a win streak Anthony Mantha's goal with 30 seconds left on Sunday vs. Vegas gives the Detroit Red Wings a winning streak.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17824", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Canucks recall former first-round pick Sven Baertschi The 27-year-old Baertschi has been riddled with injuries the last several years but always produced at a high level whenever in the lineup for the Canucks.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N38596", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Game thread: Red Wings plowed by Predators, 6-1 Skidding Detroit Red Wings host Nashville Predators, the team they defeated 5-3 to open the season", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20991", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'The Russian Five': NBC Sports will show documentary after Wednesday's Red Wings game The world will get another chance to remember, and perhaps learn even more, about one of the great periods of Detroit Red Wings hockey.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47730", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Arizona Coyotes pursuing coveted KHL star Alexander Barabanov It was reported last month that there were several NHL executives set to scout KHL forward Alexander Barabanov in person, and now Elliotte Friedman of Sportsnet has identified one of them.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21047", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Detroit Red Wings executive Jimmy Devellano to undergo brain surgery Detroit Red Wings longtime member Jimmy Devellano will undergo surgery for a non-cancerous brain tumor Monday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40770", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bruins' Bruce Cassidy Addresses Don Cherry's Comments, Sportsnet Firing https://www.dailymotion.com/embed/video/x nwyxv Bruce Cassidy has had his say on one of hockey's hottest issues of the moment. The Boston Bruins coach addressed Don Cherry's firing from Sportsnet Tuesday telling reporters", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10420", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Malkin, Penguins ready to roll vs. Rangers The Pittsburgh Penguins are starting to get rolling and so is Evgeni Malkin. Their next attempt at keeping the surge going will be without Sidney Crosby.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13674", "method": "POST", "url": "/v1/embeddings", "body": {"input": "How to fix the NHL's offside challenge craziness Please spare us the millimeters.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27999", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Coyotes sign GM John Chayka to a multi-year extension The Arizona Coyotes are obviously pleased with the work that general manager John Chayka has done over the last several years.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63902", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Buzzer: Avalanche of goals; Vintage Lundqvist Babcock reaches 700, Isles' run ends at 10, and more from Thursday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18207", "method": "POST", "url": "/v1/embeddings", "body": {"input": "How to watch, listen and stream Detroit Red Wings at Los Angeles Kings The Red Wings are on a three-game winning streak after beating Anaheim 4-3 in overtime on Tuesday night. Now, Detroit continues it's West Coast swing with a game against the Los Angeles Kings at the Staples Center. Los Angeles is coming off a win of its own and looks to carry that momentum forward. The Red Wings (7-12-1) and Kings (6-11-1) face-off at 10:30 p.m. on Thursday, Nov. 13. Related: ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61300", "method": "POST", "url": "/v1/embeddings", "body": {"input": "How Blues have kept winning without Tarasenko They are winning but there are some real concerns.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7383", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Wednesday Links: Montgomery Apologizes for Benn, Seguin Criticism Plus, Corey Perry is set to play his 1000th game as the Stars take on the Flames, an open letter to Sergei Zubov, and more.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61202", "method": "POST", "url": "/v1/embeddings", "body": {"input": "David Pastrnak's Point Streak Ends At 13 Games After NHL Scoring Change https://www.dailymotion.com/embed/video/x nsrai As if suffering their worst lost of the season wasn't bad enough the Boston Bruins were dealt some insult to injury Saturday morning. In the second period of", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N28367", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Roy scores first career NHL goal, Vegas tops Anaheim 5-2 LAS VEGAS (AP)   Nicolas Roy was a six-year-old when Marc-Andre Fleury made his NHL debut. The two are teammates now, and on Sunday night Roy scored his first career NHL goal and Fleury made 13 saves, leading the Vegas Golden Knights to a 5-2 win over the Anaheim Ducks. Roy, making his first appearance as a member of the Golden Knights, showed off his blazing speed when he split two Anaheim defenders and slipped a shot through Ducks goaltender...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57419", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Skate Podcast: Talking Bruins collapse, Tuukka Rask with TSN's Jamie McLennan Without a game for three days after the Bruins threw away a four-goal lead in the third period of a home loss to the Florida Panthers on Tuesday, there was plenty of time to unpack what happened. Tuukka Rask put a lot of the blame on himself, and his play of late had been lackluster heading into the game against the Panthers. On this week's episode of The Skate Podcast we talked to TSN analyst and co-host of OverDrive on TSN 1050 radio Jamie...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8764", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Flyers remain one of NHL's biggest mysteries The process has been strong, but the results have been unlucky and inconsistent.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51256", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Senators score two goals in just four seconds (Video) Namestnikov and Pageau beat Hurricanes' Reimer with rapid tallies.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11338", "method": "POST", "url": "/v1/embeddings", "body": {"input": "VIDEO: Jack Hughes Gets Destroyed by Matt Niskanen in Classic Welcome to NHL Moment Hey rookie, welcome to the NHL. It's been an adequate first month in the NHL for No. 1 overall pick Jack Hughes, as we've seen some glimpses of brilliance. On Friday night, he received another reminder that despite his other-worldly talent, he must always keep his eyes up on the ice. Veteran d-man Matt Niskanen delivered this lesson in a painful manner. Matt Niskanen lays out Jack Hughes and Kyle Palmieri comes to his defense...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63027", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Devan Dubnyk starts, Marcus Foligno out for Wild vs. Coyotes GLENDALE, Ariz.   Winger Marcus Foligno won't play in the Wild's third test on its four-game road trip Saturday against the Coyotes at Gila River Arena. Foligno is out with a lower-body injury. Victor Rask will draw in amid Foligno's absence, centering the fourth line. Without Foligno, the Wild will unite wingers Jordan Greenway and Luke Kunin with center Joel Eriksson Ek. \"I'm really excited ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47425", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Why Flyers fans have reason for optimism There is reason to believe this team might actually be able to be something more than mediocre.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39738", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The confluence of culture, politics and hockey The NHL is as flawed and blinkered as any other professional sports league, but it is doing something right here. It allows its players, their families, and their fans to tell their stories, and those stories have an impact.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32002", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NHL Power Rankings: The quiet dominance of the Capitals The Capitals might still be the best team in the NHL and it seems like they're not getting any attention for it.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47608", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Space Needle time capsule includes NHL Seattle's final five name choices The time capsule will not be opened until 2062.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57791", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Skidding Coyotes visit rolling Capitals The Washington Capitals are one of the hottest teams in the National Hockey League. They have won six in a row and gone 10-0-1 in their last 11 games and will try to continue that streak when the Arizona Coyotes visit on Monday night.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Even David Pastrnak's slumps are superstar caliber for Bruins Guess David Pastrnak isn't going to score 82 goals and accumulate 164 points this season. Or at least he's not on pace to do anymore. After scoring 15 goals and adding 15 assists through the Bruins' first 15 games, Pastrnak had gone two games without a point after he was blanked in Boston's 3-2 shootout loss to Philadelphia at TD Garden on Sunday. Oh the humanity! But here's where things stand in the 23-year-old sniper's career. Gone are the...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8724", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Monday Morning Fly By: Could everyone please stop falling? Today's open discussion thread, complete with your daily dose of Flyers news and notes…", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18633", "method": "POST", "url": "/v1/embeddings", "body": {"input": "MacKinnon leads Avalanche to 4-0 win at Winnipeg WINNIPEG, Manitoba (AP) Adam Werner had no time to think about his hockey dream coming true.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14323", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Are the Lightning better than when they left for Sweden? TAMPA   Not only did the Lightning return home from Sweden with two wins, but also some serious feel-good vibes that the trip galvanized the team both on the ice and off it. After a sluggish start to the season, Tampa Bay played two of its best all-around games on consecutive nights in Stockholm. They received contributions across all four scoring lines, and saw improved special teams play in ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14672", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Quick Strikes: Tampa Bay Lightning welcome Congressional Medal of Honor recipients And the Pittsburgh Penguins, of course.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4890", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Avs' Rantanen leaves game with ugly-looking foot injury Rantanen has 12 points in eight games for the Avalanche.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8904", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Free Fight! Diaz Makes Triumphant Return Against Pettis Before Nate Diaz faces Jorge Masvidal this Saturday night (Nov. 2, 2019) at UFC 244 for the \"BMF\" title, take a look back at Nate's comeback fight against Anthony Pettis at UFC 241 a few short months ago.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40856", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cage Warriors announce three Irish dates for 2020 Following a sold out show in Cork last weekend, Cage Warriors have announced three more Irish dates for 2020.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1866", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nate Diaz says he isn't retired: 'I'll fight tonight' Nate Diaz says he isn't retired.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N3288", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Reyes calls out Jon Jones following KO win over Chris Weidman Hey Jon [Jones], I don't want any party favors. I want that belt, baby, let's go.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48119", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What Happened At UFC 244 Last Night?!? UFC 244 results: \"Diaz vs. Masvidal\" brought the world's premier MMA organization to Madison Square Garden in New York City, New York, last night (Sat., Nov. 2, 2019). Let's break down the most important results and best techniques!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55119", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Leandro Higo wants to welcome Sergio Pettis to Bellator Former Bellator title contender Leandro Higo wants to be the one to meet Sergio Pettis in his promotional debut.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23617", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nate Diaz paid back fan who lost a bet on his UFC 244 fight against Jorge Masvidal Diaz made good on the social media promise", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43765", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Report: Sanchez no longer with the UFC, wants Lethwei fight According to Lethwei fighter Dave Leduc, TUF 1 alum is no longer with the UFC and is now seeking opportunities under WLC.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40226", "method": "POST", "url": "/v1/embeddings", "body": {"input": "UFC on ESPN 6 results: Yair Rodriguez decisions Jeremy Stephens in 3-round thriller What a fight and gutsy win by Yair Rodriguez.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N16373", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Three takeaways from UFC 244 prelims Edmen Shahbazyan is the real deal, Corey Anderson deserves your respect and Lyman Good is … well … good.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1607", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'Bigfoot' Silva happy to do what he 'loves most' ahead of Bare Knuckle debut Antonio Silva looks forward to his Bare Knuckle FC debut against fellow veteran Gabriel Gonzaga.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34104", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Alexander Volkov has 'unfinished business' with Junior dos Santos and Alistair Overeem Following a unanimous decision win over Greg Hardy in the UFC Moscow co-main event, Alexander Volkov has a couple of heavyweights in mind for his next fight.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55554", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Midnight Mania! Khabib: '95% Chance' Ferguson Is Next Bringing you the weird and wild from the world of MMA each and every weeknight!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27251", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jorge Masvidal says he's 'dead serious' about wanting to box against Canelo Alvarez The BMF champ thinks he has a legitimate chance to knock out Canelo in a boxing fight", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42651", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Usman not sold on Masvidal hype but would be 'very interested' in a fight He's the same guy. He's fought the same way forever. It's just the luck of the draw. He's getting that luck of the draw.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53499", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Royce: 'It's hard to compare' eras; can fighters today fight in 1993? Royce Gracie spoke with BloodyElbow.com ahead of Bellator 234 about everything but: Kazushi Sakuraba and catch-wrestling, Judo and Jiu-Jitsu on the mat, the cage and out on the streets, on his favorite fighters and on why he doesn't watch ADCC", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55690", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dooho Choi set to return vs. Charles Jourdain at UFC on ESPN+ 23 in South Korea Dooho Choi vs. Charles Jourdain and Ji Yeon Kim vs. Sabina Mazo are the latest additions to the UFC on ESPN+ 23 card in South Korea.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6079", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Khabib slams McGregor in Twitter exchange Khabib Nurmagomedov engages in a brief Twitter exchange with Conor McGregor.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51999", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Interview: Chael Sonnen recalls fighting GSP 'in a basement' back in 2014 The recently retired UFC and Bellator contender Chael Sonnen sat down with BloodyElbow.com to discuss his toughest opponents (GSP?!), recent allegations regarding Conor McGregor, Jiu-Jitsu & wrestling, missiles, and USADA.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58423", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tyson Fury teased a potential MMA debut and Conor McGregor wants to train him Tyson Fury is a man of many talents, but a switch to MMA would be quite a change of pace for the heavyweight.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27631", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Alvarez stops Kovalev in 11th round to win 175-pound title LAS VEGAS (AP) Canelo Alvarez used a big punch to beat a big fighter.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26638", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ngannou to Volkov after UFC Moscow: Don't turn this down again Former UFC heavyweight title challenger Francis Ngannou wants Alexander Volkov next.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59065", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Marine veteran gets a grand entrance on 'his' weekend, then backs it up in ring to defend belt Defending his WBO super featherweight world title on Veterans Day weekend was special for Marine veteran Jamel Herring. He was escorted to the ring Saturday night at Chukchansi Park with two Humvees and 300 Marines to the delight of the 7,412 fans in attendance.. Talk about a grand entrance for the 34-year-old Herring, who served nine years in the Marines, with two tours in Iraq. He ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49617", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jose 'Shorty' Torres opens up about father's death, difficult time that ultimately forced him out of Brave 29 Jose \"Shorty\" Torres was forced to pull out of his flyweight title fight at BRAVE 29 after his body shut down during weight cutting while he was still grieving the loss of his father.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40979", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Later, Bader! 'Darth' Abandons Quest For RIZIN Belt Bellator MMA two-division champion, Ryan Bader, is no longer gunning for the RIZIN FF 205-pound title and will instead make his stateside return in February.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48503", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The UFC's 13 most dominant first-time title-winning performances From Anderson Silva to Jon Jones, to Conor McGregor to Cain Velasquez, check out 13 of the most dominant title-winning performances in UFC history.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23029", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Conor McGregor Next Fight Candidates After Press Conference Teasing Return to UFC Conor McGregor's return to mixed martial arts, at long last, is close at hand. The Notorious MMA hasn't hit the the Octagon since his loss (and the outrageous post-fight melee) at UFC 229, but at a McGregor press conference Wednesday in Ukraine, the former two-division champion teased his next big move. Conor McGregor: Announcement on next bout coming soon https://t.co/z7oRSpOel7   Marc Raimondi (@marc_raimondi) October 23, 2019 McGregor has...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N215", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Dana White 'looking' at Conor McGregor vs. 'Cowboy' Cerrone, but not a done deal yet UFC president Dana White confirms the promotion would like to book Conor McGregor against Donald \"Cowboy\" Cerrone in January but the fight isn't yet a done deal yet.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45460", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Daniel Cormier responds to Stipe Miocic wanting Tyson Fury fight CLEVELAND, Ohio   In September, UFC president Dana White revealed plans for a trilogy fight between current heavyweight champion Stipe Miocic and Daniel Cormier. But if it's up to Miocic, that may no longer be the case. Miocic appeared on Ariel Helwani's MMA Show this week to talk about a potential superfight with boxing champ Tyson Fury. That apparently interests Miocic more than another ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39253", "method": "POST", "url": "/v1/embeddings", "body": {"input": "UFC champion Jon Jones pleaded 'no contest' after being accused of assaulting a woman at a New Mexico strip club Jon Jones was handed a 90-day deferred sentence during which he must avoid arrest, consume no alcohol or drugs, and make no contact with the accuser.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23960", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nate Diaz: 'I've Been The Best For A Long Time' Nate Diaz has always been the best, but he's now figured out how to put everyone else up on game.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49266", "method": "POST", "url": "/v1/embeddings", "body": {"input": "UFC Boston highlights: Rodriguez hangs on to take decision Stephens Check out the full-fight video highlights of Yair Rodriguez vs. Jeremy Stephens from the UFC Boston co-main event.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57293", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kron Gracie disagrees with UFC Tampa decision loss to Cub Swanson: 'I won that fight' Kron Gracie feels he did enough to beat Cub Swanson on Saturday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52239", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Francimar Barroso plans to use PFL prize to help hometown kids become MMA fighters A million-dollar check would change the lives of PFL fighter Francimar Barroso and dozens of kids in Brazil.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39472", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Video: Veronica Macedo says she's still fighting at UFC Busan five weeks after UFC Sao Paulo Veronica Macedo agreed to face Ariane Lipski on short notice in Sao Paulo, but she says she hasn't pulled out of UFC Busan.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22696", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Free Fight! Blachowicz Flatlines Rockhold In Vegas Jan Blachowicz vs. Luke Rockhold full fight video from the UFC 239 event in Las Vegas, with Blachowicz winning by way of thunderous knockout.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51083", "method": "POST", "url": "/v1/embeddings", "body": {"input": "UFC Tampa's Biggest Winners, Losers UFC Fight Night 161 results: Let's take a look at the biggest winners   and losers   from last night's (Sat., Oct. 12, 2019) ESPN+ event in Tampa, Florida.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12311", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bellator 231 post-event facts: Roy Nelson hits career-long losing skid Check out all the facts and figures from Bellator 231, which took place Friday in Uncasville, Conn., and saw Frank Mir beat Roy Nelson.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33989", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Legal Argument Against Greg Hardy's 'Inhalergate' No Contest Greg Hardy may have a way to save that win from UFC Boston should he decide to fight the commission's No Contest ruling.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25951", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Zabit reveals infection; says he 'fully' deserves UFC title shot Zabit Magomedsharipov feels he deserves to fight the winner of the Max Holloway-Alex Volkanovski at UFC 245.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20162", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Luke Rockhold to test grappling skills vs. Nick Rodriguez at Polaris 12 Former UFC champion Luke Rockhold is taking his skills to the mats on Nov. 30 in Wales.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50387", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Diaz believes Masvidal was on the verge of giving up at UFC 244 Nate Diaz shares the moment he believes Jorge Masvidal gave up at UFC 244.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N46837", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chan Sung Jung thinks he's a better grappler than Brian Ortega heading into UFC on ESPN+ 23 Chan Sung Jung disagrees that jiu-jitsu is his weakness and actually thinks he's a better grappler than Brian Ortega.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N26605", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Mighty Usman Unimpressed By 'Luck' Of Masvidal The feeling is mutual.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44911", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Wanderlei Silva's son set to make amateur Muay Thai debut in Brazil: 'I want to be like my father' The son of legendary PRIDE superstar Wanderlei Silva will step into a Muay Thai ring in Brazil in December.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51993", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jericho thinks people complaining about Marko Stunt are hilarious 'Over is over'.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36430", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jan Blachowicz predicts second-round knockout over Jacare Souza at UFC on ESPN+ 22 Jan Blachowicz predicts second0round knockout over Jacare Souza at UFC Sao Paulo, and hopes a win earns him a title shot this time.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24900", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bare Knuckle Knockout! Watch Gabriel Gonzaga Whup Bigfoot Silva In Tampa Bare Knuckle FC returned on Saturday night for their eighth show in two years, this one featuring a heavyweight showdown between UFC veterans in Tampa, Florida. Gabriel Gonzaga and Antonio Silva were both looking to prove they still had a little something left in the gas tank to give. In the end it was Gonzaga who got his hand raised after pummeling Silva and KO'ing him 1:50 into the second round. Here's highlight video of the final moments of...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64023", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Latest UFC 245 Fight Card, PPV Line Up UFC will close out 2019 with a bang, giving MMA fans a championship tripleheader that features title fights at welterweight, featherweight, and women's bantamweight. Now we just need to keep our fingers crossed and hope the injury bug doesn't rear its ugly head!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35896", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Walker on quick KOs: 'I want to fight, but I hit them and they fall' Light heavyweight prospect Johnny Walker wants a chance to show more of his skills in the Octagon.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45835", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Column: Griffin values free golf lesson from a caring pro Steve Prater can recall only one time in more than 30 years as a PGA professional that he refused payment for a golf lesson.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24689", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ian Poulter posts incredible video of flooded Japan golf course hosting PGA Tour A ridiculous amount of rain hit Japan on Friday, pushing back the second round of the PGA Tour's Zozo Championship.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25835", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tiger Woods claims historic 82nd title with Zozo Championship victory Woods closed out an historic victory as he moved level with Sam Snead on the all-time PGA Tour list.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9922", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Swing Sequence: Joaquin Niemann The first person from Chile to win on the PGA Tour", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62768", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Australian Minjee Lee takes 1-stroke lead at LPGA tournament Minjee Lee overcame changing weather conditions at the Buick Ladies Championship to take a one-stroke lead with a bogey-free 6-under 66 after the first round of the LPGA tournament in South Korea.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55549", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Watch Tiger Woods put on a traj clinic while you wait for the Zozo Championship to resume Tiger Woods drew literal oohs and aahs from mesmerized Japanese golf fans during the PGA Tour's inaugural Zozo Championship.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N45267", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Column: Postseason golf about entertainment, not about fair Scott McCarron has been in position for a $1 million payoff twice in his career under vastly different circumstances.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27178", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kim's suspension reduced from three years to one after obscene gesture The Korea Professional Golfers' Association announced Wednesday that Bio Kim's suspension was reduced from three years to one.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61527", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Affidavit: New Port Richey woman sets tent on fire while man sleeps inside A 49-year-old woman is accused of intentionally setting a man's tent on fire while he slept inside early Tuesday morning. According to a Pasco County Sheriff's affidavit, Kellie Ann Barrett managed to start the front door of the tent on fire before the man woke up and poured water he had in the tent on the flames. The man then grabbed Barrett's phone, according to the report, and called 911. While he was attempting to talk to dispatch, Barrett...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25202", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rory McIlroy says he's 'good' with Brooks Koepka after rivalry comments, takes playful shot at himself If Rory was upset over Koepka's rivalry comments, he did a nice job of hiding his anger when asked about them during The Challenge: Japan Skins", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21850", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Colsaerts wins French Open to end seven-year title drought Nicolas Colsaerts held on to seal a gripping one-shot victory over Denmark's Joachim B Hansen at the French Open, claiming his first European Tour title for seven years on Sunday at Le Golf National. The big-hitting Belgian led by three strokes overnight but made several errors as South African George Coetzee and Hansen both moved ahead briefly on the back nine. But Colsaerts recovered and kept his nerve on the final three holes to card a...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N14551", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Analyze every swing like the pros with the LiveView Pro hands-free camera Golf instructors have relied on video and full-length mirrors to teach the full swing for decades. The LiveView Pro is a sophisticated answer", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25719", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Ybor City's Ghost Tour shows the scarier side of Tampa's history With Halloween just around the corner, do you want to see something really scary? Well, You don't have to look far in Tampa. After all, real-life history can be more unnerving than any frightening folk-tale. It stands to reason that a city known for its skull and crossbones is bound to have a scarier side. Which might explain why visitors and locals alike seem to gravitate toward Tampa's Ybor City Ghost Tour. \"I believe it,\" said Jill Davidson,...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50992", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Woods shoots 64 and tied for lead in Japan INZAI CITY, Japan (AP)   Tiger Woods was in strong early-season form after a slow start with a 6-under 64 and was tied for the first-round lead at the Zozo Championship, the PGA Tour's first tournament in Japan. Woods was tied with Gary Woodland, with local favorite Hideki Matsuyama one stroke behind. Teeing off the from the 10th hole, Woods got off to a shaky start on Thursday with three straight bogeys at the par-70 Accordia Golf Narashino...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56267", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rain pushes PGA Tour Champions' final round to Monday RICHMOND, Va. (AP) Heavy rain forecast to last throughout the day forced the postponement of the third round of the PGA Tour Champions event on Sunday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8147", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tiger Woods' win 'certainly got' Presidents Cup captain Tiger Woods' attention Following victory at the Zozo Championship, Tiger Woods suggested he is ready to play and captain at the Presidents Cup.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21323", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rory McIlroy randomly daggers U.S. Ryder Cup team with funny (and painfully accurate) jab The four-time major winner was asked why the U.S. team excels in the Presidents Cup but struggles in the Ryder Cup, and he had the perfect response.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42741", "method": "POST", "url": "/v1/embeddings", "body": {"input": "9 notable golfers who advanced to the finals of Korn Ferry Tour Qualifying school (and 5 who didn't) Those lucky enough to get past the second stage of Qualifying School know they will be one-stop removed from the PGA Tour in 2020", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39077", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Watch: Oosthuizen makes hole-in-one in first round at WGC-HSBC Louis Oosthuizen's first round at the WGC-HSBC Champions went from pretty good to pretty great with one swing at Sheshan International Golf Club.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N40882", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hatton takes six-man playoff under the lights in Turkey Tyrrell Hatton won $2 million in a wild six-man playoff at the Turkish Airlines Open that finished under the lights.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11180", "method": "POST", "url": "/v1/embeddings", "body": {"input": "PGA suspends Matt Every 12 weeks for drug-policy violation; golfer says he has cannabis prescription Every said in a statement he has a prescription for cannabis to treat a mental-health condition.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23343", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Crash with injuries shuts down parts of I-75 near Sarasota A portion of I-75 was completely blocked Wednesday afternoon because of a serious crash in Sarasota County. Sarasota deputies said all the southbound lanes of I-75 were closed at Laurel Road in Venice. Exit 195 at Laurel Road, however, stayed open and cars were diverted off the interstate. Deputies said the crash involved two cars and had a trauma alert. Anyone planning to travel through the area is urged by deputies to find an alternate route....", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48861", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Watch: Maggert wins Champions finale with walk-off eagle holeout Jeff Maggert ended the Champions Tour finale in thrilling fashion Sunday, holing a walk-off eagle from 123 yards on the par-4 17th hole and returning to the winner's circle for the first time in four years.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6661", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'Armed and dangerous' man wanted in Polk County double homicide The search is on for a man wanted for murder in Tennessee and for a double homicide in Polk County. Stanley Eric Mossburg, 35, who also goes by the nickname \"Woo Woo,\" last was seen driving a stolen 2013 black Hyundai Tuscon with Florida tag D5BPK, according to the Polk County Sheriff's Office. The car last was seen in the area of 17th Street NE and Dundee Road. Mossburg is considered armed and dangerous. Anyone who sees him is asked to call...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64498", "method": "POST", "url": "/v1/embeddings", "body": {"input": "PGA Tour winners A gallery of recent winners on the PGA Tour.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24995", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Unusual playoff means Tyrrell Hatton made $1.5 million more in prize money than the fivesome that finished second Because five players split the runner-up prize money at the Turkish Airlines Open, their checks were $430,589.98 compared to winner Tyrrell Hatton's $2 million", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61583", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Thammaraks vaults into lead at LPGA Q-School with third consecutive 68 Thailand's Prima Thammaraks shot her third consecutive 68 to take the lead going into the final round of the second stage of LPGA Q-School in Venice, Fla.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5177", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The 5 essential qualities of every good captain's pick As Tiger Woods and Ernie Els give final consideration to their Presidents Cup captain's picks, here are some player characteristics they should be searching for", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61106", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Here's the prize money payout for each golfer at the 2019 Houston Open The overall purse at the Golf Club of Houston was $7.5 million with winner Lanto Griffin taking home $1.35 million for his victory", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8503", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The best golf training aids to help your game this fall In a universe of hundreds of devices promising better golf, these are the best golf training aids we found to help your game", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10832", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Choi (and his unique swing) win again on Japan Tour Hosung Choi is back in the winner's circle in Japan, where his unique swing guided him to a two-shot victory.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18246", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tiger Woods isn't (quite) a lock to pick himself for the Presidents Cup, according to latest odds In the latest round of Tiger Woods prop bets, the Presidents Cup captain isn't as much of a favorite to make the team as you'd think.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N46089", "method": "POST", "url": "/v1/embeddings", "body": {"input": "PGA Tour hopes to 'never leave Japan' INZAI CITY, Japan (AP) Joining forces with a celebrity tycoon who dreams of going to the moon, the PGA Tour is committed to being in Japan for the long haul with its first tournament starting Thursday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N847", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tiger Woods' caddie Joe LaCava opens up on Presidents Cup selections Tiger Woods' caddie Joe LaCava said he's happy his boss is waiting until the last minute to make his four Presidents Cup captain picks.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6249", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Giving advice on the golf course? You won't see it 'thousands of times' The latest Rules of Golf incident isn't going away any time soon it appears.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11374", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Korda's caddie helps player to victory over his fiancée Nelly Korda won a playoff Sunday in Taiwan, beating Caroline Masson, who also happens to be the fiancee of Korda's caddie.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4931", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Short-Game Saver: Master the straight-arm chip to gain control around the green Here's a tour pro tip for hitting one of the most useful shots around the green: The straight-arm chip", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21468", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Oosthuizen defies kidney stone to take three-shot Nedbank lead South Africa's Louis Oosthuizen defied pain from a kidney stone and shot a record-equalling nine-under-par 63 in the first round of the Nedbank Golf Challenge at the Gary Player Country Club on Thursday. Oosthuizen opened a three-shot lead over Belgium's Thomas Detry with a flawless round, which included nine birdies. Guido Migliozzi of Italy was lying third on 67, with three other players, including defending champion Lee Westwood and veteran...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41705", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Missing Manatee County man found Update: Nathan Thomas Lammi has been found. Previous: The Manatee County Sheriff's Office needs help finding a missing man they say could harm himself. Deputies said Nathan Thomas Lammi was last seen by his wife at around 9 p.m. Friday at their home in Lakewood Ranch. Lammi was last seen in a red parrot shirt and blue shorts. Investigators said he is dealing with some personal issues and has made indications he might want to harm himself. Anyone...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8385", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Everything you need to know about \"The Challenge: Japan Skins\" Tiger Woods, Rory McIlroy, Jason Day and Hideki Matsuyama will go head-to-head in GOLFTV's \"The Challenge: Japan Skins.\"", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56871", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Korn Ferry national qualifier field set at Orange County National The Korn Ferry Tour National Qualifying Tournament field has been set with 114 players coming out of five second-stage qualifiers last week and this week. They advanced to Orange County National's Cat Crooked Cat and Panthers Lake Courses in Winter Garden Dec. 12-15 to determine eligibility onto the 2020 Korn Ferry Tour. Here's how the finish at OCN will decide the pecking order:   The ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44827", "method": "POST", "url": "/v1/embeddings", "body": {"input": "No. 82 is significant, but for Tiger Woods its significance is defined by consistency and perseverance Tiger Woods' 82nd PGA Tour win tied Sam Snead's record, but more than a number, it represents a combination of consistency and perseverance", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57162", "method": "POST", "url": "/v1/embeddings", "body": {"input": "No spectators allowed for 2nd round of Zozo Championship Organizers of the PGA Tour's first tournament in Japan have taken the unusual step of closing the course to spectators for Saturday's second round and extending the tournament until Monday because of torrential rainfall and flooding in the area.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34050", "method": "POST", "url": "/v1/embeddings", "body": {"input": "PGA Tour should consider marijuana for its use, not as 'drug of abuse' When it comes to marijuana use, the PGA Tour follows WADA's lead. But the Tour should take a cue from the NBA and NFL when it comes to the drug's use.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17459", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Here is everything that happened at 'MGM Resorts The Challenge: Japan Skins' while you were sleeping From Jason Day's win to the one-club challenge to a dangerous celebration, here's everything you missed from 'The Challenge'", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59785", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hatton wins in Turkey after record-equaling 6-man playoff ANTALYA, Turkey (AP) England's Tyrrell Hatton won the Turkish Airlines Open on Sunday after a record-equaling six-man playoff that finished under floodlights.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18725", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Joe Namath still calls the shots Fifty years after winning the Super Bowl, Broadway Joe on making seven aces, why a $2 nassau still means something, and how the game got the better of Bear Bryant.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62733", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tiger Woods spotted practicing with a unique-looking putter before Skins Game on Sunday No, Tiger Woods isn't switching putters just yet. But he was spotted tinkering with a unique-looking putter at \"The Challenge: Japan Skins\"", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37450", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Woodland boosts Presidents Cup stock with T-3 finish at CJ Cup Gary Woodland improved his President's Cup prospects with a T-3 finish at the CJ Cup.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36691", "method": "POST", "url": "/v1/embeddings", "body": {"input": "This week in golf (Oct. 21-27): Tee times, TV schedule, info Here's a look at what's happening in professional golf this week, and how you can watch it.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N6970", "method": "POST", "url": "/v1/embeddings", "body": {"input": "All of Martin Truex Jr.'s Monster Energy NASCAR Cup Series wins See all of Martin Truex Jr.'s wins in the sport's top series -- from the first at Dover International Speedway to the most recent at Martinsville Speedway.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59727", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kevin Harvick to surpass an Earnhardt milestone at Talladega Kevin Harvick's NASCAR career doesn't appear to be ending anytime soon but it will reach an interesting milestone on Sunday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22498", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Brendan Marks: After two wins in four races, is Kevin Harvick truly a NASCAR championship contender? What a wild, weird NASCAR season this has been for Kevin Harvick. Really, you can't talk about this year without acknowledging what he did last season. Harvick tied for a Cup Series-high eight victories in 2018 and advanced all the way to the championship race, coming up short behind Joey Logano. Still, he more than earned his place in the sport's \"Big 3\" alongside Martin Truex Jr. and Kyle ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10696", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Logano can't defend NASCAR title after mystery slide AVONDALE, Ariz. (AP) Joey Logano's promising start to the afternoon fell apart with a slow, helpless slide though the field at ISM Raceway. Now he won't have the opportunity to defend his NASCAR title at Homestead.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64400", "method": "POST", "url": "/v1/embeddings", "body": {"input": "ISM Raceway's restart zone will be key to NASCAR semifinal race, looking ahead to 2020 championship The start of Sunday's 312-lap race at ISM Raceway, and subsequent restarts, likely will be the opportunity for drivers to make passes.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56754", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Pole sitter Verstappen summoned to stewards for ignoring yellow flags Max Verstappen was summoned to see the stewards at the Mexican Grand Prix on Saturday after telling a news conference that he had ignored yellow flags following Valtteri Bottas's high speed crash in qualifying. The Dutchman had claimed the second pole position of his career for Red Bull with a record lap in the final seconds of the session when the flags, indicating drivers should slow down, were waved. Other drivers on flying laps, including...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29793", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Penalty report from Texas Motor Speedway NASCAR fined three Cup Series crew chiefs for unsecured lug nuts at Texas Motor Speedway.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52504", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NASCAR's Saturday schedule at ISM Raceway Cup qualifying is scheduled for 2 p.m. ET on NBCSN, followed by the Xfinity playoff race at 3:30 p.m. ET on NBC.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59860", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Winners and losers at Kansas Speedway Denny Hamlin's win capped a big weekend for Joe Gibbs Racing.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47358", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rain pushes Monster Energy Series race at Talladega to Monday finish TALLADEGA, Ala.   Sunday's Monster Energy NASCAR Cup Series event has been halted by rain at Talladega Superspeedway. The race is set to resume Monday at 2 p.m. ET (NBCSN/NBC Sports App, MRN, SiriusXM NASCAR Radio). Stage 1 winner William Byron was scored as the leader when the 1000Bulbs.com 500 was stopped with 57 of […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8215", "method": "POST", "url": "/v1/embeddings", "body": {"input": "2 NASCAR teams in traffic incidents on way to Kansas CHARLOTTE, N.C. (AP)   Two NASCAR teams on their way to Kansas Speedway were involved in separate traffic incidents that damaged race cars. JTG Daugherty Racing owner Tad Geschickter said Thursday the team transporter for Ryan Preece's No. 47 Cup Series entry caught fire while traveling to Kansas. He said both drivers are fine and the team is \"assessing the damage of our trailer and race cars.\" The location of the incident was not immediately...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20509", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chase Elliott suffers broken axle during pit stop at Martinsville Chase Elliott and the No. 9 team were forced to make repairs in the garage after suffering an apparent broken axle in the NASCAR Playoffs race at Martinsville Speedway.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N16963", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NASCAR: 2019 Cup Series race winners Every winner from every points race from the Daytona 500 to Homestead.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58291", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Kyle Larson injured ribs in 'probably the hardest hit I've ever had' The No. 42 Chevrolet driver will run the full distance at Kansas Speedway; doesn't think he broke his ribs in crash.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41371", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Indianapolis Motor Speedway, IndyCar are being sold to Penske Corp. Hulman & Co. is selling the Motor Speedway, IndyCar and related businesses to Penske Corp.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18585", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Massa: Leclerc could win first title before Verstappen Former Formula 1 driver Felipe Massa says he would not rule out Charles Leclerc winning the drivers' championship before Max Verstappen.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52969", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Christopher Bell tames Texas, clinches Xfinity Series title shot Christopher Bell rolled to victory in Saturday night's NASCAR Xfinity Series race at Texas Motor Speedway, clinching an automatic berth in the Championship 4 field that will battle it out for the series title in two weeks. Bell led a race-high 101 of the 200 laps in Saturday's O'Reilly Auto Parts 300. His Joe Gibbs […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50550", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hill disappointed after elimination: 'We didn't perform tonight' Austin Hill didn't perform the way he'd hoped and was eliminated from the Gander Outdoors Truck Series Playoffs at ISM Raceway.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53370", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chase Elliott won't dwell on Round of 8 turmoil, sharpens focus on Phoenix Truth be told, Chase Elliott says he was already over a tough playoff race at Texas Motor Speedway and looking ahead to this week's Bluegreen Vacations 500 at Phoenix's ISM Raceway (2:30 p.m. ET on NBC, MRN and SiriusXM NASCAR Radio) by the time the checkered flag flew on the Texas high banks last Sunday. […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N65225", "method": "POST", "url": "/v1/embeddings", "body": {"input": "What channel is NASCAR on today? Time, TV schedule for Kansas race Sunday's NASCAR race returns to NBC as the TV channel, and the start time for the race at Kansas is 2:30 p.m. ET. Here is how to watch today's NASCAR race at Kansas.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29997", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Starting Grid: Ryan Blaney or Kyle Larson for clutch Phoenix win? NASCAR.com's Chase Wilhelm previews the Monster Energy NASCAR Cup Series Playoffs Round of 8 elimination race at ISM Raceway.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N59206", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NASCAR, Dixie Vodka announce multi-year partnership DAYTONA BEACH, Fla. (Nov. 13, 2019)   NASCAR and Dixie Vodka announced today a multi-year official partnership, designating the American-made craft spirit brand as the \"Official Vodka of NASCAR.\" Central to the agreement, Dixie Vodka will sponsor the NASCAR Cup Series race at Homestead-Miami Speedway next season, commemorating the track's 25th anniversary. Launched in 2014 […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64242", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Controversy follows NASCAR to Phoenix after Bubba Wallace Jr.'s admission When Bubba Wallace Jr. admitted to NBC Sports.com writer Dustin Long that he intentionally spun to in the Texas 500, the sanctioning body came down hard.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29134", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Playoff drivers preview Kansas: 'It's the biggest wild card of all' Drivers in the Monster Energy NASCAR Cup Series Playoffs explain why Kansas Speedway may be the biggest playoff wild card.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34030", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Promoted: The first 100 laps of Arrow McLaren SP's bold new era Patricio O'Ward, the 2018 Indy Lights champion, turned his first laps in an Arrow McLaren SP-Chevrolet IndyCar this week. Circumstances weren't ideal but driver, race engineer and managing director are already excited about their collective prospects, reports David Malsher.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34180", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NASCAR penalty report after Kansas Only one penalty was issued by NASCAR officials.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58469", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Watch every angle of the 'Big One' unfolding From the on-track look, to an overhead shot to an in-car camera, watch the 'Big One' -- which included Brendan Gaughan flipping -- from every angle.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N3067", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Scanner Sounds: Elation and elimination in Phoenix Relive the Monster Energy NASCAR Cup Series playoff race at ISM Raceway that saw Denny Hamlin advance and others fall short.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18618", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Jagger Jones earns K&N West Rookie of the Year honors Jagger Jones continues the tradition of racing success in the family, following in the footsteps of grandfather Parnelli and father P.J.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N53173", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Harvick has Cup title shot after 3rd straight Texas fall win FORT WORTH, Texas (AP)   Kevin Harvick and the Stewart-Haas Racing team had already been preparing for NASCAR's finale. With another win at Texas, they now know they will be racing for a Cup title in two weeks. Harvick won the fall Cup race at Texas for the third year in a row Sunday, again securing one of the championship-contending spots for the Nov. 17 season-ending race at Homestead-Miami Speedway. \"Well, we've already been going down the...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N3201", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Champions who won final race of the season Look back on the drivers who won the last race of the season over the years, and tune in for this year's championship race Sunday at Miami.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13867", "method": "POST", "url": "/v1/embeddings", "body": {"input": "After wild second round finish, what awaits NASCAR drivers at Martinsville? David Scott of the Charlotte Observer looks at the NASCAR playoff field", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N24367", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cup Series Championship 4 outlook The Championship 4 features three previous champions and the winningest active driver without a title.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33307", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Verstappen stripped of pole at Mexican Grand Prix Red Bull's Max Verstappen has been knocked from the pole position to fourth for the start of Sunday's Mexican Grand Prix after race stewards determined he drove at unsafe speeds after Mercedes driver Valtteri Bottas crashed late in qualifying.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55968", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NASCAR at Martinsville: Live race updates, results, highlights from First Data 500 Sporting News is tracking live updates, highlights and results from the First Data 500.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4347", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bluegreen Vacations 500 Entry List: ISM Raceway No. Driver Sponsor Make Organization 00 Landon Cassill StarCom Fiber Chevrolet StarCom Racing 1 Kurt Busch Monster Energy Chevrolet Chip Ganassi Racing 2 Brad Keselowski MilerLite Ford Team Penske 3 Austin Dillon American Ethanol Chevrolet Richard Childress Racing 4 Kevin Harvick Mobil 1 Ford Stewart-Haas Racing 6 Ryan Newman Mazola Ford Roush Fenway Racing 8 […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17374", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hendrick Motorsports in playoff peril at Kansas Speedway Chase Elliott insisted the weekly routine hasn't changed a bit within the Hendrick Motorsports garages, the four teams swapping information and ideas as if they were preparing for any other race. Only their race Sunday at Kansas Speedway isn't just any other race. Especially for three of the team's four drivers. Elliott is joined by Alex Bowman and William Byron outside of the cutline for the round of eight in NASCAR's...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N61350", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Briscoe on Phoenix after elimination: 'I made a lot of mistakes' Chase Briscoe shares his thoughts after just missing the Championship 4 in the Xfinity Series Playoffs Round of 8 elimination race at ISM Raceway.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N20491", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hamlin holds off Busch to win at Phoenix, make Championship 4 Denny Hamlin held off teammate Kyle Busch and Ryan Blaney in a three-lap sprint to the finish for victory at ISM Raceway to make the Championship 4.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N7424", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hamlin's victory, playoff elimination from Phoenix in 132 seconds Relive Denny Hamlin's victory at ISM Raceway to make the Championship 4 as drivers faced elimination in Phoenix.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51687", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cole Custer, Tyler Reddick have physical confrontation after Kansas race Both drivers fell to the pavement after being swarmed by team members but were unhurt.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50441", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Formula One follow Hamilton's eco-friendly policy Formula One appear to have taken on board six-time champion Lewis Hamilton's concerns over the environment and have announced plan to become carbon neutral by 2030. However, Formula One's move may not be to the liking of Hamilton's Red Bull rival Max Verstappen.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37530", "method": "POST", "url": "/v1/embeddings", "body": {"input": "O'Donnell on Logano-Hamlin scrap: 'We'll probably have to take some action' NASCAR Executive Vice President and Chief Racing Development Officer Steve O'Donnell hinted Monday morning on SiriusXM NASCAR Radio that a penalty was likely coming following a pit-road fracas between Joey Logano and Denny Hamlin that saw a crew member from the No. 22 team take Hamlin to the ground. \"We know emotions are going to […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8543", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Where Cup playoff drivers stand heading to Kansas Ryan Blaney's win dramatically altered the playoff picture entering this weekend's elimination race.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56104", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Denny Hamlin seals title bid with clinching Phoenix victory Denny Hamlin raced his way into the Championship 4 field with a clinching victory Sunday at ISM Raceway near Phoenix. Hamlin entered the day outside of the provisional final four, but survived a restart with four laps left in the Bluegreen Vacations 500 to seal his first title shot since 2014. He'll join Joe Gibbs […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42650", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Big 3, New 1: Contenders open title weekend with banter, no barbs Last year's Championship 4 Media Day included a now-famous quip from Joey Logano that the title field was \"The Big 3 and me.\" The Big 3, of course, was the triumvirate of Kyle Busch, Martin Truex Jr. and Kevin Harvick, who had dominated the season to that point. Those three returned to the Championship 4 […]", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N31434", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Arizona stands ready to take over NASCAR's championship race in 2020 In 2020, Arizona, not South Florida, will be the talk of NASCAR when the championship weekend moves from Homestead to ISM Raceway", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51427", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hamlin heads to Miami with different mindset: 'Definitely on house money' Whether it's a birthday celebration or a late-night dinner, Denny Hamlin is going to enjoy the Championship 4 weekend in Miami more than in 2010.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41680", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Podcast: Dale Jarrett believes Joey Logano (wisely) spun intentionally By bringing out a yellow at Martinsville, the Team Penske driver helped salvage his championship hopes, the NASCAR Hall of Famer said during the playoff edition of the NASCAR on NBC Podcast.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43544", "method": "POST", "url": "/v1/embeddings", "body": {"input": "NASCAR weather update: Race at Talladega to restart Monday after rain delay Sporting News had live updates and highlights from the 1000Bulbs.com 500 at Talladega on Sunday, which was postponed by rain and will restart Monday at 2 p.m.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52132", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bellerin calls for Arsenal unity after Xhaka tantrum Hector Bellerin has called for everyone at Arsenal to come together following club captain Granit Xhaka's tantrum on being substituted on Sunday during the 2-2 draw with Crystal Palace. Bellerin, who is the Gunners third captain after Xhaka and Pierre-Emerick Aubameyang, is sidelined through injury but he took to Twitter to urge understanding and the team to unite. Manger Unai Emery has said he will talk to Xhaka before he decides whether to...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51308", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Women's Champions League Roundup: Hegerberg Equals Record, City Held & Arsenal Net Five Five ​Is there any stopping the footballing freight train that is Lyon? Whether it is in European competition or on home soil, the French giants continue to stamp their authority on every football match they play, with Wednesday's Champions League round of 16 first leg clashes no different. All Wednesday's #UWCL round of 16 first-leg results with one more game to come on Thursday - what was the result of the night? https://t.co/MdfqorQsf2...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32102", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Cristiano Ronaldo Storms Out of Allianz Stadium After Substitution During Juventus' Win Over Milan ​A furious Cristiano Ronaldo left Allianz Stadium before the end of Juventus' 1-0 triumph over Milan on Sunday, having been substituted early in the second half. The Old Lady were level at 0-0 at the time of the forward's substitution, with Paulo Dybala coming on as his replacement. The 34-year-old could not hide his frustration after his evening came to a close with 35 minutes still left to play, but Maurizio Sarri's decision proved pivotal as...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44432", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Liverpool's move for Ryan Fraser makes perfect sense Speedy winger could be heading to Anfield as his contract at Bournemouth runs down.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11391", "method": "POST", "url": "/v1/embeddings", "body": {"input": "MLS Ownership Group Says Everything On Schedule For Stadium Construction New at 9, slowly but surely the professional soccer plan for St. Louis is coming together. Fox 2/News 11`s Vic Faust sat down with Carolyn Kindle Betz of the MLS4theLOU Ownership Group with the next steps we can expect.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25026", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Vlatko Andonovski is the most common sense hire possible for the USWNT Vlatko Andonovski will keep everything you loved about Jill Ellis, and add a dash of tactical sophistication.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23463", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Emery pleads for more time as Leicester pull further clear of Arsenal Arsenal manager Unai Emery pleaded for calm and patience after his side lost 2-0 at Leicester on Saturday to fall eight points behind the Premier League's top four. Jamie Vardy and James Maddison were the architects of another fine victory for the Foxes, who moved into second, as the English duo struck in the space of seven second-half minutes. A return to the Champions League next season was Emery's target after a summer of heavy investment in...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N13014", "method": "POST", "url": "/v1/embeddings", "body": {"input": "MLS Cup training notes: The final countdown Sounders, TFC conclude preparations for MLS Cup.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18932", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Sounders are MLS Cup champs! Here's all the merch you need to celebrate! A second MLS Cup returns to Seattle!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N4380", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Soccer notebook: $45 million Austin FC performance center latest sign of MLS's 'exponential' growth Austin isn't getting your father's Major League Soccer. Even head coach Josh Wolff and academy general manager Tyson Wahl, the first Austin FC employees to have played in the league -- both still shy of 43 years old -- barely recognize what's being built before their eyes. Especially when it comes to the $45 million St. David's Performance Center, the designs for which were unveiled Wednesday. ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63347", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Major Link Soccer: U.S. men embarrassed by Canada Fallout from England-Bulgaria, NWSL attendance is way up, and an incredible stat in Orlando.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18880", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Photos: 2019 Charles Schwab Cup Championship What Tom Lehman is doing off the course might be the true measure of the Scottsdale pro.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N2567", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Columbus acquires Nagbe from Atlanta for $1M in allocation Darlington Nagbe is a proven winner and the type of player who can be a difference-maker in our team, said Tim Bezbatchenko.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58922", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Hosting MLS Cup is great, but have you tried winning it at home? Winning at home means just as much to coaches like Brian Schmetzer and Tommy Dutra as the rest of us. We should take comfort in that.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33996", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Two soccer coaches accused of assaulting teen referee MIDWEST CITY, Okla. (KFOR) - Two Midwest City Soccer Club coaches have been suspended following an alleged assault on a teenage referee at a soccer tournament. The Oklahoma Soccer Association received a misconduct report after the incident allegedly occurred at the Turkey Shootout Tournament in Edmond on Sunday. Two teams of 11-year-olds were playing, one was from Lawton and the other from ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5871", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nashville SC: How to watch, stream 2019 MLS Expansion Draft Find out how to watch Nashville SC and Inter Miami CF will participate in the 2019 MLS Expansion Draft.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49895", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Bulgarian prime minister intervenes, Bulgaria FA chief resigns The prime minister has ordered me from today to suspend any relations with the BFU.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50603", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Why Sir Alex Ferguson Is Not in New 'Busby' Film About Legendary Man Utd Predecessor Former Manchester United manager Sir Alex Ferguson is alleged to have turned down the opportunity to appear in the soon-to-be released documentary film about fellow Old Trafford icon Sir Matt Busby because of involvement in a similar project on his own life. 'Busby', which tells the story of the Scot's time at Old Trafford from 1945, through the Busby Babes era and onto the 1968 European Cup, had its world premiere in Manchester on Monday night...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18631", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Soccer body FIFA may extend punishments globally after racism at Bulgaria-England match Soccer body FIFA may extend punishments globally after racism at Bulgaria-England match", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N49935", "method": "POST", "url": "/v1/embeddings", "body": {"input": "How USMNT can top Canada without Bradley, Pulisic Losing twice in one month to a nation who hadn't beaten you since Berhalter was in junior high would be a huge step back.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N16353", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Martial's Manchester United eases past Brighton Influential midfielder Scott McTominay needed help to get off the pitch after a stoppage time injury.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8639", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'Not everyone's the star': Inside Landon Donovan's decision to coach the USL's San Diego Loyal Donovan will be introduced as San Diego Loyal's first manager today. The news is surprising; throughout his magnificent, almost two-decade playing career he consistently said he wasn't especially interested in manning the sideline, at least not at the cutthroat professional level.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N58953", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Liverpool fans antipathy could have sparked Sterling attack: Rose Raheem Sterling's altercation with England team-mate Joe Gomez could have been sparked by a delayed reaction to the hatred aimed at the striker by Liverpool fans in their Premier League clash last Sunday said Danny Rose. Sterling -- who has been a target for Liverpool fans since his leaving for Manchester City in 2015 for £49 million ($63 million -- has been dropped for Thursday's Euro 2020 qualifier with Montenegro by Gareth Southgate after...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23519", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Phoenix Rising FC looks to advance to second straight USL Western Conference Finals Phoenix Rising FC will face Real Monarchs SLC in the USL Western Conference semifinals, the only team to defeat them at home this season.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64720", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Pulisic reacts to another Chelsea goal, win We want to be right up there at the top and we want to keep going!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30774", "method": "POST", "url": "/v1/embeddings", "body": {"input": "South Korean soccer team tells of 'rough' match in Pyongyang SEOUL, South Korea (AP)   South Korea's national soccer team described their World Cup qualifier against North Korea in Pyongyang as a \"rough\" match played under strange conditions that may be reported to FIFA. The historic match ended in a scoreless draw Tuesday at huge Kim Il Sung Stadium, which was empty of spectators. The match was also under a media blackout, and the South Koreans first spoke to journalists about the playing conditions upon...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41653", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Orange County SC 2019 position review: Goalkeepers Featuring plenty of turnover!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N586", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Premier League club grades: The story so far With almost a third of the PL season in the books, which teams have impressed and who has struggled?", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11410", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Atlanta United Report Cards: Leandro Gonzalez Pirez Behind every great team there's a Sergio Ramos", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N47951", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Barcelona Eyeing Move for Rennes Starlet Eduardo Camavinga Rennes' teenaged midfielder Eduardo Camavinga is being lined up by Barcelona, with director of football Eric Abidal travelling to France to watch him in action. The 17-year-old has missed just one match for Les Rouges et Noir this term, featuring in every Ligue 1 fixture. Though his side are tenth in the table, they are just three points off of the final Champions League qualification place, with Camavinga an integral player at the base of...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63419", "method": "POST", "url": "/v1/embeddings", "body": {"input": "The Current Leaders of Europe's Top 20 Leagues ​Around Europe, there are some utterly fascinating title races beginning to unfold, and there is fantastic football to be seen wherever you look. The more popular leagues often dominate the headlines, but there are stories to be told from all of Europe's major leagues, with teams all vying for a place in next season's Champions League. Here are the current standings of Europe's top 20 leagues, as dictated by UEFA's current ​league rankings. La...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N8769", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Vela leads LAFC past Zlatan's Galaxy for 1st playoff win LOS ANGELES (AP) Carlos Vela scored two goals in the first half and set up Diego Rossi's tiebreaking goal in the second half, and Los Angeles FC advanced to the MLS Western Conference final with a wild 5-3 victory over the LA Galaxy on Thursday night in the first postseason edition of this city rivalry.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N10064", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Pulisic keeps up scoring run for Chelsea in win over Palace American midfielder Christian Pulisic scored his fifth goal in three Premier League games as Chelsea beat Crystal Palace 2-0 on Saturday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25473", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Shock weekend for Barcelona, Bayern and other giants is a welcome reminder of soccer's uncertainty The thing that keeps us coming back to this beautiful game of ours, the thing that's got us so hopelessly hooked, is that we don't know. We think we know, but really we don't know.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N39628", "method": "POST", "url": "/v1/embeddings", "body": {"input": "U.S. soccer defender Emily Sonnett savors Florida return U.S. women's national soccer team defender Emily Sonnett returned to Jacksonville Sunday night for the world champion team's exhibition match against Costa Rica after playing for the Clay County-based Florida Sol briefly in 2014. Sonnett played all 90 minutes at fullback as the U.S. women's team dominated Costa Rica 6-0. Although Sonnett only played for Florida Sol for a handful of games in ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N21235", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Friday's Scores PREP FOOTBALL= Dematha 26, Bishop McNamara 14 McDonogh School 29, Archbishop Spalding 23 St. Frances 35, Life Christian, Va. 0 1A East= State Regional First Round= Fallston 46, Col. Richardson 32 Joppatowne 26, Patterson Mill 19 Perryville 20, Kent County 7 1A North= State Regional First Round= Dunbar 44, Baltimore Douglass 0 Edmondson-Westside 30, Francis Scott Key 16 1A South= State Regional First Round= Fairmont Heights 44, Friendly 12 Gwynn...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11123", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Austin FC announces $45M training facility in northeast Austin AUSTIN (Talk1370.com) -- Austin's first professional sports team will open a multi-million dollar training facility in northeast Austin. Austin FC officials announced Wednesday morning that the team will build its St. David's Performance Center at the Parmer Pond, just east of Interstate 35 on Parmer Lane. The 23-acre complex is expected to cost $45 million, and is just minutes from the team's $250 million stadium being constructed at McKalla...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43878", "method": "POST", "url": "/v1/embeddings", "body": {"input": "USL adds new team in Queens, David Villa involved USL Championship side coming to Queens, with NYCFC legend David Villa involved.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29014", "method": "POST", "url": "/v1/embeddings", "body": {"input": "FIFA hires Arsene Wenger for global soccer development role GENEVA (AP)   FIFA has hired Arsene Wenger in a full-time role leading its global work developing soccer. The former Arsenal manager accepted FIFA's offer Wednesday more than two months after it was first reported, and one week after talks with Bayern Munich about the German champion's vacant head coach job. FIFA said Wenger's title will be chief of global football development. He will oversee the rules-making panel known as IFAB, coaching...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37232", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Lion Links: 11/11/19 Minnesota's interest in Dom confirmed, Pride players abroad, USWNT wins big, and more.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N616", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Premier League Confirm No Major Changes to Use of VAR Pitchside Monitors Following Meeting ​The Premier League has announced that pitchside monitors will continue to be used sparingly by referees during the VAR process, following a meeting involving all 20 top flight clubs. The technology was introduced into the league at the beginning of the season, but it has been repeatedly criticised for numerous reasons. At a Shareholders' meeting today, the implementation of VAR was discussed and the Premier League and PGMOL committed to...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N60414", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Eintracht Frankfurt Captain Floors Freiburg Coach as Bundesliga Clash Descends Into Madness The Bundesliga has never shied away from a little bit of carnage, but Sunday's clash between SC Freiburg and Eintracht Frankfurt - yielding three red cards and some of the wildest post-match scenes you're ever likely to lay eyes on - has really taken the biscuit. With the two sides starting the day in seventh and ninth, you could have been forgiven for overlooking it in favour of the top-of-the-table action taking place in England at the same...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N27168", "method": "POST", "url": "/v1/embeddings", "body": {"input": "D.C. United 2019 season review: Chris Odoi-Atsem He beat cancer, y'all!", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22075", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Sounders Practice Notes: On to the next round Seattle prepares for Real Salt Lake", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N22054", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Reports of racial taunts against Arizona high school volleyball team under review A volleyball game between Salt River High School and Caurus Academy was suspended due to safety concerns.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62066", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Chicago Fire trade Hinsdale's Grant Lillard to Inter Miami The Chicago Fire's turnover continued Thursday with the team trading homegrown defender Grant Lillard to Inter Miami CF. In exchange for Lillard, the Fire received $75,000 in general allocation money from the expansion team. \"Going back to his days as an academy player, Grant always represented the club with pride,\" Fire President and general manager Nelson Rodriguez said in a statement. \"We ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15810", "method": "POST", "url": "/v1/embeddings", "body": {"input": "English soccer's anti-racism head grapples with being abused If Sanjay Bhandari was in any doubt about a key challenge he faces leading English soccer's anti-racism body Kick It Out, it was confirmed by abusive social media posts reacting to his appointment. \"My first thought was just a little bit of shock,\" Bhandari told The Associated Press. \"But then I come from a different generation. We used to take quite a lot and I used to take quite a lot on the terraces. \"And I knew that actually...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25313", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Sounders stun LAFC, advance to third MLS Cup in four years LAFC's magical season won't get its fairytale finish.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N9491", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Friday's Scores PREP FOOTBALL= Adams Central 42, Woodlan 14 Andrean 28, Highland 21 Avon 37, Noblesville 13 Batesville 42, Connersville 13 Bedford N. Lawrence 23, Jeffersonville 20 Benton Central 27, Northwestern 19 Bloomington North 34, Southport 31, OT Bluffton 7, Lakeland 2 Boone Grove 56, Whiting 0 Brown Co. 37, Greencastle 27 Brownstown 39, Scottsburg 13 Calumet 63, Hammond Noll 6 Carmel 20, Lawrence Central 7 Carroll (Ft. Wayne) 20, Ft. Wayne Wayne 12...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N11792", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Son's red card for tackle on Gomes overturned Son's red card overturned as Tottenham win appeal.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N64639", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tennis: Young pretenders arrive in force in London Tennis: Young pretenders arrive in force in London", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30211", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'Super sad' Nadal out of Paris Masters, doubt for ATP Finals Rafael Nadal pulled out of the Paris Masters with an abdominal injury just minutes before the scheduled start of his semi-final against Denis Shapovalov on Saturday, and admitted his participation at the ATP Tour Finals was in doubt. The 33-year-old has battled multiple injuries throughout his career and also pulled out of the Paris Masters on his last appearance in 2017 before the quarter-finals.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N52478", "method": "POST", "url": "/v1/embeddings", "body": {"input": "French captain Benneteau names unchanged team for Fed Cup final France captain Julien Benneteau kept faith with the five women who sealed the semi-final win against Romania in April by naming an unchanged team on Monday for the Fed Cup final against Australia. Kristina Mladenovic, ranked 39 in the world, will be backed by Caroline Garcia (45), Alize Cornet (60), Fiona Ferro (63) and Pauline Parmentier (121) in next month's final in Perth. \"So far, these five players have turned up every time,\" said...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1938", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nadal beaten by Zverev in ATP Finals opener Nadal beaten by Zverev in ATP Finals opener", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62382", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Clijsters could struggle with physicality of modern game: say top coaches Clijsters could struggle with physicality of modern game: say top coaches", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N15469", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Murray excited to see what next couple of years can bring Murray excited to see what next couple of years can bring", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N1753", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Federer and Djokovic drawn in same ATP finals group Spectators will be hoping for a mini repeat of this year's epic Wimbledon final between Novak Djokovic and Roger Federer after the two tennis legends were drawn in the same group for next week's climax to the season, the ATP Finals. Djokovic, who could finish the week as world number one, and Federer fought out a thrilling five set final at Wimbledon with the Serbian coming from a break down in the final set to win it 7-6 (7/5), 1-6, 7-6 (7/4),...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12105", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Carmel boys tennis gets triple crown with team, singles and doubles state titles Presley Thieneman won the singles state title and Uday Lomada and Jones McNamer added the doubles crown to make it a clean sweep for the Greyhounds.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17075", "method": "POST", "url": "/v1/embeddings", "body": {"input": "France clinches Fed Cup with epic 3-2 win over Australia PERTH, Australia (AP) Kristina Mladenovic inspired France to a drought-breaking Fed Cup triumph after a nail-biting 3-2 win in the final against Australia on Sunday.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N29869", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Serena Williams through the years A look back at Serena Williams' career.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25655", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Australian Open on Murray's radar after next week's Davis Cup finals The birth of Andy Murray's third child has forced him to change schedule but the Scot is already setting sights on the Australian Open and a return to the major stages", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62731", "method": "POST", "url": "/v1/embeddings", "body": {"input": "'Big Three' hail future stars of men's tennis Roger Federer, Rafael Nadal and Novak Djokovic have hailed the fast-rising next generation of players, saying the future of tennis is \"in good hands\" ahead of the start of the ATP Finals. The \"Big Three\" remain the men to beat at the season-ending tournament in London -- as they were when they first all played together at the event in 2007. But the eight-man field at the O2 Arena contains a crop of exciting young players who have their eye on...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30236", "method": "POST", "url": "/v1/embeddings", "body": {"input": "American teenager Gauff reaches maiden WTA final in Linz American teenager Gauff reaches maiden WTA final in Linz", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57862", "method": "POST", "url": "/v1/embeddings", "body": {"input": "For Rockland Scholar-Athlete Sydney Miller, tennis is about family, team and competition Clarkstown North's Sydney Miller is a three-time Journal News Rockland girls tennis player of the year.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N33933", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Naomi Osaka: 'I want to leave some sort of legacy' Naomi Osaka has learned a lot about dealing with expectations in 2019.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N46069", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Rafael Nadal Slams Reporter After Being Asked if Recent Marriage Led to Loss at ATP Finals Rafael Nadal Slams Reporter Who Asked if Marriage Caused Loss", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N3843", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Federer brushes aside De Minaur to claim record 10th Basel title Roger Federer clinched a record-extending 10th Swiss Indoors championship title in his hometown of Basel.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5292", "method": "POST", "url": "/v1/embeddings", "body": {"input": "De Minaur beats Tiafoe to reach 2nd successive final MILAN (AP) Top-seeded Alex de Minaur beat Frances Tiafoe at the Next Gen Finals on Friday to reach his second successive final in Milan.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N65070", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Djokovic thrashes Berrettini, Thiem stuns Federer Djokovic thrashes Berrettini, Thiem stuns Federer", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30988", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Djokovic enjoys 'fun' Nadal practice session ahead of No. 1 battle Novak Djokovic enjoyed a \"fun\", but rare, practice session with Rafael Nadal ahead of this week's Paris Masters as the old rivals prepare to battle for the year-end world number one spot. Nadal, who claimed his 19th Grand Slam title last month with an epic US Open final win over Daniil Medvedev, has been the year-end world number one on four occasions.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N34707", "method": "POST", "url": "/v1/embeddings", "body": {"input": "From the Alps to Wimbledon: Unlikely lad Jannick Sinner is following in Novak Djokovic's footsteps as former skier aims at tennis stardom The last great tennis player to emerge, incongruously, from an upbringing that took place largely in a mountainous ski area was one of the greatest ever: Novak Djokovic.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63350", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tennis: Thiem begins Vienna campaign with win over Tsonga Tennis: Thiem begins Vienna campaign with win over Tsonga", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56981", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nadal saves match point v Medvedev for 1st win at ATP Finals LONDON (AP)   Facing match point at 5-1 down in the third set, Rafael Nadal gave himself about a one-in-a-thousand chance of turning things around against Daniil Medvedev at the ATP Finals. Those odds turned out to be more than good enough for the top-ranked Spaniard. Nadal saved that match point with a perfect drop shot and then rallied to beat Medvedev 6-7 (3), 6-3, 7-6 (4) Wednesday, keeping alive his chances of advancing from the group...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N51841", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Noted Bad Boy Roger Federer Finally Penalized for Unsportsmanlike Behavior There's no denying that Roger Federer is a transcendent talent, but for tennis fans with children, it's always been tough to watch him play due to his reputation for outbursts and unprofessional behavior.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N37152", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tennis: Teenager Gauff puts homework on hold to stun top seed Bertens in Linz Tennis: Teenager Gauff puts homework on hold to stun top seed Bertens in Linz", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N65096", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Federer celebrates 1,500th match with Basel breeze Roger Federer opened his bid for a 10th title at the ATP Swiss indoors in Basel on Monday, crushing German qualifier Peter Gojowczyk in what was the Swiss legend's 1,500th career match. This landmark 6-2, 6-1 success in his hometown set the 38-year-old up for his tilt at a 103rd title. \"I thought the match was good,\" Federer said. \"I felt a nice spring in my step. I was quick to the ball and it didn't take me long to get used to the conditions,...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N35588", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Federer withdraws from inaugural ATP Cup Federer withdraws from inaugural ATP Cup", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N62065", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Andy Murray targets Australian Open after bouncing back from 'rough year' He's made an impressive recovery from career-saving hip surgery, but Andy Murray says he questioned whether he wanted to return to tennis.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36474", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nadal beats Wawrinka again to reach Paris Masters quarters PARIS (AP) Rafael Nadal beat Stan Wawrinka for the 19th time in 22 meetings, winning 6-4, 6-4 Thursday to reach the Paris Masters quarterfinals.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N55177", "method": "POST", "url": "/v1/embeddings", "body": {"input": "ATP World Tour 250, Antwerp Men's Singles Results TENNIS-ATP/RESULTS MENS SINGLES:ATP World Tour 250, Antwerp Men's Singles Results", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N23313", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Sinner basking in spotlight with Next Gen ATP Finals win Italian teenager Jannik Sinner admitted he felt like Roger Federer or Rafael Nadal as he basked in the spotlight after defeating top-seed Australian Alex de Minaur in straight sets to win the Next Gen ATP Finals on home soil in Milan on Saturday. The 18-year-old Sinner, an eighth-seeded wildcard, saved nine break points to win 4-2, 4-1, 4-2 in just over an hour against 18th-ranked De Minaur, who also lost last year's final to Stefanos Tsitsipas....", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N19534", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tsitsipas thrashes Zverev to reach ATP semis Tsitsipas thrashes Zverev to reach ATP semis", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N50760", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Teenage star Gauff beats Ostapenko to win 1st WTA title Teenage prodigy Coco Gauff won her first WTA title on Sunday following a 6-3, 1-6, 6-2 win over Jelena Ostapenko.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N36393", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Serena Williams Shows Off Her Assets While Modeling Plaid Pants For Boss Babes She makes every outfit look good.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N63000", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Osaka, Barty open WTA Finals campaigns with victories Naomi Osaka extended her winning-streak to 11 matches after defeating Petra Kvitova of the Czech Republic 7-6 (1), 4-6, 6-4 in the first of three round-robin matches at this year's WTA Finals,", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N44307", "method": "POST", "url": "/v1/embeddings", "body": {"input": "A century later, Naomi Osaka, Kei Nishikori can bring Japan Olympic tennis to forefront Naomi Osaka and Kei Nishikori, already among Japan's biggest sports stars, could team up in Tokyo.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N5063", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tennis Star Rafael Nadal Marries Maria Francisca Perello In Spain The athlete tied the knot with his longtime love at a castle.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N18520", "method": "POST", "url": "/v1/embeddings", "body": {"input": "ATP roundup: Federer earns walkover into Swiss semis ATP roundup: Federer earns walkover into Swiss semis", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N32517", "method": "POST", "url": "/v1/embeddings", "body": {"input": "In a career of landmarks, Federer set for 1,500th match Roger Federer will check off another landmark on Monday when he starts his bid for a 10th Basel title by playing the 1,500th match of his career. \"If I look back at my whole career I've had a lot of matches that I could have won that I lost.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N41710", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Osaka withdraws from WTA finals with shoulder injury Osaka withdraws from WTA finals with shoulder injury", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N56464", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Defending champ Zverev beats error-prone Nadal at ATP Finals LONDON (AP)   After being thoroughly outplayed by defending champion Alexander Zverev at the ATP Finals, Rafael Nadal refused to make any excuses. The top-ranked Spaniard wouldn't blame the abdominal problem that forced him to pull out of the Paris Masters semifinals just nine days earlier, or a hand injury that kept him sidelined before that. And he bristled at the notion that his recent marriage could be a factor in a sub-par performance....", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N25068", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Wawrinka sets up quarter-final with fellow Swiss Federer Wawrinka sets up quarter-final with fellow Swiss Federer", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N43836", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Federer to play French Open next year Swiss tennis legend Roger Federer said Thursday he will play the French Open in Paris next year. \"I will play the French Open.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N12925", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Tennis champion Maria Sharapova on overcoming career setbacks ABC News' Rebecca Jarvis sat down with tennis champion and CEO of Sugarpova Maria Sharapova for \"No Limits with Rebecca Jarvis\" podcast.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N30991", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Australia snub Stosur for Fed Cup singles, pick Tomljanovic Australia snub Stosur for Fed Cup singles, pick Tomljanovic", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N57787", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Roger Federer says he plans to play at 2020 Tokyo Olympics TOKYO (AP)   Roger Federer says he plans to play at the 2020 Tokyo Olympics. The Swiss great, a four-time Olympian, says \"at the end of the day my heart decided I would love to play at the Olympic Games again.\" Federer made the announcement in Tokyo during at an exhibition event for his Japanese uniform supplier. Federer will turn 39 shortly after the Olympic tournament. He had previously planned his schedule up to Wimbledon, which ends two...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N48001", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Nick Kyrgios and Milos Raonic added to Delray Beach Open lineup The Delray Beach Open lineup keeps adding more talent. Nick Kyrgios and Milos Raonic have committed to the ATP 250 event, joining Juan Martin del Potro, Kei Nishikori and Bob and Mike Bryan in the field for the Feb. 14-23 event next year. Kyrgios had his coming-out party at Wimbledon in 2014 when he defeated top-ranked Rafael Nadal to become the first man to reach the tournament's ...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N17996", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Defending champion Khachanov dumped out at Bercy, Shapovalov through Karen Khachanov's Paris Masters title defence ended at the first hurdle on Tuesday as the Russian lost 7-6 (7/5), 3-6, 7-5 to German Jan-Lennard Struff. Khachanov beat four top-10 players, including Novak Djokovic in the final, to win the 2018 tournament, but was knocked out after an indifferent second-round display this time around. The early exit ends the world number eight's slim hopes of qualifying for next month's ATP Tour Finals in London....", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N42960", "method": "POST", "url": "/v1/embeddings", "body": {"input": "Next generation smells fear after Federer, Djokovic exit Shanghai Defeats for Roger Federer and Novak Djokovic mean that the winner of the Shanghai Masters will be aged 23 or under -- more proof that the next generation of men's tennis stars is closing in. For the first time in 20 years at a Masters 1000 event, all four semi-finalists are 23 and under, according to Shanghai Masters organisers.", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
{"custom_id": "N340", "method": "POST", "url": "/v1/embeddings", "body": {"input": "President Macron hosts Fed Cup winners at Elysee Palace The French women's victorious tennis team was the toast of the presidential palace as Emmanuel Macron hosted the Fed Cup side on their return from Australia on Tuesday. Caroline Garcia, Kristina Mladenovic and Pauline Parmentier aswell as captain Julien Benneteau and other members of the team who didn't play were met by the head of state for a brief celebratory drink. \"You showed great spirit, coming together, forming a team, easing tensions,...", "model": "text-embedding-3-large", "encoding_format": "float", "dimensions": 1024}}
